----------------------------------------------------------------------------------------------
      name:  estimates
       log:  C:\Users\jamel\Dropbox\Latex\PROJECTS\22-12-reer-tot-res-pm\Archive\Data\estimate
> s.log
  log type:  text
 opened on:   9 Jul 2025, 10:49:24

. 
. use   cross-section-data-22-alt-EL.dta, clear

. 
. 
. **# Fig. 2. Cross-country distribution of FX depreciation from May 2021 to September 2022. N
> ote: FX depreciation on the y-axis corresponds to the percent depreciation against the US do
> llar.
. 
. set scheme stcolor

. 
. graph bar dFX if dFX>0 & dFX<100,                                               ///
>       over(country, label(angle(90)                                             ///
>           labsize(vsmall))                                                                  
>     ///
>           gap(25) sort(1) descending)                                           ///
>           ytitle(FX Depreciation (%)) xsize(8)

.           graph rename fx_depre, replace

. 
. graph export fx_depre.png, replace
(file fx_depre.png not found)
file fx_depre.png saved as PNG format

. graph export fx_depre.pdf, replace
file fx_depre.pdf saved as PDF format

. graph export fx_depre.tif, width(4000) replace
(file fx_depre.tif not found)
file fx_depre.tif saved as TIFF format

. 
. **# Table 1. Dependent variable: FX change from May 2021 - Sep 2022 (%), depreciations only
. 
. reg       dFX RESGDP2020                      ///
>               if dFX>0 & dFX<100                  ///
>               , robust

Linear regression                               Number of obs     =         84
                                                F(1, 82)          =      12.37
                                                Prob > F          =     0.0007
                                                R-squared         =     0.0909
                                                Root MSE          =     16.155

------------------------------------------------------------------------------
             |               Robust
         dFX | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  RESGDP2020 |  -.1778438   .0505715    -3.52   0.001    -.2784465    -.077241
       _cons |   23.36365   3.028035     7.72   0.000     17.33993    29.38738
------------------------------------------------------------------------------

. estimate  store dfx_1_EL

.                   
. reg       dFX RESGDP2020 c.RATE20q4                          ///
>           dRATE22q2_21q2                                     ///
>           RGDP_PK_2019 RPCPI_2019 CAB_2019                   ///
>               NIIP_19 ers_2019 OPEN_2019                         ///
>               FUELX_2019 FUELM_2019                              ///
>               if dFX>0 & dFX<100                                 ///
>               , robust

Linear regression                               Number of obs     =         52
                                                F(11, 40)         =       1.85
                                                Prob > F          =     0.0764
                                                R-squared         =     0.2304
                                                Root MSE          =      10.25

--------------------------------------------------------------------------------
               |               Robust
           dFX | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
    RESGDP2020 |  -.1733842   .0757074    -2.29   0.027    -.3263946   -.0203739
      RATE20q4 |  -.3481243   .4323222    -0.81   0.425     -1.22188    .5256315
dRATE22q2_21q2 |   .1886991   .4983639     0.38   0.707    -.8185319     1.19593
  RGDP_PK_2019 |   .0332558   .0411133     0.81   0.423    -.0498372    .1163489
    RPCPI_2019 |  -.0204263   .0421593    -0.48   0.631    -.1056335    .0647808
      CAB_2019 |   .1520929   .2329816     0.65   0.518    -.3187805    .6229663
       NIIP_19 |   .0016206   .0151215     0.11   0.915    -.0289411    .0321823
      ers_2019 |  -10.30334   8.701386    -1.18   0.243     -27.8895    7.282813
     OPEN_2019 |   .0324084    .051404     0.63   0.532     -.071483    .1362998
    FUELX_2019 |    -.10799   .0876247    -1.23   0.225    -.2850863    .0691062
    FUELM_2019 |  -.0215901   .2167147    -0.10   0.921     -.459587    .4164067
         _cons |   24.99821   7.743905     3.23   0.002     9.347197    40.64923
--------------------------------------------------------------------------------

. estimate  store dfx_2_EL

. 
. reg       dFX RESGDP2020 c.RESGDP2020#c.FI_2019                                   ///
>           RATE20q4 c.RATE20q4#c.kaopen_2019                       ///
>           dRATE22q2_21q2                                          ///
>           RGDP_PK_2019 RPCPI_2019 CAB_2019                        ///
>               NIIP_19 ers_2019 OPEN_2019                              ///
>               FUELX_2019 FUELM_2019                                   ///
>               if dFX>0 & dFX<100                                      ///
>               , robust

Linear regression                               Number of obs     =         51
                                                F(13, 37)         =       1.57
                                                Prob > F          =     0.1392
                                                R-squared         =     0.2716
                                                Root MSE          =     10.317

------------------------------------------------------------------------------------------
                         |               Robust
                     dFX | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
              RESGDP2020 |  -.4474491   .1906886    -2.35   0.024    -.8338209   -.0610773
                         |
  c.RESGDP2020#c.FI_2019 |   .3400097   .2066278     1.65   0.108     -.078658    .7586773
                         |
                RATE20q4 |  -.8955765   .7172229    -1.25   0.220    -2.348808    .5576551
                         |
c.RATE20q4#c.kaopen_2019 |  -.4343027   .4778347    -0.91   0.369    -1.402488    .5338824
                         |
          dRATE22q2_21q2 |   .2441697   .5617184     0.43   0.666      -.89398    1.382319
            RGDP_PK_2019 |   -.016332    .052036    -0.31   0.755     -.121767    .0891031
              RPCPI_2019 |   -.034782   .0436055    -0.80   0.430    -.1231351    .0535711
                CAB_2019 |   -.080691   .3095326    -0.26   0.796    -.7078636    .5464816
                 NIIP_19 |   .0089255   .0162648     0.55   0.586      -.02403    .0418811
                ers_2019 |  -4.564181   9.548932    -0.48   0.635    -23.91216    14.78379
               OPEN_2019 |   .0339407   .0541948     0.63   0.535    -.0758684    .1437498
              FUELX_2019 |  -.0566927   .0930288    -0.61   0.546    -.2451871    .1318016
              FUELM_2019 |   .0711362   .3362508     0.21   0.834    -.6101725    .7524449
                   _cons |   26.63997   9.128128     2.92   0.006     8.144622    45.13531
------------------------------------------------------------------------------------------

. estimate  store dfx_3_EL

. 
. stepwise, pr(.2):                                                 ///
> reg       dFX RESGDP2020 c.RESGDP2020#c.FI_2019                                   ///
>           RATE20q4 c.RATE20q4#c.kaopen_2019                       ///
>           dRATE22q2_21q2                                          ///
>           RGDP_PK_2019 RPCPI_2019 CAB_2019                        ///
>               NIIP_19 ers_2019 OPEN_2019                              ///
>               FUELX_2019 FUELM_2019                                   ///
>               if dFX>0 & dFX<100                                      ///
>               , robust

Wald test, begin with full model:
p = 0.8336 >= 0.2000, removing FUELM_2019
p = 0.7879 >= 0.2000, removing CAB_2019
p = 0.7017 >= 0.2000, removing RGDP_PK_2019
p = 0.7276 >= 0.2000, removing NIIP_19
p = 0.7042 >= 0.2000, removing dRATE22q2_21q2
p = 0.4550 >= 0.2000, removing RPCPI_2019
p = 0.5901 >= 0.2000, removing OPEN_2019
p = 0.5578 >= 0.2000, removing ers_2019
p = 0.2737 >= 0.2000, removing FUELX_2019

Linear regression                               Number of obs     =         51
                                                F(4, 46)          =       6.01
                                                Prob > F          =     0.0006
                                                R-squared         =     0.2283
                                                Root MSE          =     9.5239

------------------------------------------------------------------------------------------
                         |               Robust
                     dFX | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
              RESGDP2020 |  -.3517322   .1220917    -2.88   0.006    -.5974902   -.1059743
                         |
  c.RESGDP2020#c.FI_2019 |   .2781995   .1371434     2.03   0.048     .0021442    .5542549
                         |
                RATE20q4 |  -1.313967   .5022084    -2.62   0.012     -2.32486    -.303074
                         |
c.RATE20q4#c.kaopen_2019 |  -.4601126   .3280927    -1.40   0.168    -1.120529    .2003038
                         |
                   _cons |   22.58771   2.618929     8.62   0.000     17.31608    27.85934
------------------------------------------------------------------------------------------

. estimate  store dfx_4_EL

. 
. reg       dFX RESGDP2020 c.RESGDP2020#c.FI_2019                                   ///
>           RATE20q4 c.RATE20q4#c.kaopen_2019                       ///
>           dRATE22q2_21q2                                          ///
>           RGDP_PK_2019 RPCPI_2019 CAB_2019                        ///
>               NIIP_19 ers_2019 OPEN_2019                              ///
>               FUELX_2019 FUELM_2019 DEBT_2019                         ///
>               if dFX>0 & dFX<100                                      ///
>               , robust

Linear regression                               Number of obs     =         32
                                                F(14, 17)         =       3.72
                                                Prob > F          =     0.0060
                                                R-squared         =     0.5225
                                                Root MSE          =     8.6883

------------------------------------------------------------------------------------------
                         |               Robust
                     dFX | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
              RESGDP2020 |  -1.016478   .2157639    -4.71   0.000      -1.4717   -.5612557
                         |
  c.RESGDP2020#c.FI_2019 |   1.419167   .3939182     3.60   0.002     .5880728    2.250262
                         |
                RATE20q4 |  -1.792996   .7418117    -2.42   0.027    -3.358082     -.22791
                         |
c.RATE20q4#c.kaopen_2019 |  -.5297627   .5057742    -1.05   0.310    -1.596853    .5373276
                         |
          dRATE22q2_21q2 |  -.8288065   .3839903    -2.16   0.045    -1.638955   -.0186578
            RGDP_PK_2019 |  -1.147605   .3695399    -3.11   0.006    -1.927266   -.3679442
              RPCPI_2019 |  -.0045063   .0487382    -0.09   0.927    -.1073349    .0983223
                CAB_2019 |  -.7432733   .2360028    -3.15   0.006    -1.241196   -.2453509
                 NIIP_19 |   .1140774   .0422217     2.70   0.015     .0249974    .2031574
                ers_2019 |   .6444495   8.741662     0.07   0.942    -17.79885    19.08774
               OPEN_2019 |  -.0068168   .0912371    -0.07   0.941    -.1993103    .1856766
              FUELX_2019 |     .06274   .1490984     0.42   0.679      -.25183      .37731
              FUELM_2019 |  -.2740454   .3653239    -0.75   0.463    -1.044811    .4967205
               DEBT_2019 |   .1245039   .0769867     1.62   0.124    -.0379237    .2869316
                   _cons |   38.53095   12.84174     3.00   0.008     11.43725    65.62465
------------------------------------------------------------------------------------------

. estimate  store dfx_5_EL

. 
. reg       dFX c.RESGDP2020##c.sum_FXI_broad_proxy_GDP_m                   ///
>           RATE20q4                       ///
>           dRATE22q2_21q2                                          ///
>           RGDP_PK_2019 RPCPI_2019 CAB_2019                        ///
>               NIIP_19 ers_2019 OPEN_2019                              ///
>               FUELX_2019 FUELM_2019                         ///
>               if dFX>0 & dFX<100                                      ///
>               , robust

Linear regression                               Number of obs     =         47
                                                F(13, 33)         =       3.89
                                                Prob > F          =     0.0008
                                                R-squared         =     0.4122
                                                Root MSE          =     9.2626

---------------------------------------------------------------------------------------------
                            |               Robust
                        dFX | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------------+----------------------------------------------------------------
                 RESGDP2020 |  -.1609746    .074645    -2.16   0.038    -.3128409   -.0091082
  sum_FXI_broad_proxy_GDP_m |  -2.051396   .7972782    -2.57   0.015     -3.67347   -.4293212
                            |
               c.RESGDP2020#|
c.sum_FXI_broad_proxy_GDP_m |    .044937     .02105     2.13   0.040     .0021105    .0877635
                            |
                   RATE20q4 |  -.0621615   .3832676    -0.16   0.872    -.8419254    .7176023
             dRATE22q2_21q2 |  -.1795463   .5026127    -0.36   0.723    -1.202119    .8430268
               RGDP_PK_2019 |   .0480265   .0390839     1.23   0.228    -.0314902    .1275433
                 RPCPI_2019 |  -.0279247   .0285101    -0.98   0.334    -.0859288    .0300795
                   CAB_2019 |  -.1781303   .2558871    -0.70   0.491    -.6987365     .342476
                    NIIP_19 |   .0136157   .0139101     0.98   0.335    -.0146846     .041916
                   ers_2019 |   -16.9897    8.26161    -2.06   0.048    -33.79807   -.1813256
                  OPEN_2019 |   .1143474   .0586671     1.95   0.060    -.0050117    .2337065
                 FUELX_2019 |  -.1479055   .0840539    -1.76   0.088    -.3189144    .0231035
                 FUELM_2019 |  -.0878281   .1677545    -0.52   0.604    -.4291273     .253471
                      _cons |    23.8042   6.654842     3.58   0.001     10.26482    37.34358
---------------------------------------------------------------------------------------------

. estimate  store dfx_6_EL

. 
. local     switches "dec(4) word se e(rmse)"

. outreg2   [dfx_*] ///
>           using "dfx_depre.04.08.2023.tex", replace `switches'
dfx_depre.04.08.2023.tex
dfx_depre.04.08.2023.rtf
dir : seeout

. 
. **# Fig. 3. Ex ante reserves and FX depreciation from June 16–18, 2021.
. 
. scatter   dFXdaily RESGDP2020                                /// 
>           if dFXdaily>0 & RESGDP2020<80,                     ///
>                   xtitle("Reserves/GDP, 2020")                       ///
>                   ytitle("FX Depreciation, June 16-18 2021 (%)")     ///
>                   name(FXDReserves_i_2020, replace)                  /// 
>                   mlabel(iso2c) xsize(8) ||                          ///
>                   lfit dFXdaily RESGDP2020 if                        ///
>                   dFXdaily>0 & RESGDP2020<80, legend(off)

.                   
. graph export fx_depre_daily.png, replace
(file fx_depre_daily.png not found)
file fx_depre_daily.png saved as PNG format

. graph export fx_depre_daily.pdf, replace
file fx_depre_daily.pdf saved as PDF format

. graph export fx_depre_daily.tif, width(4000) replace
(file fx_depre_daily.tif not found)
file fx_depre_daily.tif saved as TIFF format

. 
. 
. **# Table A.1: Descriptive statistics
. 
. sum       dFX RESGDP2020 RATE20q4 dRATE22q2_21q2      ///
>           RGDP_PK_2019 RPCPI_2019 CAB_2019            ///
>               NIIP_19 kaopen_2019 ers_2019 OPEN_2019      ///
>               FUELX_2019 FUELM_2019 DEBT_2019

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         dFX |        124    16.57482    57.13611  -33.98732    606.761
  RESGDP2020 |        124    29.78893    26.41529   .1484797   144.0998
    RATE20q4 |        107    3.582625     5.07166       -.75         38
dRATE22q2_~2 |         96    1.611872    3.105604         -5      15.85
RGDP_PK_2019 |        124    24.96479    32.06006   .7890324   143.5363
-------------+---------------------------------------------------------
  RPCPI_2019 |        116    128.1636    52.57299   84.46202   433.5731
    CAB_2019 |        120   -1.937033    8.564235   -34.3585   33.89913
     NIIP_19 |        120   -9.696683    153.2332  -271.1524   914.7737
 kaopen_2019 |        116    .4042721    1.509945  -1.927032   2.310613
    ers_2019 |        116    .6050137    .2862065   .0605321          1
-------------+---------------------------------------------------------
   OPEN_2019 |        115    90.43583    56.20035   26.45195   353.7595
  FUELX_2019 |        105    15.45771    25.06269          0    95.2427
  FUELM_2019 |        108    13.84272    7.210851   .5275592   33.96311
   DEBT_2019 |         80    57.42737     39.2169   3.277699   250.4566

. outreg2   using sum.doc, replace sum(log)             ///
>           keep(dFX RESGDP2020 RATE20q4 dRATE22q2_21q2 ///
>           RGDP_PK_2019 RPCPI_2019 CAB_2019            ///
>               NIIP_19 kaopen_2019 ers_2019 OPEN_2019      ///
>               FUELX_2019 FUELM_2019 DEBT_2019 FI_2019)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         cn2 |        124    114.0565    67.82681          2        225
       iso2c |        124    116.8226    63.97675         10        225
     imfcode |        124    541.2742    266.7914        111        968
          FX |        124    796.2801    3076.892     .30894      23295
         dFX |        124    16.57482    57.13611  -33.98732    606.761
-------------+---------------------------------------------------------
  RESGDP2020 |        124    29.78893    26.41529   .1484797   144.0998
   PRATE20q4 |         63     4.11045    6.200776       -.75         38
dPRATE22q2~2 |         59     2.47322    3.472046         -5      15.85
   DRATE20q4 |         96    3.497012    4.412444  -.4087037   31.87892
dDRATE22q2~2 |         83    .9369867    2.349435   -1.94838   11.22867
-------------+---------------------------------------------------------
    RATE20q4 |        107    3.582625     5.07166       -.75         38
dRATE22q2_~2 |         96    1.611872    3.105604         -5      15.85
RGDP_PK_2019 |        124    24.96479    32.06006   .7890324   143.5363
RGDP_PK_2020 |        124    23.73926     30.6976   .7421945   144.4479
  RPCPI_2019 |        116    128.1636    52.57299   84.46202   433.5731
-------------+---------------------------------------------------------
  RPCPI_2020 |        112    150.6776    212.6571   83.26219   2296.151
    CAB_2019 |        120   -1.937033    8.564235   -34.3585   33.89913
    CAB_2020 |        120   -2.860251    8.650826  -35.43271   20.79055
   NIIP_2019 |        120   -.0969668    1.532332  -2.711524   9.147737
   NIIP_2020 |        120   -.0454769    2.046071  -5.168314    10.5071
-------------+---------------------------------------------------------
     NIIP_19 |        120   -9.696683    153.2332  -271.1524   914.7737
     NIIP_20 |        120   -4.547689    204.6071  -516.8314    1050.71
 kaopen_2019 |        116    .4042721    1.509945  -1.927032   2.310613
 kaopen_2020 |        117     .393021    1.517489  -1.927032   2.310613
RATE20q4_100 |        107    .0358262    .0507166     -.0075        .38
-------------+---------------------------------------------------------
dRATE22q2_~S |         96    .1118718    3.105604       -6.5      14.35
    ers_2019 |        116    .6050137    .2862065   .0605321          1
    ers_2020 |        116    .5450339    .3187408   .0386158          1
     FD_2019 |        119    .3468808    .2126599   .0400039   .9190351
     FD_2020 |        119    .3537716    .2165869   .0451483   .9478135
-------------+---------------------------------------------------------
     FI_2019 |        119    .4670069    .1967141   .0785745   .9346398
     FI_2020 |        119    .4694167    .1951836   .0886788   .9526684
     FM_2019 |        119     .214326    .2552452          0   .8987359
     FM_2020 |        119     .225451    .2669556          0   .9218208
   OPEN_2019 |        115    90.43583    56.20035   26.45195   353.7595
-------------+---------------------------------------------------------
   OPEN_2020 |        113     80.9007    52.78183   23.38376   350.6812
  FUELX_2019 |        105    15.45771    25.06269          0    95.2427
  FUELX_2020 |        100    12.62846    21.94056          0   93.11352
  FUELM_2019 |        108    13.84272    7.210851   .5275592   33.96311
  FUELM_2020 |        104    11.01131    6.411674   .4400495   36.51402
-------------+---------------------------------------------------------
         idc |        124    .0887097    .2854777          0          1
         ldc |        124    .9112903    .2854777          0          1
         emg |        124    .2822581    .4519242          0          1
         eap |        124    .1693548    .3765866          0          1
         eca |        124    .1693548    .3765866          0          1
-------------+---------------------------------------------------------
        mena |        124    .1048387    .3075883          0          1
          sa |        124    .0564516     .231728          0          1
          we |        124    .0564516     .231728          0          1
          na |        124     .016129    .1264828          0          1
         ssa |        124    .1451613    .3536924          0          1
-------------+---------------------------------------------------------
         lac |        124    .2419355    .4299928          0          1
         oil |        124    .0806452     .273394          0          1
        emg2 |        124    .1774194     .383573          0          1
          fc |        124    .0887097    .2854777          0          1
   DEBT_2019 |         80    57.42737     39.2169   3.277699   250.4566
-------------+---------------------------------------------------------
   DEBT_2020 |         80    68.57952    50.33535   3.644727   277.9475
   RULE_2019 |        123    .0255854    .8811108  -1.798251   1.976262
   RULE_2020 |        123    .0291256    .8842076   -1.85675   1.972491
 REERmis2019 |        116     99.5422    8.427775   58.93613   123.9903
 REERmis2020 |        116    99.26668    14.26507   56.82057   198.5454
-------------+---------------------------------------------------------
   FX2021m11 |        124    796.2801    3076.892     .30894      23295
  dFX2021m11 |        124    11.98447     45.1808  -28.09285   485.8123
        CTOT |        118    101.0613    7.307503   89.16871   153.2879
       dCTOT |        118    .7687191    10.67494  -17.21474   80.18513
sum_FXI_br~m |         88    1.231484    6.425453  -28.53403   20.28403
-------------+---------------------------------------------------------
    dFXdaily |         51    1.241234    .9826982  -.5836357   3.570823
        sEMP |         36    .1704756    .1644101  -.3198836   .5527336
_est_dfx_2~L |        124    .4193548    .4954553          0          1
_est_dfx_3~L |        124    .4112903    .4940639          0          1
_est_dfx_4~L |        124    .4112903    .4940639          0          1
-------------+---------------------------------------------------------
_est_dfx_5~L |        124    .2580645    .4393448          0          1
_est_dfx_6~L |        124    .3790323    .4871143          0          1
_est_dfx_1~L |        124    .6774194    .4693602          0          1

Following variable is string, not included:  
country  
sum.doc
dir : seeout

. 
. **# Figure A.1: Ex-ante reserves and FX depreciation from May 2021 - Sep 2022
. 
. scatter   dFX RESGDP2020 if dFX>0 & dFX<100,            ///
>                   xtitle("FX Reserves/GDP, 2020 (%)")           ///
>                   ytitle("FX Depreciation, 2021−22, (%)")       ///
>                   title("Depreciations Only")                   ///
>                   name(A, replace)              /// 
>                   mlabel(iso2c) ||                              ///
>                   lfit dFX RESGDP if dFX>0 & dFX<100, legend(off)

.                   
. scatter   dFX RESGDP2020 if dFX!=0 & dFX<100,            ///
>                   xtitle("FX Reserves/GDP, 2020 (%)")           ///
>                   ytitle("FX Depreciation, 2021−22, (%)")       ///
>                   title("Depreciations and Appreciations")      ///
>                   name(B, replace)           /// 
>                   mlabel(iso2c) ||                              ///
>                   lfit dFX RESGDP if dFX!=0 & dFX<100, legend(off)

. 
. graph combine A B, ///
>  name(FXReserves_i_2020, replace)  

.  
. graph close A B Graph             

.                   
. **# Table A.3: Dependent variable: FX change from May 2021 - Sep 2022 (%), appreciations and
>  depreciations
. 
. reg       dFX RESGDP2020                       ///
>               if dFX!=0 & dFX<100                  ///
>               , robust

Linear regression                               Number of obs     =         96
                                                F(1, 94)          =       6.52
                                                Prob > F          =     0.0122
                                                R-squared         =     0.0360
                                                Root MSE          =     18.899

------------------------------------------------------------------------------
             |               Robust
         dFX | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  RESGDP2020 |  -.1345914   .0526929    -2.55   0.012    -.2392143   -.0299685
       _cons |   18.01016   3.224578     5.59   0.000     11.60769    24.41263
------------------------------------------------------------------------------

. estimate  store dfxapp_1_EL

.                   
. reg       dFX RESGDP2020 c.RATE20q4                               ///
>           dRATE22q2_21q2                                          ///
>           RGDP_PK_2019 RPCPI_2019 CAB_2019                        ///
>               NIIP_19 ers_2019 OPEN_2019                              ///
>               FUELX_2019 FUELM_2019                                   ///
>               if dFX!=0 & dFX<100                                      ///
>               , robust

Linear regression                               Number of obs     =         61
                                                F(11, 49)         =       3.06
                                                Prob > F          =     0.0035
                                                R-squared         =     0.3077
                                                Root MSE          =     12.923

--------------------------------------------------------------------------------
               |               Robust
           dFX | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
    RESGDP2020 |  -.1996519   .0840449    -2.38   0.021    -.3685466   -.0307573
      RATE20q4 |  -1.616172   .8617387    -1.88   0.067    -3.347901    .1155567
dRATE22q2_21q2 |  -.2224979   .5032654    -0.44   0.660    -1.233848    .7888517
  RGDP_PK_2019 |   .0432843   .0474012     0.91   0.366    -.0519719    .1385405
    RPCPI_2019 |   .0234337   .0493037     0.48   0.637    -.0756459    .1225133
      CAB_2019 |  -.1249943   .2509956    -0.50   0.621    -.6293887    .3794002
       NIIP_19 |   .0213761   .0183406     1.17   0.249    -.0154808     .058233
      ers_2019 |   -4.97901   8.888844    -0.56   0.578    -22.84181    12.88379
     OPEN_2019 |   .0042509   .0582583     0.07   0.942    -.1128236    .1213254
    FUELX_2019 |  -.1908232   .1277522    -1.49   0.142    -.4475508    .0659045
    FUELM_2019 |  -.0881823   .2964211    -0.30   0.767    -.6838627    .5074981
         _cons |   22.23598   9.179288     2.42   0.019     3.789508    40.68245
--------------------------------------------------------------------------------

. estimate  store dfxapp_2_EL

. 
. reg       dFX RESGDP2020 c.RESGDP2020#c.FI_2019                                   ///
>           RATE20q4 c.RATE20q4#c.kaopen_2019                       ///
>           dRATE22q2_21q2                                          ///
>           RGDP_PK_2019 RPCPI_2019 CAB_2019                        ///
>               NIIP_19 ers_2019 OPEN_2019                              ///
>               FUELX_2019 FUELM_2019                                   ///
>               if dFX!=0 & dFX<100                                      ///
>               , robust

Linear regression                               Number of obs     =         60
                                                F(13, 46)         =       3.42
                                                Prob > F          =     0.0010
                                                R-squared         =     0.4283
                                                Root MSE          =     12.114

------------------------------------------------------------------------------------------
                         |               Robust
                     dFX | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
              RESGDP2020 |  -.5558862   .2265922    -2.45   0.018    -1.011993   -.0997798
                         |
  c.RESGDP2020#c.FI_2019 |   .4117643   .2685742     1.53   0.132    -.1288476    .9523762
                         |
                RATE20q4 |   -2.26805   .6333251    -3.58   0.001    -3.542867   -.9932329
                         |
c.RATE20q4#c.kaopen_2019 |   -.929529   .3102093    -3.00   0.004    -1.553948   -.3051102
                         |
          dRATE22q2_21q2 |  -.2510336   .5161906    -0.49   0.629    -1.290071    .7880043
            RGDP_PK_2019 |  -.0162258   .0582068    -0.28   0.782    -.1333899    .1009384
              RPCPI_2019 |  -.0197442   .0416079    -0.47   0.637    -.1034965    .0640081
                CAB_2019 |  -.4430001   .3161178    -1.40   0.168    -1.079312     .193312
                 NIIP_19 |   .0262546   .0199019     1.32   0.194     -.013806    .0663151
                ers_2019 |   1.878166   7.981025     0.24   0.815     -14.1868    17.94314
               OPEN_2019 |   .0249562   .0556751     0.45   0.656     -.087112    .1370244
              FUELX_2019 |  -.1550448   .1441175    -1.08   0.288    -.4451383    .1350488
              FUELM_2019 |   .0057796    .362961     0.02   0.987     -.724823    .7363821
                   _cons |   27.70974   9.940881     2.79   0.008     7.699784     47.7197
------------------------------------------------------------------------------------------

. estimate  store dfxapp_3_EL

. 
. stepwise, pr(.2):                                                 ///
> reg       dFX RESGDP2020 c.RESGDP2020#c.FI_2019                                   ///
>           RATE20q4 c.RATE20q4#c.kaopen_2019                       ///
>           dRATE22q2_21q2                                          ///
>           RGDP_PK_2019 RPCPI_2019 CAB_2019                        ///
>               NIIP_19 ers_2019 OPEN_2019                              ///
>               FUELX_2019 FUELM_2019                                   ///
>               if dFX!=0 & dFX<100                                      ///
>               , robust

Wald test, begin with full model:
p = 0.9874 >= 0.2000, removing FUELM_2019
p = 0.8096 >= 0.2000, removing ers_2019
p = 0.7353 >= 0.2000, removing RGDP_PK_2019
p = 0.6042 >= 0.2000, removing RPCPI_2019
p = 0.6087 >= 0.2000, removing OPEN_2019
p = 0.5102 >= 0.2000, removing dRATE22q2_21q2

Linear regression                               Number of obs     =         60
                                                F(7, 52)          =       5.91
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4164
                                                Root MSE          =     11.513

------------------------------------------------------------------------------------------
                         |               Robust
                     dFX | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
              RESGDP2020 |  -.4593007   .1515503    -3.03   0.004    -.7634087   -.1551927
                         |
  c.RESGDP2020#c.FI_2019 |   .3293042   .1628429     2.02   0.048     .0025361    .6560724
                         |
                RATE20q4 |  -2.252125   .5158402    -4.37   0.000    -3.287235   -1.217016
                         |
c.RATE20q4#c.kaopen_2019 |  -.8119129   .3110662    -2.61   0.012    -1.436113   -.1877128
                         |
                CAB_2019 |  -.4243212   .2605621    -1.63   0.109    -.9471773    .0985349
                 NIIP_19 |   .0290827   .0191813     1.52   0.136    -.0094075    .0675729
              FUELX_2019 |  -.1827632   .1348866    -1.35   0.181    -.4534331    .0879066
                   _cons |   26.25685   3.560176     7.38   0.000     19.11284    33.40087
------------------------------------------------------------------------------------------

. estimate  store dfxapp_4_EL

. 
. reg       dFX RESGDP2020 c.RESGDP2020#c.FI_2019                                   ///
>           RATE20q4 c.RATE20q4#c.kaopen_2019                       ///
>           dRATE22q2_21q2                                          ///
>           RGDP_PK_2019 RPCPI_2019 CAB_2019                        ///
>               NIIP_19 ers_2019 OPEN_2019                              ///
>               FUELX_2019 FUELM_2019 DEBT_2019                         ///
>               if dFX!=0 & dFX<100                                      ///
>               , robust

Linear regression                               Number of obs     =         39
                                                F(14, 24)         =       5.00
                                                Prob > F          =     0.0003
                                                R-squared         =     0.5811
                                                Root MSE          =     11.178

------------------------------------------------------------------------------------------
                         |               Robust
                     dFX | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
              RESGDP2020 |  -1.241266   .2819092    -4.40   0.000    -1.823098   -.6594336
                         |
  c.RESGDP2020#c.FI_2019 |   1.816195   .5050612     3.60   0.001     .7737997     2.85859
                         |
                RATE20q4 |  -2.789591    .712907    -3.91   0.001    -4.260958   -1.318223
                         |
c.RATE20q4#c.kaopen_2019 |  -1.143556   .4152074    -2.75   0.011    -2.000502   -.2866095
                         |
          dRATE22q2_21q2 |   -1.67041   .6459431    -2.59   0.016    -3.003571   -.3372484
            RGDP_PK_2019 |  -.8671728   .4046555    -2.14   0.042    -1.702341   -.0320049
              RPCPI_2019 |   .0298748    .061177     0.49   0.630    -.0963883    .1561379
                CAB_2019 |  -1.012406   .2820716    -3.59   0.001    -1.594573   -.4302391
                 NIIP_19 |    .083458   .0504218     1.66   0.111    -.0206074    .1875234
                ers_2019 |   8.099636   9.467517     0.86   0.401    -11.44036    27.63963
               OPEN_2019 |  -.0815905   .0991781    -0.82   0.419     -.286284     .123103
              FUELX_2019 |  -.2579425   .1690745    -1.53   0.140    -.6068952    .0910101
              FUELM_2019 |  -.5002774   .3900332    -1.28   0.212    -1.305266    .3047115
               DEBT_2019 |   .1778713   .0753495     2.36   0.027     .0223576     .333385
                   _cons |   37.94265   11.18081     3.39   0.002      14.8666     61.0187
------------------------------------------------------------------------------------------

. estimate  store dfxapp_5_EL

. 
. reg       dFX c.RESGDP2020##c.sum_FXI_broad_proxy_GDP_m                    ///
>           RATE20q4                                                 ///
>           dRATE22q2_21q2                                           ///
>           RGDP_PK_2019 RPCPI_2019 CAB_2019                         ///
>               NIIP_19 ers_2019 OPEN_2019                               ///
>               FUELX_2019 FUELM_2019                                    ///
>               if dFX!=0 & dFX<100                                      ///
>               , robust

Linear regression                               Number of obs     =         54
                                                F(13, 40)         =       7.30
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4704
                                                Root MSE          =     11.758

---------------------------------------------------------------------------------------------
                            |               Robust
                        dFX | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------------+----------------------------------------------------------------
                 RESGDP2020 |  -.2073329   .0837853    -2.47   0.018    -.3766694   -.0379964
  sum_FXI_broad_proxy_GDP_m |  -2.633819   .8424255    -3.13   0.003    -4.336425   -.9312137
                            |
               c.RESGDP2020#|
c.sum_FXI_broad_proxy_GDP_m |   .0533365   .0229217     2.33   0.025     .0070101    .0996628
                            |
                   RATE20q4 |  -.9202279   .9227574    -1.00   0.325     -2.78519    .9447343
             dRATE22q2_21q2 |   -.373723   .4760762    -0.79   0.437    -1.335909    .5884629
               RGDP_PK_2019 |   .0814991   .0428932     1.90   0.065    -.0051912    .1681895
                 RPCPI_2019 |     .01012   .0461997     0.22   0.828     -.083253     .103493
                   CAB_2019 |  -.3958527   .3028754    -1.31   0.199    -1.007987    .2162812
                    NIIP_19 |   .0338372   .0128048     2.64   0.012     .0079577    .0597167
                   ers_2019 |  -6.970861   9.514859    -0.73   0.468    -26.20111    12.25939
                  OPEN_2019 |   .1096312   .0703408     1.56   0.127    -.0325328    .2517951
                 FUELX_2019 |  -.2388445    .095387    -2.50   0.016    -.4316287   -.0460602
                 FUELM_2019 |   .0019209   .2645108     0.01   0.994    -.5326754    .5365171
                      _cons |   15.36546   7.672913     2.00   0.052    -.1420724      30.873
---------------------------------------------------------------------------------------------

. estimate  store dfxapp_6_EL

. 
. **# Table A.4: Regressions with additional covariates, depreciations only
. 
. reg       dFX RESGDP2020 c.RESGDP2020#c.FI_2019                                   ///
>           RATE20q4 c.RATE20q4#c.kaopen_2019                       ///
>           dRATE22q2_21q2                                          ///
>           RGDP_PK_2019 RPCPI_2019 CAB_2019                        ///
>               NIIP_19 ers_2019 OPEN_2019                              ///
>               FUELX_2019 FUELM_2019                                                         
>               ///
>                   dCTOT DEBT_2019 RULE_2019 REERmis2019                   ///
>               if dFX>0 & dFX<100                                      ///
>               , robust

Linear regression                               Number of obs     =         31
                                                F(17, 13)         =      11.81
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7136
                                                Root MSE          =     7.6262

------------------------------------------------------------------------------------------
                         |               Robust
                     dFX | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
              RESGDP2020 |  -.9887351    .244778    -4.04   0.001    -1.517546   -.4599244
                         |
  c.RESGDP2020#c.FI_2019 |   1.678154   .3845045     4.36   0.001     .8474824    2.508825
                         |
                RATE20q4 |  -1.199344   .8897422    -1.35   0.201    -3.121515    .7228274
                         |
c.RATE20q4#c.kaopen_2019 |  -.7235402   .4202323    -1.72   0.109    -1.631397    .1843165
                         |
          dRATE22q2_21q2 |  -1.010796   .3509078    -2.88   0.013    -1.768887   -.2527062
            RGDP_PK_2019 |  -1.097205   .5428063    -2.02   0.064    -2.269867    .0754564
              RPCPI_2019 |   .0168084   .0559864     0.30   0.769     -.104143    .1377597
                CAB_2019 |  -.8179505    .281504    -2.91   0.012    -1.426103   -.2097981
                 NIIP_19 |   .0663075   .0628137     1.06   0.310    -.0693933    .2020082
                ers_2019 |   6.237561   12.31495     0.51   0.621    -20.36727    32.84239
               OPEN_2019 |  -.1140799   .1155221    -0.99   0.341    -.3636503    .1354906
              FUELX_2019 |    .084576   .1247901     0.68   0.510    -.1850167    .3541687
              FUELM_2019 |  -1.069697   .3600528    -2.97   0.011    -1.847543   -.2918497
                   dCTOT |  -1.868834   1.034019    -1.81   0.094    -4.102695    .3650279
               DEBT_2019 |   .0980954   .0617186     1.59   0.136    -.0352396    .2314304
               RULE_2019 |   4.271906   3.439389     1.24   0.236    -3.158442    11.70225
             REERmis2019 |  -.1334738   .5306284    -0.25   0.805    -1.279827    1.012879
                   _cons |   58.53681   65.31094     0.90   0.386     -82.5589    199.6325
------------------------------------------------------------------------------------------

. estimate  store dfx_1_EL_A4

. 
. reg       dFX RESGDP2020 c.RESGDP2020#c.FI_2019                                   ///
>           RATE20q4 c.RATE20q4#c.kaopen_2019                       ///
>           dRATE22q2_21q2                                          ///
>           RGDP_PK_2019 RPCPI_2019 CAB_2019                        ///
>               NIIP_19 ers_2019 OPEN_2019                              ///
>               FUELX_2019 FUELM_2019                                                         
>               ///
>                   dCTOT RULE_2019 REERmis2019                   ///
>               if dFX>0 & dFX<100                                      ///
>               , robust

Linear regression                               Number of obs     =         50
                                                F(16, 33)         =       1.99
                                                Prob > F          =     0.0460
                                                R-squared         =     0.3742
                                                Root MSE          =     10.036

------------------------------------------------------------------------------------------
                         |               Robust
                     dFX | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
              RESGDP2020 |  -.3942831    .204326    -1.93   0.062    -.8099876    .0214214
                         |
  c.RESGDP2020#c.FI_2019 |   .3159402   .2187425     1.44   0.158    -.1290947     .760975
                         |
                RATE20q4 |  -.4410742   .7398136    -0.60   0.555    -1.946236    1.064088
                         |
c.RATE20q4#c.kaopen_2019 |  -.4284178   .3912374    -1.10   0.281    -1.224396    .3675606
                         |
          dRATE22q2_21q2 |   .0533981   .5926487     0.09   0.929    -1.152355    1.259151
            RGDP_PK_2019 |  -.1115212   .1005235    -1.11   0.275    -.3160378    .0929955
              RPCPI_2019 |  -.0286462   .0400302    -0.72   0.479    -.1100883    .0527959
                CAB_2019 |  -.0818938   .3051351    -0.27   0.790    -.7026958    .5389083
                 NIIP_19 |   .0026469   .0179016     0.15   0.883    -.0337742    .0390681
                ers_2019 |   .4899788   9.727601     0.05   0.960    -19.30097    20.28093
               OPEN_2019 |   .0090656   .0610915     0.15   0.883     -.115226    .1333572
              FUELX_2019 |   .0744805   .1133299     0.66   0.516     -.156091     .305052
              FUELM_2019 |  -.2001588    .357843    -0.56   0.580    -.9281959    .5278783
                   dCTOT |  -.7679723   .6788983    -1.13   0.266    -2.149201    .6132566
               RULE_2019 |    5.92705   3.611438     1.64   0.110    -1.420476    13.27458
             REERmis2019 |   .2773645   .3222418     0.86   0.396    -.3782414    .9329704
                   _cons |  -1.622862    36.9499    -0.04   0.965    -76.79801    73.55228
------------------------------------------------------------------------------------------

. estimate  store dfx_2_EL_A4

. 
. stepwise, pr(.2): ///
> reg       dFX RESGDP2020 c.RESGDP2020#c.FI_2019                                   ///
>           RATE20q4 c.RATE20q4#c.kaopen_2019                       ///
>           dRATE22q2_21q2                                          ///
>           RGDP_PK_2019 RPCPI_2019 CAB_2019                        ///
>               NIIP_19 ers_2019 OPEN_2019                              ///
>               FUELX_2019 FUELM_2019                                                         
>               ///
>                   dCTOT RULE_2019 REERmis2019                   ///
>               if dFX>0 & dFX<100                                      ///
>               , robust

Wald test, begin with full model:
p = 0.9601 >= 0.2000, removing ers_2019
p = 0.9430 >= 0.2000, removing dRATE22q2_21q2
p = 0.8949 >= 0.2000, removing NIIP_19
p = 0.8444 >= 0.2000, removing OPEN_2019
p = 0.7546 >= 0.2000, removing CAB_2019
p = 0.5714 >= 0.2000, removing RATE20q4
p = 0.5218 >= 0.2000, removing FUELM_2019
p = 0.5107 >= 0.2000, removing FUELX_2019
p = 0.3092 >= 0.2000, removing RPCPI_2019
p = 0.3772 >= 0.2000, removing c.RATE20q4#c.kaopen_2019
p = 0.3224 >= 0.2000, removing dCTOT

Linear regression                               Number of obs     =         50
                                                F(5, 44)          =       6.81
                                                Prob > F          =     0.0001
                                                R-squared         =     0.3228
                                                Root MSE          =     9.0416

----------------------------------------------------------------------------------------
                       |               Robust
                   dFX | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------------+----------------------------------------------------------------
            RESGDP2020 |  -.4093091   .1315434    -3.11   0.003    -.6744174   -.1442007
                       |
c.RESGDP2020#c.FI_2019 |   .3499296   .1587203     2.20   0.033     .0300498    .6698093
                       |
           REERmis2019 |   .5079404   .2286171     2.22   0.031     .0471928    .9686879
          RGDP_PK_2019 |  -.1146601   .0691978    -1.66   0.105    -.2541191    .0247988
             RULE_2019 |   7.075134   2.299519     3.08   0.004     2.440757    11.70951
                 _cons |  -29.70346   22.95323    -1.29   0.202    -75.96266    16.55574
----------------------------------------------------------------------------------------

. estimate  store dfx_3_EL_A4

. 
. **# Table A.5: Regressions with country group interactions, depreciations only
. 
. // Country groups
. 
. stepwise, pr(.2):                                                       ///
> reg       dFX c.RESGDP##c.lac c.RATE20q4##c.kaopen_2019          ///
>           dRATE22q2_21q2                                         ///
>           RGDP_PK_2019 RPCPI_2019 CAB_2019                       ///
>               NIIP_19 ers_2019 OPEN_2019                             ///
>               FUELX_2019 FUELM_2019                                  ///
>               if dFX>0 & dFX<70                        ///
>               , robust 

Wald test, begin with full model:
p = 0.9001 >= 0.2000, removing OPEN_2019
p = 0.8671 >= 0.2000, removing NIIP_19
p = 0.7121 >= 0.2000, removing ers_2019
p = 0.5850 >= 0.2000, removing RGDP_PK_2019
p = 0.5611 >= 0.2000, removing lac
p = 0.4716 >= 0.2000, removing RPCPI_2019
p = 0.4627 >= 0.2000, removing kaopen_2019
p = 0.4402 >= 0.2000, removing FUELM_2019
p = 0.4453 >= 0.2000, removing CAB_2019
p = 0.4385 >= 0.2000, removing dRATE22q2_21q2

Linear regression                               Number of obs     =         51
                                                F(5, 45)          =      11.77
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3772
                                                Root MSE          =     8.6506

------------------------------------------------------------------------------------------
                         |               Robust
                     dFX | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
              RESGDP2020 |  -.1511264    .029832    -5.07   0.000    -.2112112   -.0910417
              FUELX_2019 |  -.0721325   .0516733    -1.40   0.170    -.1762078    .0319429
                         |
      c.RESGDP2020#c.lac |  -.4732891   .0816147    -5.80   0.000    -.6376695   -.3089086
                         |
                RATE20q4 |   -1.53475   .4703849    -3.26   0.002    -2.482153   -.5873457
                         |
c.RATE20q4#c.kaopen_2019 |  -.4722489   .3044742    -1.55   0.128    -1.085491    .1409937
                         |
                   _cons |   24.43794   2.549109     9.59   0.000     19.30377    29.57211
------------------------------------------------------------------------------------------

. estimate  store dfxc_1_dFX_EL_A5

. 
. /*
> Mexico
> Jamaica
> Guatemala
> Honduras
> Nicaragua
> Peru
> Costa Rica
> Chile
> */
. 
. stepwise, pr(.2):                                                ///
> reg       dFX c.RESGDP##c.mena c.RATE20q4##c.kaopen_2019  ///
>           dRATE22q2_21q2                                         ///
>           RGDP_PK_2019 RPCPI_2019 CAB_2019                       ///
>               NIIP_19 ers_2019 OPEN_2019                             ///
>               FUELX_2019 FUELM_2019                                  ///
>               if dFX>0 & dFX<70                       ///
>               , robust 

Wald test, begin with full model:
p = 0.9771 >= 0.2000, removing CAB_2019
p = 0.8181 >= 0.2000, removing RGDP_PK_2019
p = 0.8095 >= 0.2000, removing FUELX_2019
p = 0.7450 >= 0.2000, removing dRATE22q2_21q2
p = 0.6192 >= 0.2000, removing kaopen_2019
p = 0.7031 >= 0.2000, removing FUELM_2019
p = 0.4147 >= 0.2000, removing OPEN_2019
p = 0.4091 >= 0.2000, removing ers_2019
p = 0.2740 >= 0.2000, removing NIIP_19
p = 0.2020 >= 0.2000, removing RPCPI_2019

Linear regression                               Number of obs     =         51
                                                F(5, 45)          =      32.72
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2918
                                                Root MSE          =     9.2246

------------------------------------------------------------------------------------------
                         |               Robust
                     dFX | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
              RESGDP2020 |  -.1210832   .0274693    -4.41   0.000    -.1764092   -.0657572
                    mena |   27.60674   3.769213     7.32   0.000     20.01515    35.19832
                         |
     c.RESGDP2020#c.mena |  -.8433072   .1011495    -8.34   0.000    -1.047033   -.6395817
                         |
                RATE20q4 |  -1.850145   .5182298    -3.57   0.001    -2.893914    -.806377
                         |
c.RATE20q4#c.kaopen_2019 |  -.6783536   .3626146    -1.87   0.068    -1.408697    .0519896
                         |
                   _cons |   21.54891   2.522746     8.54   0.000     16.46783    26.62998
------------------------------------------------------------------------------------------

. estimate  store dfxc_2_dFX_EL_A5

. 
. /*
> Kuwait
> Israel
> Morocco
> Egypt
> */
. stepwise, pr(.2):                                                ///
> reg       dFX c.RESGDP##c.ssa c.RATE20q4##c.kaopen_2019   ///
>           dRATE22q2_21q2                                         ///
>           RGDP_PK_2019 RPCPI_2019 CAB_2019                       ///
>               NIIP_19 ers_2019 OPEN_2019                             ///
>               FUELX_2019 FUELM_2019                                  ///
>               if dFX>0 & dFX<70                       ///
>               , robust 

Wald test, begin with full model:
p = 0.9961 >= 0.2000, removing FUELX_2019
p = 0.9490 >= 0.2000, removing FUELM_2019
p = 0.9086 >= 0.2000, removing kaopen_2019
p = 0.7699 >= 0.2000, removing CAB_2019
p = 0.6821 >= 0.2000, removing RPCPI_2019
p = 0.5727 >= 0.2000, removing dRATE22q2_21q2
p = 0.5112 >= 0.2000, removing NIIP_19
p = 0.4305 >= 0.2000, removing OPEN_2019
p = 0.4988 >= 0.2000, removing RGDP_PK_2019
p = 0.2946 >= 0.2000, removing c.RATE20q4#c.kaopen_2019

Linear regression                               Number of obs     =         51
                                                F(5, 45)          =       8.55
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2521
                                                Root MSE          =     9.4794

------------------------------------------------------------------------------------
                   |               Robust
               dFX | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
        RESGDP2020 |  -.0914229   .0268654    -3.40   0.001    -.1455325   -.0373132
               ssa |   14.28501   3.984041     3.59   0.001     6.260738    22.30928
                   |
c.RESGDP2020#c.ssa |    -.29736   .0849729    -3.50   0.001    -.4685042   -.1262158
                   |
          RATE20q4 |  -1.140083   .3834315    -2.97   0.005    -1.912354   -.3678126
          ers_2019 |  -12.04984   5.681469    -2.12   0.039     -23.4929     -.60677
             _cons |    24.4649   3.770221     6.49   0.000     16.87129    32.05852
------------------------------------------------------------------------------------

. estimate  store dfxc_3_dFX_EL_A5

. /*
> Rwanda
> Mauritius
> Madagascar
> Botswana
> Eswatini
> South Africa
> Namibia
> */
.                   
. **# Table A.6: Dependent variable: FX change from November 2021 - Sep 2022 (%), depreciation
> s only
. 
. reg       dFX2021m11 RESGDP2020                              ///
>               if dFX2021m11>0 & dFX2021m11< 70                   ///
>               , robust

Linear regression                               Number of obs     =         80
                                                F(1, 78)          =      13.07
                                                Prob > F          =     0.0005
                                                R-squared         =     0.1037
                                                Root MSE          =     9.4625

------------------------------------------------------------------------------
             |               Robust
  dFX2021m11 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  RESGDP2020 |  -.1100502   .0304352    -3.62   0.001    -.1706419   -.0494584
       _cons |   15.67334    1.80599     8.68   0.000     12.07789    19.26879
------------------------------------------------------------------------------

. estimate  store dfx_1_EL_A6

. 
. reg       dFX2021m11 RESGDP2020                              ///
>           RATE20q4                                           ///
>           dRATE22q2_21q2                                     ///
>           RGDP_PK_2019 RPCPI_2019 CAB_2019                   ///
>               NIIP_19 ers_2019 OPEN_2019                         ///
>               FUELX_2019 FUELM_2019                              ///
>               if dFX2021m11>0 & dFX2021m11< 70                   ///
>               , robust

Linear regression                               Number of obs     =         48
                                                F(11, 36)         =       2.44
                                                Prob > F          =     0.0216
                                                R-squared         =     0.2163
                                                Root MSE          =      8.002

--------------------------------------------------------------------------------
               |               Robust
    dFX2021m11 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
    RESGDP2020 |  -.0843924   .0521399    -1.62   0.114     -.190137    .0213521
      RATE20q4 |  -.4072222   .4289323    -0.95   0.349    -1.277137    .4626927
dRATE22q2_21q2 |   .2026567   .3356706     0.60   0.550    -.4781148    .8834282
  RGDP_PK_2019 |   .0194296   .0353388     0.55   0.586    -.0522408    .0911001
    RPCPI_2019 |   .0033261   .0489703     0.07   0.946    -.0959903    .1026425
      CAB_2019 |   .1137974   .1615207     0.70   0.486    -.2137819    .4413766
       NIIP_19 |  -.0094104   .0088264    -1.07   0.293    -.0273112    .0084905
      ers_2019 |  -9.284122   6.326351    -1.47   0.151    -22.11456    3.546313
     OPEN_2019 |   .0195278   .0365871     0.53   0.597    -.0546742    .0937299
    FUELX_2019 |  -.0114989   .0543435    -0.21   0.834    -.1217127    .0987148
    FUELM_2019 |   .0926048   .1558404     0.59   0.556    -.2234542    .4086639
         _cons |   14.94086   5.999339     2.49   0.018     2.773631    27.10808
--------------------------------------------------------------------------------

. estimate  store dfx_2_EL_A6

. 
. reg       dFX2021m11 RESGDP2020 c.RESGDP2020#c.FI_2019       ///
>           RATE20q4 c.RATE20q4#c.kaopen_2019                  ///
>           dRATE22q2_21q2                                     ///
>           RGDP_PK_2019 RPCPI_2019 CAB_2019                   ///
>               NIIP_19 ers_2019 OPEN_2019                         ///
>               FUELX_2019 FUELM_2019                              ///
>               if dFX2021m11>0 & dFX2021m11< 70                   ///
>               , robust

Linear regression                               Number of obs     =         47
                                                F(13, 33)         =       2.00
                                                Prob > F          =     0.0536
                                                R-squared         =     0.2566
                                                Root MSE          =     8.0843

------------------------------------------------------------------------------------------
                         |               Robust
              dFX2021m11 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
              RESGDP2020 |  -.2889209   .1350891    -2.14   0.040    -.5637618     -.01408
                         |
  c.RESGDP2020#c.FI_2019 |   .2465875   .1527834     1.61   0.116    -.0642528    .5574277
                         |
                RATE20q4 |  -.7025591   .6505143    -1.08   0.288     -2.02604    .6209222
                         |
c.RATE20q4#c.kaopen_2019 |  -.2217271   .3955653    -0.56   0.579    -1.026511    .5830566
                         |
          dRATE22q2_21q2 |   .2556327   .3636083     0.70   0.487    -.4841339    .9953993
            RGDP_PK_2019 |  -.0115872   .0420258    -0.28   0.784    -.0970894    .0739149
              RPCPI_2019 |  -.0097059   .0498743    -0.19   0.847    -.1111759     .091764
                CAB_2019 |  -.0960706   .2294669    -0.42   0.678    -.5629244    .3707833
                 NIIP_19 |  -.0003951   .0094809    -0.04   0.967    -.0196841     .018894
                ers_2019 |  -5.168709   6.017311    -0.86   0.397    -17.41102    7.073602
               OPEN_2019 |   .0250676    .038321     0.65   0.518    -.0528971    .1030323
              FUELX_2019 |   .0314888   .0478843     0.66   0.515    -.0659326    .1289101
              FUELM_2019 |   .2486594   .2352324     1.06   0.298    -.2299244    .7272433
                   _cons |   14.69091   7.259514     2.02   0.051     -.078678    29.46051
------------------------------------------------------------------------------------------

. estimate  store dfx_3_EL_A6

. 
. stepwise, pr(.2):                                            ///
> reg       dFX2021m11 RESGDP2020 c.RESGDP2020#c.FI_2019       ///
>           RATE20q4 c.RATE20q4##c.kaopen_2019                 ///
>           dRATE22q2_21q2                                     ///
>           RGDP_PK_2019 RPCPI_2019 CAB_2019                   ///
>               NIIP_19 ers_2019 OPEN_2019                         ///
>               FUELX_2019 FUELM_2019                              ///
>               if dFX2021m11>0 & dFX2021m11< 70                   ///
>               , robust
note: RATE20q4 omitted because of estimability.

Wald test, begin with full model:
p = 0.9721 >= 0.2000, removing NIIP_19
p = 0.9719 >= 0.2000, removing FUELX_2019
p = 0.8364 >= 0.2000, removing CAB_2019
p = 0.8398 >= 0.2000, removing c.RATE20q4#c.kaopen_2019
p = 0.8582 >= 0.2000, removing kaopen_2019
p = 0.8622 >= 0.2000, removing RGDP_PK_2019
p = 0.4896 >= 0.2000, removing RPCPI_2019
p = 0.6026 >= 0.2000, removing OPEN_2019
p = 0.3542 >= 0.2000, removing dRATE22q2_21q2
p = 0.4514 >= 0.2000, removing FUELM_2019

Linear regression                               Number of obs     =         47
                                                F(3, 43)          =       5.29
                                                Prob > F          =     0.0034
                                                R-squared         =     0.1790
                                                Root MSE          =     7.4426

----------------------------------------------------------------------------------------
                       |               Robust
            dFX2021m11 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------------+----------------------------------------------------------------
            RESGDP2020 |  -.2229198   .0973875    -2.29   0.027    -.4193204   -.0265192
                       |
c.RESGDP2020#c.FI_2019 |   .1990025   .1093314     1.82   0.076    -.0214853    .4194903
                       |
              ers_2019 |  -8.356352   4.895978    -1.71   0.095    -18.23003    1.517329
                 _cons |   18.27176   3.032612     6.03   0.000     12.15592    24.38761
----------------------------------------------------------------------------------------

. estimate  store dfx_4_EL_A6

. 
. reg       dFX2021m11 RESGDP2020 c.RESGDP2020#c.FI_2019       ///
>           RATE20q4 c.RATE20q4#c.kaopen_2019                 ///
>           dRATE22q2_21q2                                     ///
>           RGDP_PK_2019 RPCPI_2019 CAB_2019                   ///
>               NIIP_19 ers_2019 OPEN_2019                         ///
>               FUELX_2019 FUELM_2019 DEBT_2019                    ///
>               if dFX2021m11>0 & dFX2021m11< 70                   ///
>               , robust

Linear regression                               Number of obs     =         28
                                                F(14, 13)         =       1.86
                                                Prob > F          =     0.1363
                                                R-squared         =     0.4434
                                                Root MSE          =     8.9399

------------------------------------------------------------------------------------------
                         |               Robust
              dFX2021m11 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
              RESGDP2020 |  -.7209682   .2547244    -2.83   0.014    -1.271267   -.1706695
                         |
  c.RESGDP2020#c.FI_2019 |   1.083853   .3757554     2.88   0.013     .2720829    1.895623
                         |
                RATE20q4 |  -1.977997   1.023762    -1.93   0.075      -4.1897    .2337054
                         |
c.RATE20q4#c.kaopen_2019 |  -.6024071   .6037134    -1.00   0.337    -1.906651    .7018364
                         |
          dRATE22q2_21q2 |  -.3495859   .4785947    -0.73   0.478    -1.383527    .6843551
            RGDP_PK_2019 |  -1.114054   .5384513    -2.07   0.059    -2.277307    .0491997
              RPCPI_2019 |   .0229409   .0549872     0.42   0.683    -.0958518    .1417335
                CAB_2019 |  -.5335771   .2841979    -1.88   0.083    -1.147549     .080395
                 NIIP_19 |   .0636355    .056515     1.13   0.281    -.0584578    .1857287
                ers_2019 |  -.4774169   7.454356    -0.06   0.950    -16.58157    15.62674
               OPEN_2019 |  -.0547133   .0923722    -0.59   0.564    -.2542714    .1448448
              FUELX_2019 |   .1170329   .1424362     0.82   0.426    -.1906818    .4247476
              FUELM_2019 |  -.0679243   .3602701    -0.19   0.853    -.8462404    .7103919
               DEBT_2019 |   .1007907   .1165086     0.87   0.403    -.1509109    .3524923
                   _cons |   28.72317   15.33736     1.87   0.084    -4.411171    61.85752
------------------------------------------------------------------------------------------

. estimate  store dfx_5_EL_A6               

.                   
. **# Table A.7: Dependent variable: Exchange Market Pressure from May 2021 - Sep 2022
. 
. sum sEMP

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        sEMP |         36    .1704756    .1644101  -.3198836   .5527336

. 
. cap gen sEMP100 = sEMP*100        

. 
. reg               sEMP100 RESGDP2020 if dFX>=0 & dFX<100 & imf!=111, ///
>           robust

Linear regression                               Number of obs     =         31
                                                F(1, 29)          =       5.55
                                                Prob > F          =     0.0255
                                                R-squared         =     0.0716
                                                Root MSE          =     13.234

------------------------------------------------------------------------------
             |               Robust
     sEMP100 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  RESGDP2020 |  -.1037275   .0440386    -2.36   0.025    -.1937965   -.0136584
       _cons |   24.27007   3.200731     7.58   0.000     17.72384     30.8163
------------------------------------------------------------------------------

. estimate  store emp_1_EL_A7

. 
. reg       sEMP100 RESGDP2020                                 ///
>           RGDP_PK_2019 RPCPI_2019 CAB_2019                   ///
>               NIIP_19 ers_2019 OPEN_2019                         ///
>               FUELX_2019 FUELM_2019                              ///
>               if dFX>=0 & dFX<100 & imf!=111,                    ///
>               robust

Linear regression                               Number of obs     =         31
                                                F(9, 21)          =       1.57
                                                Prob > F          =     0.1887
                                                R-squared         =     0.3366
                                                Root MSE          =     13.146

------------------------------------------------------------------------------
             |               Robust
     sEMP100 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  RESGDP2020 |  -.1709511    .076045    -2.25   0.035    -.3290954   -.0128069
RGDP_PK_2019 |   .0305818   .0858897     0.36   0.725    -.1480357    .2091993
  RPCPI_2019 |  -.0069751   .0839126    -0.08   0.935    -.1814809    .1675307
    CAB_2019 |  -.4929983    .708962    -0.70   0.494    -1.967366     .981369
     NIIP_19 |  -.0435134    .035541    -1.22   0.234    -.1174249    .0303982
    ers_2019 |  -23.37546   14.07878    -1.66   0.112    -52.65389    5.902957
   OPEN_2019 |   .1206463   .0580726     2.08   0.050    -.0001222    .2414148
  FUELX_2019 |  -.1014164   .3060513    -0.33   0.744    -.7378849    .5350521
  FUELM_2019 |  -.3479418   .5438674    -0.64   0.529    -1.478976    .7830923
       _cons |   31.12734   16.88294     1.84   0.079    -3.982647    66.23733
------------------------------------------------------------------------------

. estimate  store emp_2_EL_A7

.                   
. reg               sEMP100 RESGDP2020 if dFX<100 & imf!=111, ///
>           robust

Linear regression                               Number of obs     =         35
                                                F(1, 33)          =       2.94
                                                Prob > F          =     0.0959
                                                R-squared         =     0.0246
                                                Root MSE          =     16.463

------------------------------------------------------------------------------
             |               Robust
     sEMP100 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  RESGDP2020 |   -.078397   .0457379    -1.71   0.096    -.1714515    .0146575
       _cons |   20.09673   3.690933     5.44   0.000     12.58747    27.60599
------------------------------------------------------------------------------

. estimate  store emp_3_EL_A7

. 
. reg       sEMP100 RESGDP2020                                 ///
>           RGDP_PK_2019 RPCPI_2019 CAB_2019                   ///
>               NIIP_19 ers_2019 OPEN_2019                         ///
>               FUELX_2019 FUELM_2019                              ///
>               if dFX<100 & imf!=111,                    ///
>               robust

Linear regression                               Number of obs     =         35
                                                F(9, 25)          =       1.72
                                                Prob > F          =     0.1356
                                                R-squared         =     0.2100
                                                Root MSE          =     17.023

------------------------------------------------------------------------------
             |               Robust
     sEMP100 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  RESGDP2020 |  -.2251669   .0872926    -2.58   0.016    -.4049494   -.0453843
RGDP_PK_2019 |   .0447101   .0727179     0.61   0.544    -.1050552    .1944754
  RPCPI_2019 |  -.0683692   .1372251    -0.50   0.623    -.3509896    .2142511
    CAB_2019 |  -.0546802   1.003683    -0.05   0.957    -2.121804    2.012444
     NIIP_19 |  -.0311016   .0383189    -0.81   0.425    -.1100207    .0478176
    ers_2019 |  -30.91736   17.67421    -1.75   0.093    -67.31806    5.483353
   OPEN_2019 |   .1322376   .0744774     1.78   0.088    -.0211515    .2856267
  FUELX_2019 |  -.1539525   .2088538    -0.74   0.468    -.5840949      .27619
  FUELM_2019 |  -.2740262   .4310648    -0.64   0.531    -1.161821    .6137684
       _cons |   37.43949   22.18951     1.69   0.104    -8.260662    83.13964
------------------------------------------------------------------------------

. estimate  store emp_4_EL_A7               

.                   
. log close _all
      name:  estimates
       log:  C:\Users\jamel\Dropbox\Latex\PROJECTS\22-12-reer-tot-res-pm\Archive\Data\estimate
> s.log
  log type:  text
 closed on:   9 Jul 2025, 10:52:35
----------------------------------------------------------------------------------------------
