{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\jamel\Dropbox\latex\PROJECTS\23-05-geopolitical-risk-pol-tension-oil-price\Data and command\Codes_EE\lpirf_PRI_GPR_EE.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}13 Jul 2025, 12:27:34
{txt}
{com}. 
. import excel .\data_svar.xlsx,/*
> */ sheet("data") firstrow clear
{res}{text}(9 vars, 759 obs)

{com}. 
. generate Period = tm(1960m1) + _n-1
{txt}
{com}. format %tm Period
{txt}
{com}. 
. drop if Period > tm(2019m12)
{txt}(39 observations deleted)

{com}. 
. label variable pri "Political Relationship Index"
{txt}
{com}. label variable pri_s "PRI Standardized"
{txt}
{com}. label variable gop "Global Oil Production"
{txt}
{com}. label variable rspri "Real Spot Price"
{txt}
{com}. label variable wip "World Industrial Production"
{txt}
{com}. label variable dinv "Variation of Inventories"
{txt}
{com}. label variable gprcn ///
>           "Percent of Articles on China in the Bil. GPR"
{txt}
{com}. label variable igrea ///
>           "Index of Global Real Economic Activity"
{txt}
{com}.           
. rename gop pro
{res}{txt}
{com}. rename wip dem
{res}{txt}
{com}. rename rspri rpo
{res}{txt}
{com}. 
. capture generate lpro = log(pro)
{txt}
{com}. la var lpro "Natural log of PRO"
{txt}
{com}. capture generate lrpo = log(rpo)
{txt}
{com}. la var lrpo "Natural log of RPO"
{txt}
{com}. capture generate ldem = log(dem)
{txt}
{com}. la var ldem "Natural log of DEM"
{txt}
{com}. 
. drop t
{txt}
{com}. order Period, first
{txt}
{com}. 
. /* Another transformation for the PRI index */
. gen lpri = sign(pri) * log(1 + abs(pri))
{txt}
{com}. 
. label variable lpri "Political Relationship Index"
{txt}
{com}. 
. gen ligrea = sign(igrea) * log(1 + abs(igrea))
{txt}(96 missing values generated)

{com}. 
. label variable ligrea "Global Real Economic Activity"
{txt}
{com}. 
. summarize lpri lpro ldem lrpo gprcn ligrea if Period>tm(2000m1)

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}lpri {c |}{res}        239    .2934882    .8635308  -2.054124   1.193923
{txt}{space 8}lpro {c |}{res}        239    4.318169    .0624468   4.192786   4.438475
{txt}{space 8}ldem {c |}{res}        239    4.702075    .1403389   4.450089   4.904061
{txt}{space 8}lrpo {c |}{res}        239    3.268457    .3928032   2.388421   4.120459
{txt}{space 7}gprcn {c |}{res}        239    .4806391    .2381402   .1612948   1.521136
{txt}{hline 13}{c +}{hline 57}
{space 6}ligrea {c |}{res}        239    .0950085    3.844319  -5.093765   5.246595
{txt}
{com}. /*
> outreg2   using sum.doc if Period>tm(2000m1), replace sum(log) ///
>           keep(lpri lpro ldem lrpo gprcn) dec(3)
> */
. 
. **#  Declare time series
. 
. tsset Period, monthly
{res}
{p 0 15 2}{txt:Time variable: }{res:Period}{txt:, }{res:{bind:1960m1}}{txt: to }{res:{bind:2019m12}}{p_end}
{txt}{col 9}Delta: {res}1 month
{txt}
{com}. 
. save database_pri_gpr.dta, replace
{txt}{p 0 4 2}
file {bf}
database_pri_gpr.dta{rm}
saved
{p_end}

{com}. 
. twoway (tsline lpri if Period>tm(2000m1)) ///
>        (tsline gprcn if Period>tm(2000m1), yaxis(2)), ///
>            name(G0, replace) legend(off)
{res}{txt}
{com}.            
. graph export "G0.svg", as(svg) replace
{txt}{p 0 4 2}
file {bf}
G0.svg{rm}
saved as
SVG
format
{p_end}

{com}. graph export "G0.pdf", as(pdf) replace
{txt}{p 0 4 2}
file {bf}
G0.pdf{rm}
saved as
PDF
format
{p_end}

{com}. graph export "G0.png", as(png) width(4000) replace
{txt}{p 0 4 2}
file {bf}
G0.png{rm}
saved as
PNG
format
{p_end}

{com}.            
. matrix A = (1,0,0,0\.,1,0,0\.,.,1,0\.,.,.,1)
{txt}
{com}. matlist A
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:c1}{space 1}{space 1}{ralign 9:c2}{space 1}{space 1}{ralign 9:c3}{space 1}{space 1}{ralign 9:c4}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:r1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:r2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:r3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:r4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}

{com}. 
. matrix B = (.,0,0,0\0,.,0,0\0,0,.,0\0,0,0,.) 
{txt}
{com}. matlist B
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:c1}{space 1}{space 1}{ralign 9:c2}{space 1}{space 1}{ralign 9:c3}{space 1}{space 1}{ralign 9:c4}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:r1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:{space 9}}}}{space 1}{space 1}{ralign 9:{res:{sf:{space 9}}}}{space 1}{space 1}{ralign 9:{res:{sf:{space 9}}}}{space 1}
{space 0}{space 0}{ralign 12:r2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:{space 9}}}}{space 1}{space 1}{ralign 9:{res:{sf:{space 9}}}}{space 1}
{space 0}{space 0}{ralign 12:r3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:{space 9}}}}{space 1}
{space 0}{space 0}{ralign 12:r4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}

{com}. 
. svar lpri lpro ldem lrpo if Period>tm(2000m1), aeq(A) beq(B) ///
> lags(1/24) 
{res}{txt}Estimating short-run parameters
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-1089.3698}  
Iteration 1:{space 2}Log likelihood = {res: 988.23688}  
Iteration 2:{space 2}Log likelihood = {res: 1255.9806}  
Iteration 3:{space 2}Log likelihood = {res: 1738.8122}  
Iteration 4:{space 2}Log likelihood = {res: 2153.2785}  
Iteration 5:{space 2}Log likelihood = {res: 2359.5949}  
Iteration 6:{space 2}Log likelihood = {res: 2436.0247}  
Iteration 7:{space 2}Log likelihood = {res: 2462.6683}  
Iteration 8:{space 2}Log likelihood = {res: 2464.6814}  
Iteration 9:{space 2}Log likelihood = {res:  2464.694}  
Iteration 10:{space 1}Log likelihood = {res:  2464.694}  
{res}
{txt}Structural vector autoregression

{p 0 7}{space 1}{text:( 1)}{space 1} {res}[/A]1_1 = 1{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} [/A]1_2 = 0{p_end}
{p 0 7}{space 1}{text:( 3)}{space 1} [/A]1_3 = 0{p_end}
{p 0 7}{space 1}{text:( 4)}{space 1} [/A]1_4 = 0{p_end}
{p 0 7}{space 1}{text:( 5)}{space 1} [/A]2_2 = 1{p_end}
{p 0 7}{space 1}{text:( 6)}{space 1} [/A]2_3 = 0{p_end}
{p 0 7}{space 1}{text:( 7)}{space 1} [/A]2_4 = 0{p_end}
{p 0 7}{space 1}{text:( 8)}{space 1} [/A]3_3 = 1{p_end}
{p 0 7}{space 1}{text:( 9)}{space 1} [/A]3_4 = 0{p_end}
{p 0 7}{space 1}{text:(10)}{space 1} [/A]4_4 = 1{p_end}
{p 0 7}{space 1}{text:(11)}{space 1} [/B]1_2 = 0{p_end}
{p 0 7}{space 1}{text:(12)}{space 1} [/B]1_3 = 0{p_end}
{p 0 7}{space 1}{text:(13)}{space 1} [/B]1_4 = 0{p_end}
{p 0 7}{space 1}{text:(14)}{space 1} [/B]2_1 = 0{p_end}
{p 0 7}{space 1}{text:(15)}{space 1} [/B]2_3 = 0{p_end}
{p 0 7}{space 1}{text:(16)}{space 1} [/B]2_4 = 0{p_end}
{p 0 7}{space 1}{text:(17)}{space 1} [/B]3_1 = 0{p_end}
{p 0 7}{space 1}{text:(18)}{space 1} [/B]3_2 = 0{p_end}
{p 0 7}{space 1}{text:(19)}{space 1} [/B]3_4 = 0{p_end}
{p 0 7}{space 1}{text:(20)}{space 1} [/B]4_1 = 0{p_end}
{p 0 7}{space 1}{text:(21)}{space 1} [/B]4_2 = 0{p_end}
{p 0 7}{space 1}{text:(22)}{space 1} [/B]4_3 = 0{p_end}

{col 1}{txt}Sample: {res}2000m2 {txt}thru{res} 2019m12 {txt}{col 49}Number of obs{col 67}= {res}       239
{txt}Exactly identified model{col 49}Log likelihood{col 67}=  {res} 2464.694

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/A           {txt}{c |}
{space 9}1_1 {c |}{col 14}{res}{space 2}        1{col 26}{txt}  (constrained)
{space 9}2_1 {c |}{col 14}{res}{space 2}-.0126754{col 26}{space 2} .0047564{col 37}{space 1}   -2.66{col 46}{space 3}0.008{col 54}{space 4}-.0219977{col 67}{space 3}-.0033531
{txt}{space 9}3_1 {c |}{col 14}{res}{space 2} .0007724{col 26}{space 2} .0031607{col 37}{space 1}    0.24{col 46}{space 3}0.807{col 54}{space 4}-.0054225{col 67}{space 3} .0069673
{txt}{space 9}4_1 {c |}{col 14}{res}{space 2} .0836298{col 26}{space 2} .0493863{col 37}{space 1}    1.69{col 46}{space 3}0.090{col 54}{space 4}-.0131656{col 67}{space 3} .1804253
{txt}{space 9}1_2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_2 {c |}{col 14}{res}{space 2}        1{col 26}{txt}  (constrained)
{space 9}3_2 {c |}{col 14}{res}{space 2}-.0649535{col 26}{space 2} .0423596{col 37}{space 1}   -1.53{col 46}{space 3}0.125{col 54}{space 4}-.1479769{col 67}{space 3} .0180698
{txt}{space 9}4_2 {c |}{col 14}{res}{space 2} 1.620257{col 26}{space 2} .6650372{col 37}{space 1}    2.44{col 46}{space 3}0.015{col 54}{space 4} .3168079{col 67}{space 3} 2.923706
{txt}{space 9}1_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_3 {c |}{col 14}{res}{space 2}        1{col 26}{txt}  (constrained)
{space 9}4_3 {c |}{col 14}{res}{space 2} -2.33248{col 26}{space 2} 1.010576{col 37}{space 1}   -2.31{col 46}{space 3}0.021{col 54}{space 4}-4.313173{col 67}{space 3}-.3517882
{txt}{space 9}1_4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}4_4 {c |}{col 14}{res}{space 2}        1{col 26}{txt}  (constrained)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/B           {txt}{c |}
{space 9}1_1 {c |}{col 14}{res}{space 2} .0808577{col 26}{space 2} .0036983{col 37}{space 1}   21.86{col 46}{space 3}0.000{col 54}{space 4} .0736091{col 67}{space 3} .0881063
{txt}{space 9}2_1 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_1 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}4_1 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}1_2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_2 {c |}{col 14}{res}{space 2} .0059456{col 26}{space 2} .0002719{col 37}{space 1}   21.86{col 46}{space 3}0.000{col 54}{space 4} .0054126{col 67}{space 3} .0064786
{txt}{space 9}3_2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}4_2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}1_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_3 {c |}{col 14}{res}{space 2} .0038936{col 26}{space 2} .0001781{col 37}{space 1}   21.86{col 46}{space 3}0.000{col 54}{space 4} .0035445{col 67}{space 3} .0042426
{txt}{space 9}4_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}1_4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}4_4 {c |}{col 14}{res}{space 2} .0608295{col 26}{space 2} .0027823{col 37}{space 1}   21.86{col 46}{space 3}0.000{col 54}{space 4} .0553764{col 67}{space 3} .0662827
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. /* compute the inv(B)*A matrix */
. matrix A=e(A)
{txt}
{com}. matrix B=e(B)
{txt}
{com}. matrix BA = inv(B)*A
{txt}
{com}. /* compute reduced form epsilon_t residuals */
. var lpri lpro ldem lrpo if Period>tm(2000m1)
{res}
{txt}Vector autoregression

{col 1}Sample: {res}2000m2 {txt}thru{res} 2019m12 {txt}{col 49}Number of obs{col 67}= {res}       239
{txt}Log likelihood =  {res} 2190.165{txt}{col 38}{col 49}AIC{col 67}=  {res}-18.02649
{txt}FPE{col 16}=  {res} 1.74e-13{txt}{col 49}HQIC{col 67}=  {res}-17.81547
{txt}Det(Sigma_ml){col 16}=  {res} 1.29e-13{txt}{col 49}SBIC{col 67}=  {res}-17.50284

{col 1}{text}Equation        {col 18}  Parms{col 26}     RMSE {col 37}   R-sq  {col 47}   chi2   {col 58} P>chi2
{res}{col 1}{text}{hline 17}{hline 8}{hline 11}{hline 10}{hline 11}{hline 7}
{col 1}{text}lpri            {col 18}{result}     9{col 26}{space 2} .113468{col 37}{space 1} 0.9833{col 47} 14084.61{col 58} 0.0000
{col 1}{text}lpro            {col 18}{result}     9{col 26}{space 2} .007845{col 37}{space 1} 0.9847{col 47}  15430.2{col 58} 0.0000
{col 1}{text}ldem            {col 18}{result}     9{col 26}{space 2} .005659{col 37}{space 1} 0.9984{col 47} 151862.9{col 58} 0.0000
{col 1}{text}lrpo            {col 18}{result}     9{col 26}{space 2} .080528{col 37}{space 1} 0.9594{col 47} 5645.453{col 58} 0.0000
{col 1}{text}{hline 17}{hline 8}{hline 11}{hline 10}{hline 11}{hline 7}
{res}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lpri         {txt}{c |}
{space 8}lpri {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}  1.02088{col 26}{space 2}  .065043{col 37}{space 1}   15.70{col 46}{space 3}0.000{col 54}{space 4} .8933984{col 67}{space 3} 1.148362
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0404373{col 26}{space 2} .0649793{col 37}{space 1}   -0.62{col 46}{space 3}0.534{col 54}{space 4}-.1677943{col 67}{space 3} .0869197
{txt}{space 12} {c |}
{space 8}lpro {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.5662178{col 26}{space 2} .9375872{col 37}{space 1}   -0.60{col 46}{space 3}0.546{col 54}{space 4}-2.403855{col 67}{space 3} 1.271419
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .4591511{col 26}{space 2} .9410169{col 37}{space 1}    0.49{col 46}{space 3}0.626{col 54}{space 4}-1.385208{col 67}{space 3}  2.30351
{txt}{space 12} {c |}
{space 8}ldem {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} 2.328491{col 26}{space 2} 1.235075{col 37}{space 1}    1.89{col 46}{space 3}0.059{col 54}{space 4}-.0922117{col 67}{space 3} 4.749194
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-2.516937{col 26}{space 2} 1.222366{col 37}{space 1}   -2.06{col 46}{space 3}0.039{col 54}{space 4} -4.91273{col 67}{space 3}-.1211443
{txt}{space 12} {c |}
{space 8}lrpo {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .0197547{col 26}{space 2} .0909455{col 37}{space 1}    0.22{col 46}{space 3}0.828{col 54}{space 4}-.1584951{col 67}{space 3} .1980046
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0561329{col 26}{space 2} .0913182{col 37}{space 1}    0.61{col 46}{space 3}0.539{col 54}{space 4}-.1228475{col 67}{space 3} .2351133
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.092742{col 26}{space 2} 1.088601{col 37}{space 1}    1.00{col 46}{space 3}0.315{col 54}{space 4}-1.040876{col 67}{space 3}  3.22636
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lpro         {txt}{c |}
{space 8}lpri {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .0046979{col 26}{space 2} .0044971{col 37}{space 1}    1.04{col 46}{space 3}0.296{col 54}{space 4}-.0041163{col 67}{space 3} .0135122
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0051903{col 26}{space 2} .0044927{col 37}{space 1}   -1.16{col 46}{space 3}0.248{col 54}{space 4}-.0139959{col 67}{space 3} .0036153
{txt}{space 12} {c |}
{space 8}lpro {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .8960902{col 26}{space 2} .0648256{col 37}{space 1}   13.82{col 46}{space 3}0.000{col 54}{space 4} .7690342{col 67}{space 3} 1.023146
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0002203{col 26}{space 2} .0650628{col 37}{space 1}    0.00{col 46}{space 3}0.997{col 54}{space 4}-.1273004{col 67}{space 3}  .127741
{txt}{space 12} {c |}
{space 8}ldem {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .1852567{col 26}{space 2} .0853942{col 37}{space 1}    2.17{col 46}{space 3}0.030{col 54}{space 4} .0178871{col 67}{space 3} .3526264
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.1393035{col 26}{space 2} .0845155{col 37}{space 1}   -1.65{col 46}{space 3}0.099{col 54}{space 4}-.3049508{col 67}{space 3} .0263439
{txt}{space 12} {c |}
{space 8}lrpo {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .0084163{col 26}{space 2} .0062881{col 37}{space 1}    1.34{col 46}{space 3}0.181{col 54}{space 4} -.003908{col 67}{space 3} .0207407
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0104668{col 26}{space 2} .0063138{col 37}{space 1}   -1.66{col 46}{space 3}0.097{col 54}{space 4}-.0228417{col 67}{space 3}  .001908
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .2392245{col 26}{space 2} .0752669{col 37}{space 1}    3.18{col 46}{space 3}0.001{col 54}{space 4} .0917042{col 67}{space 3} .3867448
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ldem         {txt}{c |}
{space 8}lpri {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}  .004107{col 26}{space 2} .0032438{col 37}{space 1}    1.27{col 46}{space 3}0.205{col 54}{space 4}-.0022508{col 67}{space 3} .0104649
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0032437{col 26}{space 2} .0032407{col 37}{space 1}   -1.00{col 46}{space 3}0.317{col 54}{space 4}-.0095953{col 67}{space 3} .0031079
{txt}{space 12} {c |}
{space 8}lpro {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .0922844{col 26}{space 2} .0467596{col 37}{space 1}    1.97{col 46}{space 3}0.048{col 54}{space 4} .0006372{col 67}{space 3} .1839315
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0690136{col 26}{space 2} .0469307{col 37}{space 1}   -1.47{col 46}{space 3}0.141{col 54}{space 4} -.160996{col 67}{space 3} .0229688
{txt}{space 12} {c |}
{space 8}ldem {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} 1.151338{col 26}{space 2}  .061596{col 37}{space 1}   18.69{col 46}{space 3}0.000{col 54}{space 4} 1.030612{col 67}{space 3} 1.272064
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.1602631{col 26}{space 2} .0609622{col 37}{space 1}   -2.63{col 46}{space 3}0.009{col 54}{space 4}-.2797468{col 67}{space 3}-.0407795
{txt}{space 12} {c |}
{space 8}lrpo {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .0238001{col 26}{space 2} .0045357{col 37}{space 1}    5.25{col 46}{space 3}0.000{col 54}{space 4} .0149103{col 67}{space 3} .0326898
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0253468{col 26}{space 2} .0045542{col 37}{space 1}   -5.57{col 46}{space 3}0.000{col 54}{space 4}-.0342729{col 67}{space 3}-.0164206
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0522002{col 26}{space 2}  .054291{col 37}{space 1}   -0.96{col 46}{space 3}0.336{col 54}{space 4}-.1586086{col 67}{space 3} .0542082
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lrpo         {txt}{c |}
{space 8}lpri {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.0363973{col 26}{space 2} .0461606{col 37}{space 1}   -0.79{col 46}{space 3}0.430{col 54}{space 4}-.1268704{col 67}{space 3} .0540758
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0459971{col 26}{space 2} .0461153{col 37}{space 1}    1.00{col 46}{space 3}0.319{col 54}{space 4}-.0443872{col 67}{space 3} .1363815
{txt}{space 12} {c |}
{space 8}lpro {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} -.476452{col 26}{space 2} .6653989{col 37}{space 1}   -0.72{col 46}{space 3}0.474{col 54}{space 4} -1.78061{col 67}{space 3} .8277059
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0750901{col 26}{space 2} .6678329{col 37}{space 1}   -0.11{col 46}{space 3}0.910{col 54}{space 4}-1.384019{col 67}{space 3} 1.233838
{txt}{space 12} {c |}
{space 8}ldem {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} 2.394223{col 26}{space 2}  .876524{col 37}{space 1}    2.73{col 46}{space 3}0.006{col 54}{space 4} .6762673{col 67}{space 3} 4.112178
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-2.102661{col 26}{space 2} .8675043{col 37}{space 1}   -2.42{col 46}{space 3}0.015{col 54}{space 4}-3.802938{col 67}{space 3}-.4023834
{txt}{space 12} {c |}
{space 8}lrpo {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} 1.170197{col 26}{space 2} .0645433{col 37}{space 1}   18.13{col 46}{space 3}0.000{col 54}{space 4} 1.043694{col 67}{space 3}   1.2967
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} -.232986{col 26}{space 2} .0648079{col 37}{space 1}   -3.60{col 46}{space 3}0.000{col 54}{space 4}-.3600071{col 67}{space 3}-.1059649
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.209696{col 26}{space 2}  .772572{col 37}{space 1}    1.57{col 46}{space 3}0.117{col 54}{space 4}-.3045171{col 67}{space 3}  2.72391
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. capture drop epsilon*
{txt}
{com}. predict double epsilon1 if Period>tm(2000m1),residual eq(#1)
{txt}(481 missing values generated)

{com}. predict double epsilon2 if Period>tm(2000m1),residual eq(#2)
{txt}(481 missing values generated)

{com}. predict double epsilon3 if Period>tm(2000m1),residual eq(#3)
{txt}(481 missing values generated)

{com}. predict double epsilon4 if Period>tm(2000m1),residual eq(#4)
{txt}(481 missing values generated)

{com}. /* store the epsilon* variables in the epsilon matrix */
. mkmat epsilon*, matrix(epsilon) 
{res}{txt}
{com}. /* compute e_t matrix of structural shocks */
. matrix e = (BA*epsilon')'
{txt}
{com}. /* store columns of e as variables e1, e2, and e3 */  
. svmat double e
{txt}
{com}. 
. label variable epsilon1 "Reduced-form shocks - PRI"
{txt}
{com}. label variable e1 "Structural shocks - PRI"
{txt}
{com}. 
. twoway (tsline e1 if Period>tm(2000m1)) (tsline epsilon1 ///
> if Period>tm(2000m1), yaxis(1)), ///
>  name(G1, replace) legend(position(6)) graphregion(margin(r+5))
{res}{txt}
{com}.  
. graph export "G1.svg", as(svg) replace
{txt}{p 0 4 2}
file {bf}
G1.svg{rm}
saved as
SVG
format
{p_end}

{com}. graph export "G1.png", as(png) width(4000) replace
{txt}{p 0 4 2}
file {bf}
G1.png{rm}
saved as
PNG
format
{p_end}

{com}. graph export "G1.pdf", as(pdf) replace
{txt}{p 0 4 2}
file {bf}
G1.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
. irf set comparemodels.irf, replace
{txt}(file {bf:comparemodels.irf} created)
(file {bf:comparemodels.irf} now active)

{com}. 
. lpirf lpro ldem lrpo, step(48) lags(1/24) ///
>   exog(L(0/24).e1) vce(robust)
{res}
{txt}Local-projection impulse responses

{col 1}Sample: {res}2002m2 {txt}thru{res} 2016m1 {txt}{col 54}Number of obs       ={res} 168
{txt}{col 54}Number of impulses  ={res}   4
{txt}{col 54}Number of responses ={res}   3
{txt}{col 54}Number of controls  ={res}  93

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}     IRF   {col 26}    Robust
{col 14}{c |} coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lpro         {txt}{c |}
{space 8}lpro {c |}
{space 9}F1. {c |}{col 14}{res}{space 2} .7280321{col 26}{space 2} .0749194{col 37}{space 1}    9.72{col 46}{space 3}0.000{col 54}{space 4} .5811929{col 67}{space 3} .8748714
{txt}{space 9}F2. {c |}{col 14}{res}{space 2} .4216241{col 26}{space 2} .1017658{col 37}{space 1}    4.14{col 46}{space 3}0.000{col 54}{space 4} .2221668{col 67}{space 3} .6210814
{txt}{space 9}F3. {c |}{col 14}{res}{space 2} .5446221{col 26}{space 2} .1237814{col 37}{space 1}    4.40{col 46}{space 3}0.000{col 54}{space 4}  .302015{col 67}{space 3} .7872291
{txt}{space 9}F4. {c |}{col 14}{res}{space 2} .6010137{col 26}{space 2} .1142347{col 37}{space 1}    5.26{col 46}{space 3}0.000{col 54}{space 4} .3771179{col 67}{space 3} .8249096
{txt}{space 9}F5. {c |}{col 14}{res}{space 2} .4057281{col 26}{space 2} .1361754{col 37}{space 1}    2.98{col 46}{space 3}0.003{col 54}{space 4} .1388292{col 67}{space 3} .6726269
{txt}{space 9}F6. {c |}{col 14}{res}{space 2} .2547685{col 26}{space 2} .1614373{col 37}{space 1}    1.58{col 46}{space 3}0.115{col 54}{space 4}-.0616427{col 67}{space 3} .5711797
{txt}{space 9}F7. {c |}{col 14}{res}{space 2} .4332713{col 26}{space 2} .1710729{col 37}{space 1}    2.53{col 46}{space 3}0.011{col 54}{space 4} .0979746{col 67}{space 3}  .768568
{txt}{space 9}F8. {c |}{col 14}{res}{space 2} .3279943{col 26}{space 2} .1727271{col 37}{space 1}    1.90{col 46}{space 3}0.058{col 54}{space 4}-.0105446{col 67}{space 3} .6665332
{txt}{space 9}F9. {c |}{col 14}{res}{space 2} .0853209{col 26}{space 2} .1960551{col 37}{space 1}    0.44{col 46}{space 3}0.663{col 54}{space 4}-.2989401{col 67}{space 3} .4695819
{txt}{space 8}F10. {c |}{col 14}{res}{space 2}  .044739{col 26}{space 2} .2021815{col 37}{space 1}    0.22{col 46}{space 3}0.825{col 54}{space 4}-.3515294{col 67}{space 3} .4410074
{txt}{space 8}F11. {c |}{col 14}{res}{space 2} -.048991{col 26}{space 2} .1967516{col 37}{space 1}   -0.25{col 46}{space 3}0.803{col 54}{space 4} -.434617{col 67}{space 3}  .336635
{txt}{space 8}F12. {c |}{col 14}{res}{space 2}-.1641304{col 26}{space 2} .2136171{col 37}{space 1}   -0.77{col 46}{space 3}0.442{col 54}{space 4}-.5828122{col 67}{space 3} .2545514
{txt}{space 8}F13. {c |}{col 14}{res}{space 2}-.1940814{col 26}{space 2}  .201404{col 37}{space 1}   -0.96{col 46}{space 3}0.335{col 54}{space 4}-.5888259{col 67}{space 3} .2006631
{txt}{space 8}F14. {c |}{col 14}{res}{space 2}-.1584372{col 26}{space 2} .1916641{col 37}{space 1}   -0.83{col 46}{space 3}0.408{col 54}{space 4}-.5340919{col 67}{space 3} .2172175
{txt}{space 8}F15. {c |}{col 14}{res}{space 2} .0240363{col 26}{space 2} .1916473{col 37}{space 1}    0.13{col 46}{space 3}0.900{col 54}{space 4}-.3515856{col 67}{space 3} .3996581
{txt}{space 8}F16. {c |}{col 14}{res}{space 2} .0328429{col 26}{space 2} .1845682{col 37}{space 1}    0.18{col 46}{space 3}0.859{col 54}{space 4}-.3289041{col 67}{space 3} .3945899
{txt}{space 8}F17. {c |}{col 14}{res}{space 2}-.0571032{col 26}{space 2} .1794828{col 37}{space 1}   -0.32{col 46}{space 3}0.750{col 54}{space 4}-.4088831{col 67}{space 3} .2946767
{txt}{space 8}F18. {c |}{col 14}{res}{space 2}-.3762281{col 26}{space 2} .1787397{col 37}{space 1}   -2.10{col 46}{space 3}0.035{col 54}{space 4}-.7265515{col 67}{space 3}-.0259047
{txt}{space 8}F19. {c |}{col 14}{res}{space 2}-.3368972{col 26}{space 2} .1694677{col 37}{space 1}   -1.99{col 46}{space 3}0.047{col 54}{space 4}-.6690477{col 67}{space 3}-.0047467
{txt}{space 8}F20. {c |}{col 14}{res}{space 2}-.3018486{col 26}{space 2} .1747246{col 37}{space 1}   -1.73{col 46}{space 3}0.084{col 54}{space 4}-.6443024{col 67}{space 3} .0406052
{txt}{space 8}F21. {c |}{col 14}{res}{space 2}-.3896337{col 26}{space 2} .1775804{col 37}{space 1}   -2.19{col 46}{space 3}0.028{col 54}{space 4}-.7376849{col 67}{space 3}-.0415826
{txt}{space 8}F22. {c |}{col 14}{res}{space 2}-.3669813{col 26}{space 2} .1798814{col 37}{space 1}   -2.04{col 46}{space 3}0.041{col 54}{space 4}-.7195423{col 67}{space 3}-.0144203
{txt}{space 8}F23. {c |}{col 14}{res}{space 2}-.1899652{col 26}{space 2} .1754854{col 37}{space 1}   -1.08{col 46}{space 3}0.279{col 54}{space 4}-.5339101{col 67}{space 3} .1539798
{txt}{space 8}F24. {c |}{col 14}{res}{space 2}  .163075{col 26}{space 2} .1759515{col 37}{space 1}    0.93{col 46}{space 3}0.354{col 54}{space 4}-.1817836{col 67}{space 3} .5079336
{txt}{space 8}F25. {c |}{col 14}{res}{space 2} .0813748{col 26}{space 2} .1746958{col 37}{space 1}    0.47{col 46}{space 3}0.641{col 54}{space 4}-.2610227{col 67}{space 3} .4237722
{txt}{space 8}F26. {c |}{col 14}{res}{space 2} .0461432{col 26}{space 2} .1767044{col 37}{space 1}    0.26{col 46}{space 3}0.794{col 54}{space 4}-.3001911{col 67}{space 3} .3924774
{txt}{space 8}F27. {c |}{col 14}{res}{space 2}-.1375089{col 26}{space 2} .1667166{col 37}{space 1}   -0.82{col 46}{space 3}0.409{col 54}{space 4}-.4642674{col 67}{space 3} .1892497
{txt}{space 8}F28. {c |}{col 14}{res}{space 2}-.4095511{col 26}{space 2} .1567865{col 37}{space 1}   -2.61{col 46}{space 3}0.009{col 54}{space 4} -.716847{col 67}{space 3}-.1022552
{txt}{space 8}F29. {c |}{col 14}{res}{space 2}-.5810485{col 26}{space 2} .1617619{col 37}{space 1}   -3.59{col 46}{space 3}0.000{col 54}{space 4} -.898096{col 67}{space 3} -.264001
{txt}{space 8}F30. {c |}{col 14}{res}{space 2}-.5698554{col 26}{space 2} .1758353{col 37}{space 1}   -3.24{col 46}{space 3}0.001{col 54}{space 4}-.9144863{col 67}{space 3}-.2252244
{txt}{space 8}F31. {c |}{col 14}{res}{space 2}-.4317491{col 26}{space 2}  .188808{col 37}{space 1}   -2.29{col 46}{space 3}0.022{col 54}{space 4} -.801806{col 67}{space 3}-.0616922
{txt}{space 8}F32. {c |}{col 14}{res}{space 2}-.4025284{col 26}{space 2} .1824437{col 37}{space 1}   -2.21{col 46}{space 3}0.027{col 54}{space 4}-.7601116{col 67}{space 3}-.0449452
{txt}{space 8}F33. {c |}{col 14}{res}{space 2}-.4473601{col 26}{space 2} .1879825{col 37}{space 1}   -2.38{col 46}{space 3}0.017{col 54}{space 4} -.815799{col 67}{space 3}-.0789212
{txt}{space 8}F34. {c |}{col 14}{res}{space 2}-.4458647{col 26}{space 2}  .193643{col 37}{space 1}   -2.30{col 46}{space 3}0.021{col 54}{space 4}-.8253979{col 67}{space 3}-.0663315
{txt}{space 8}F35. {c |}{col 14}{res}{space 2}-.4427674{col 26}{space 2}  .207807{col 37}{space 1}   -2.13{col 46}{space 3}0.033{col 54}{space 4}-.8500617{col 67}{space 3}-.0354731
{txt}{space 8}F36. {c |}{col 14}{res}{space 2}-.4072453{col 26}{space 2} .2235559{col 37}{space 1}   -1.82{col 46}{space 3}0.069{col 54}{space 4}-.8454069{col 67}{space 3} .0309162
{txt}{space 8}F37. {c |}{col 14}{res}{space 2}-.3217304{col 26}{space 2} .2248056{col 37}{space 1}   -1.43{col 46}{space 3}0.152{col 54}{space 4}-.7623413{col 67}{space 3} .1188806
{txt}{space 8}F38. {c |}{col 14}{res}{space 2}-.4207483{col 26}{space 2} .2129525{col 37}{space 1}   -1.98{col 46}{space 3}0.048{col 54}{space 4}-.8381275{col 67}{space 3}-.0033691
{txt}{space 8}F39. {c |}{col 14}{res}{space 2}-.2608648{col 26}{space 2} .2008349{col 37}{space 1}   -1.30{col 46}{space 3}0.194{col 54}{space 4} -.654494{col 67}{space 3} .1327643
{txt}{space 8}F40. {c |}{col 14}{res}{space 2}-.2470077{col 26}{space 2} .2014503{col 37}{space 1}   -1.23{col 46}{space 3}0.220{col 54}{space 4}-.6418431{col 67}{space 3} .1478278
{txt}{space 8}F41. {c |}{col 14}{res}{space 2}-.2858679{col 26}{space 2} .1998949{col 37}{space 1}   -1.43{col 46}{space 3}0.153{col 54}{space 4}-.6776547{col 67}{space 3} .1059189
{txt}{space 8}F42. {c |}{col 14}{res}{space 2}-.4435064{col 26}{space 2} .2134803{col 37}{space 1}   -2.08{col 46}{space 3}0.038{col 54}{space 4}-.8619202{col 67}{space 3}-.0250927
{txt}{space 8}F43. {c |}{col 14}{res}{space 2}-.4191426{col 26}{space 2} .2262433{col 37}{space 1}   -1.85{col 46}{space 3}0.064{col 54}{space 4}-.8625713{col 67}{space 3} .0242861
{txt}{space 8}F44. {c |}{col 14}{res}{space 2}-.4810465{col 26}{space 2} .2237437{col 37}{space 1}   -2.15{col 46}{space 3}0.032{col 54}{space 4}-.9195761{col 67}{space 3} -.042517
{txt}{space 8}F45. {c |}{col 14}{res}{space 2}-.2815818{col 26}{space 2} .2182647{col 37}{space 1}   -1.29{col 46}{space 3}0.197{col 54}{space 4}-.7093728{col 67}{space 3} .1462093
{txt}{space 8}F46. {c |}{col 14}{res}{space 2}-.2744714{col 26}{space 2} .2294095{col 37}{space 1}   -1.20{col 46}{space 3}0.232{col 54}{space 4}-.7241057{col 67}{space 3} .1751629
{txt}{space 8}F47. {c |}{col 14}{res}{space 2}  .119039{col 26}{space 2} .2219973{col 37}{space 1}    0.54{col 46}{space 3}0.592{col 54}{space 4}-.3160678{col 67}{space 3} .5541458
{txt}{space 8}F48. {c |}{col 14}{res}{space 2} .2256926{col 26}{space 2} .2265898{col 37}{space 1}    1.00{col 46}{space 3}0.319{col 54}{space 4}-.2184153{col 67}{space 3} .6698005
{txt}{space 12} {c |}
{space 8}ldem {c |}
{space 9}F1. {c |}{col 14}{res}{space 2} .0597481{col 26}{space 2} .0610714{col 37}{space 1}    0.98{col 46}{space 3}0.328{col 54}{space 4}-.0599496{col 67}{space 3} .1794459
{txt}{space 9}F2. {c |}{col 14}{res}{space 2} .0764188{col 26}{space 2} .0984725{col 37}{space 1}    0.78{col 46}{space 3}0.438{col 54}{space 4}-.1165839{col 67}{space 3} .2694214
{txt}{space 9}F3. {c |}{col 14}{res}{space 2} .1802088{col 26}{space 2} .1356174{col 37}{space 1}    1.33{col 46}{space 3}0.184{col 54}{space 4}-.0855964{col 67}{space 3}  .446014
{txt}{space 9}F4. {c |}{col 14}{res}{space 2} .2640022{col 26}{space 2} .1675983{col 37}{space 1}    1.58{col 46}{space 3}0.115{col 54}{space 4}-.0644844{col 67}{space 3} .5924888
{txt}{space 9}F5. {c |}{col 14}{res}{space 2} .1379775{col 26}{space 2} .1876172{col 37}{space 1}    0.74{col 46}{space 3}0.462{col 54}{space 4}-.2297454{col 67}{space 3} .5057005
{txt}{space 9}F6. {c |}{col 14}{res}{space 2}-.0081502{col 26}{space 2} .2131958{col 37}{space 1}   -0.04{col 46}{space 3}0.970{col 54}{space 4}-.4260063{col 67}{space 3} .4097059
{txt}{space 9}F7. {c |}{col 14}{res}{space 2}-.0920868{col 26}{space 2} .2283933{col 37}{space 1}   -0.40{col 46}{space 3}0.687{col 54}{space 4}-.5397294{col 67}{space 3} .3555558
{txt}{space 9}F8. {c |}{col 14}{res}{space 2}-.4135047{col 26}{space 2} .2449428{col 37}{space 1}   -1.69{col 46}{space 3}0.091{col 54}{space 4}-.8935837{col 67}{space 3} .0665742
{txt}{space 9}F9. {c |}{col 14}{res}{space 2}-.4613096{col 26}{space 2} .2657147{col 37}{space 1}   -1.74{col 46}{space 3}0.083{col 54}{space 4}-.9821008{col 67}{space 3} .0594817
{txt}{space 8}F10. {c |}{col 14}{res}{space 2}-.6488176{col 26}{space 2} .2763185{col 37}{space 1}   -2.35{col 46}{space 3}0.019{col 54}{space 4}-1.190392{col 67}{space 3}-.1072433
{txt}{space 8}F11. {c |}{col 14}{res}{space 2}-.6737534{col 26}{space 2} .2891718{col 37}{space 1}   -2.33{col 46}{space 3}0.020{col 54}{space 4} -1.24052{col 67}{space 3} -.106987
{txt}{space 8}F12. {c |}{col 14}{res}{space 2} -.710195{col 26}{space 2} .2938893{col 37}{space 1}   -2.42{col 46}{space 3}0.016{col 54}{space 4}-1.286207{col 67}{space 3}-.1341826
{txt}{space 8}F13. {c |}{col 14}{res}{space 2}-.6733811{col 26}{space 2} .2926073{col 37}{space 1}   -2.30{col 46}{space 3}0.021{col 54}{space 4}-1.246881{col 67}{space 3}-.0998814
{txt}{space 8}F14. {c |}{col 14}{res}{space 2}-.6891024{col 26}{space 2} .2974604{col 37}{space 1}   -2.32{col 46}{space 3}0.021{col 54}{space 4}-1.272114{col 67}{space 3}-.1060906
{txt}{space 8}F15. {c |}{col 14}{res}{space 2}-.7397593{col 26}{space 2} .3050139{col 37}{space 1}   -2.43{col 46}{space 3}0.015{col 54}{space 4}-1.337576{col 67}{space 3} -.141943
{txt}{space 8}F16. {c |}{col 14}{res}{space 2}-.6046277{col 26}{space 2} .3127799{col 37}{space 1}   -1.93{col 46}{space 3}0.053{col 54}{space 4}-1.217665{col 67}{space 3} .0084097
{txt}{space 8}F17. {c |}{col 14}{res}{space 2} -.488427{col 26}{space 2} .3033024{col 37}{space 1}   -1.61{col 46}{space 3}0.107{col 54}{space 4}-1.082889{col 67}{space 3} .1060347
{txt}{space 8}F18. {c |}{col 14}{res}{space 2}-.2412143{col 26}{space 2} .2986678{col 37}{space 1}   -0.81{col 46}{space 3}0.419{col 54}{space 4}-.8265924{col 67}{space 3} .3441638
{txt}{space 8}F19. {c |}{col 14}{res}{space 2}-.1476582{col 26}{space 2} .2988297{col 37}{space 1}   -0.49{col 46}{space 3}0.621{col 54}{space 4}-.7333535{col 67}{space 3} .4380372
{txt}{space 8}F20. {c |}{col 14}{res}{space 2} .1400835{col 26}{space 2} .3133009{col 37}{space 1}    0.45{col 46}{space 3}0.655{col 54}{space 4}-.4739749{col 67}{space 3} .7541419
{txt}{space 8}F21. {c |}{col 14}{res}{space 2} .1758731{col 26}{space 2} .3140751{col 37}{space 1}    0.56{col 46}{space 3}0.575{col 54}{space 4}-.4397029{col 67}{space 3}  .791449
{txt}{space 8}F22. {c |}{col 14}{res}{space 2}  .214252{col 26}{space 2} .3231867{col 37}{space 1}    0.66{col 46}{space 3}0.507{col 54}{space 4}-.4191823{col 67}{space 3} .8476862
{txt}{space 8}F23. {c |}{col 14}{res}{space 2} .3665076{col 26}{space 2} .3433977{col 37}{space 1}    1.07{col 46}{space 3}0.286{col 54}{space 4}-.3065395{col 67}{space 3} 1.039555
{txt}{space 8}F24. {c |}{col 14}{res}{space 2} .4957079{col 26}{space 2}  .360947{col 37}{space 1}    1.37{col 46}{space 3}0.170{col 54}{space 4}-.2117352{col 67}{space 3} 1.203151
{txt}{space 8}F25. {c |}{col 14}{res}{space 2} .4839559{col 26}{space 2} .3663718{col 37}{space 1}    1.32{col 46}{space 3}0.187{col 54}{space 4}-.2341197{col 67}{space 3} 1.202032
{txt}{space 8}F26. {c |}{col 14}{res}{space 2} .5916974{col 26}{space 2} .3615727{col 37}{space 1}    1.64{col 46}{space 3}0.102{col 54}{space 4}-.1169721{col 67}{space 3} 1.300367
{txt}{space 8}F27. {c |}{col 14}{res}{space 2} .4647469{col 26}{space 2}  .356857{col 37}{space 1}    1.30{col 46}{space 3}0.193{col 54}{space 4}  -.23468{col 67}{space 3} 1.164174
{txt}{space 8}F28. {c |}{col 14}{res}{space 2} .4304474{col 26}{space 2} .3458491{col 37}{space 1}    1.24{col 46}{space 3}0.213{col 54}{space 4}-.2474044{col 67}{space 3} 1.108299
{txt}{space 8}F29. {c |}{col 14}{res}{space 2} .3186042{col 26}{space 2} .3425461{col 37}{space 1}    0.93{col 46}{space 3}0.352{col 54}{space 4}-.3527738{col 67}{space 3} .9899822
{txt}{space 8}F30. {c |}{col 14}{res}{space 2}  .282719{col 26}{space 2} .3496811{col 37}{space 1}    0.81{col 46}{space 3}0.419{col 54}{space 4}-.4026434{col 67}{space 3} .9680813
{txt}{space 8}F31. {c |}{col 14}{res}{space 2} .2272734{col 26}{space 2} .3368142{col 37}{space 1}    0.67{col 46}{space 3}0.500{col 54}{space 4}-.4328703{col 67}{space 3} .8874171
{txt}{space 8}F32. {c |}{col 14}{res}{space 2} .0744691{col 26}{space 2} .3289434{col 37}{space 1}    0.23{col 46}{space 3}0.821{col 54}{space 4}-.5702481{col 67}{space 3} .7191862
{txt}{space 8}F33. {c |}{col 14}{res}{space 2} .0182027{col 26}{space 2} .3132934{col 37}{space 1}    0.06{col 46}{space 3}0.954{col 54}{space 4} -.595841{col 67}{space 3} .6322464
{txt}{space 8}F34. {c |}{col 14}{res}{space 2}-.0797312{col 26}{space 2} .2913393{col 37}{space 1}   -0.27{col 46}{space 3}0.784{col 54}{space 4}-.6507457{col 67}{space 3} .4912833
{txt}{space 8}F35. {c |}{col 14}{res}{space 2}-.0556459{col 26}{space 2} .2860831{col 37}{space 1}   -0.19{col 46}{space 3}0.846{col 54}{space 4}-.6163584{col 67}{space 3} .5050667
{txt}{space 8}F36. {c |}{col 14}{res}{space 2}-.2721601{col 26}{space 2} .2664515{col 37}{space 1}   -1.02{col 46}{space 3}0.307{col 54}{space 4}-.7943956{col 67}{space 3} .2500753
{txt}{space 8}F37. {c |}{col 14}{res}{space 2}-.1410422{col 26}{space 2} .2623644{col 37}{space 1}   -0.54{col 46}{space 3}0.591{col 54}{space 4}-.6552671{col 67}{space 3} .3731826
{txt}{space 8}F38. {c |}{col 14}{res}{space 2}-.1084543{col 26}{space 2} .2510607{col 37}{space 1}   -0.43{col 46}{space 3}0.666{col 54}{space 4}-.6005243{col 67}{space 3} .3836156
{txt}{space 8}F39. {c |}{col 14}{res}{space 2} .1826222{col 26}{space 2} .2496815{col 37}{space 1}    0.73{col 46}{space 3}0.465{col 54}{space 4}-.3067444{col 67}{space 3} .6719889
{txt}{space 8}F40. {c |}{col 14}{res}{space 2} .2257937{col 26}{space 2} .2471161{col 37}{space 1}    0.91{col 46}{space 3}0.361{col 54}{space 4}-.2585451{col 67}{space 3} .7101324
{txt}{space 8}F41. {c |}{col 14}{res}{space 2} .1803455{col 26}{space 2} .2388026{col 37}{space 1}    0.76{col 46}{space 3}0.450{col 54}{space 4}-.2876989{col 67}{space 3}   .64839
{txt}{space 8}F42. {c |}{col 14}{res}{space 2}  .252917{col 26}{space 2} .2370821{col 37}{space 1}    1.07{col 46}{space 3}0.286{col 54}{space 4}-.2117555{col 67}{space 3} .7175894
{txt}{space 8}F43. {c |}{col 14}{res}{space 2} .2810814{col 26}{space 2} .2286969{col 37}{space 1}    1.23{col 46}{space 3}0.219{col 54}{space 4}-.1671563{col 67}{space 3}  .729319
{txt}{space 8}F44. {c |}{col 14}{res}{space 2} .2822592{col 26}{space 2} .2293478{col 37}{space 1}    1.23{col 46}{space 3}0.218{col 54}{space 4}-.1672542{col 67}{space 3} .7317726
{txt}{space 8}F45. {c |}{col 14}{res}{space 2} .2405543{col 26}{space 2} .2316017{col 37}{space 1}    1.04{col 46}{space 3}0.299{col 54}{space 4}-.2133766{col 67}{space 3} .6944853
{txt}{space 8}F46. {c |}{col 14}{res}{space 2} .3791943{col 26}{space 2} .2263498{col 37}{space 1}    1.68{col 46}{space 3}0.094{col 54}{space 4}-.0644432{col 67}{space 3} .8228318
{txt}{space 8}F47. {c |}{col 14}{res}{space 2} .2754352{col 26}{space 2} .2261968{col 37}{space 1}    1.22{col 46}{space 3}0.223{col 54}{space 4}-.1679023{col 67}{space 3} .7187728
{txt}{space 8}F48. {c |}{col 14}{res}{space 2} .2835059{col 26}{space 2} .2122776{col 37}{space 1}    1.34{col 46}{space 3}0.182{col 54}{space 4}-.1325505{col 67}{space 3} .6995624
{txt}{space 12} {c |}
{space 8}lrpo {c |}
{space 9}F1. {c |}{col 14}{res}{space 2}-1.035297{col 26}{space 2} .8678237{col 37}{space 1}   -1.19{col 46}{space 3}0.233{col 54}{space 4}  -2.7362{col 67}{space 3} .6656065
{txt}{space 9}F2. {c |}{col 14}{res}{space 2}-.5091918{col 26}{space 2} 1.523481{col 37}{space 1}   -0.33{col 46}{space 3}0.738{col 54}{space 4}-3.495159{col 67}{space 3} 2.476776
{txt}{space 9}F3. {c |}{col 14}{res}{space 2}-.4777561{col 26}{space 2} 2.071499{col 37}{space 1}   -0.23{col 46}{space 3}0.818{col 54}{space 4} -4.53782{col 67}{space 3} 3.582308
{txt}{space 9}F4. {c |}{col 14}{res}{space 2} .0617415{col 26}{space 2} 2.335946{col 37}{space 1}    0.03{col 46}{space 3}0.979{col 54}{space 4}-4.516629{col 67}{space 3} 4.640112
{txt}{space 9}F5. {c |}{col 14}{res}{space 2}-1.510964{col 26}{space 2} 2.284877{col 37}{space 1}   -0.66{col 46}{space 3}0.508{col 54}{space 4} -5.98924{col 67}{space 3} 2.967313
{txt}{space 9}F6. {c |}{col 14}{res}{space 2}-2.775944{col 26}{space 2} 2.296182{col 37}{space 1}   -1.21{col 46}{space 3}0.227{col 54}{space 4}-7.276378{col 67}{space 3}  1.72449
{txt}{space 9}F7. {c |}{col 14}{res}{space 2} -2.76583{col 26}{space 2} 2.304106{col 37}{space 1}   -1.20{col 46}{space 3}0.230{col 54}{space 4}-7.281796{col 67}{space 3} 1.750135
{txt}{space 9}F8. {c |}{col 14}{res}{space 2}-3.386153{col 26}{space 2} 2.389143{col 37}{space 1}   -1.42{col 46}{space 3}0.156{col 54}{space 4}-8.068787{col 67}{space 3}  1.29648
{txt}{space 9}F9. {c |}{col 14}{res}{space 2}-4.971245{col 26}{space 2} 2.625522{col 37}{space 1}   -1.89{col 46}{space 3}0.058{col 54}{space 4}-10.11717{col 67}{space 3} .1746845
{txt}{space 8}F10. {c |}{col 14}{res}{space 2} -7.09296{col 26}{space 2} 2.746076{col 37}{space 1}   -2.58{col 46}{space 3}0.010{col 54}{space 4}-12.47517{col 67}{space 3}-1.710749
{txt}{space 8}F11. {c |}{col 14}{res}{space 2}-8.003618{col 26}{space 2} 2.606425{col 37}{space 1}   -3.07{col 46}{space 3}0.002{col 54}{space 4}-13.11212{col 67}{space 3}-2.895118
{txt}{space 8}F12. {c |}{col 14}{res}{space 2}-7.133534{col 26}{space 2} 2.632172{col 37}{space 1}   -2.71{col 46}{space 3}0.007{col 54}{space 4} -12.2925{col 67}{space 3}-1.974572
{txt}{space 8}F13. {c |}{col 14}{res}{space 2}-9.154084{col 26}{space 2} 2.907605{col 37}{space 1}   -3.15{col 46}{space 3}0.002{col 54}{space 4}-14.85289{col 67}{space 3}-3.455282
{txt}{space 8}F14. {c |}{col 14}{res}{space 2}-10.51889{col 26}{space 2} 3.019684{col 37}{space 1}   -3.48{col 46}{space 3}0.000{col 54}{space 4}-16.43736{col 67}{space 3}-4.600421
{txt}{space 8}F15. {c |}{col 14}{res}{space 2}-8.190792{col 26}{space 2} 3.280113{col 37}{space 1}   -2.50{col 46}{space 3}0.013{col 54}{space 4} -14.6197{col 67}{space 3}-1.761888
{txt}{space 8}F16. {c |}{col 14}{res}{space 2} -6.40707{col 26}{space 2} 3.457894{col 37}{space 1}   -1.85{col 46}{space 3}0.064{col 54}{space 4}-13.18442{col 67}{space 3} .3702778
{txt}{space 8}F17. {c |}{col 14}{res}{space 2}-2.504367{col 26}{space 2} 3.489385{col 37}{space 1}   -0.72{col 46}{space 3}0.473{col 54}{space 4}-9.343435{col 67}{space 3} 4.334701
{txt}{space 8}F18. {c |}{col 14}{res}{space 2} 2.028867{col 26}{space 2} 3.301231{col 37}{space 1}    0.61{col 46}{space 3}0.539{col 54}{space 4}-4.441426{col 67}{space 3}  8.49916
{txt}{space 8}F19. {c |}{col 14}{res}{space 2}  5.18026{col 26}{space 2} 3.290029{col 37}{space 1}    1.57{col 46}{space 3}0.115{col 54}{space 4}-1.268079{col 67}{space 3}  11.6286
{txt}{space 8}F20. {c |}{col 14}{res}{space 2} 6.402893{col 26}{space 2} 3.313162{col 37}{space 1}    1.93{col 46}{space 3}0.053{col 54}{space 4}-.0907844{col 67}{space 3} 12.89657
{txt}{space 8}F21. {c |}{col 14}{res}{space 2}  7.82877{col 26}{space 2} 3.316296{col 37}{space 1}    2.36{col 46}{space 3}0.018{col 54}{space 4}  1.32895{col 67}{space 3} 14.32859
{txt}{space 8}F22. {c |}{col 14}{res}{space 2} 8.529253{col 26}{space 2} 3.561709{col 37}{space 1}    2.39{col 46}{space 3}0.017{col 54}{space 4} 1.548432{col 67}{space 3} 15.51007
{txt}{space 8}F23. {c |}{col 14}{res}{space 2} 9.926737{col 26}{space 2} 3.790632{col 37}{space 1}    2.62{col 46}{space 3}0.009{col 54}{space 4} 2.497234{col 67}{space 3} 17.35624
{txt}{space 8}F24. {c |}{col 14}{res}{space 2} 8.187615{col 26}{space 2} 3.849058{col 37}{space 1}    2.13{col 46}{space 3}0.033{col 54}{space 4} .6436001{col 67}{space 3} 15.73163
{txt}{space 8}F25. {c |}{col 14}{res}{space 2} 7.562161{col 26}{space 2}  4.08725{col 37}{space 1}    1.85{col 46}{space 3}0.064{col 54}{space 4}-.4487005{col 67}{space 3} 15.57302
{txt}{space 8}F26. {c |}{col 14}{res}{space 2} 3.798006{col 26}{space 2} 4.172022{col 37}{space 1}    0.91{col 46}{space 3}0.363{col 54}{space 4}-4.379007{col 67}{space 3} 11.97502
{txt}{space 8}F27. {c |}{col 14}{res}{space 2} 2.671851{col 26}{space 2} 4.074515{col 37}{space 1}    0.66{col 46}{space 3}0.512{col 54}{space 4}-5.314053{col 67}{space 3} 10.65775
{txt}{space 8}F28. {c |}{col 14}{res}{space 2} 4.945822{col 26}{space 2} 4.134448{col 37}{space 1}    1.20{col 46}{space 3}0.232{col 54}{space 4}-3.157547{col 67}{space 3} 13.04919
{txt}{space 8}F29. {c |}{col 14}{res}{space 2} 6.103774{col 26}{space 2} 4.296959{col 37}{space 1}    1.42{col 46}{space 3}0.155{col 54}{space 4}-2.318111{col 67}{space 3} 14.52566
{txt}{space 8}F30. {c |}{col 14}{res}{space 2} 7.365064{col 26}{space 2} 4.406186{col 37}{space 1}    1.67{col 46}{space 3}0.095{col 54}{space 4}-1.270902{col 67}{space 3} 16.00103
{txt}{space 8}F31. {c |}{col 14}{res}{space 2} 4.813972{col 26}{space 2} 4.421213{col 37}{space 1}    1.09{col 46}{space 3}0.276{col 54}{space 4}-3.851447{col 67}{space 3} 13.47939
{txt}{space 8}F32. {c |}{col 14}{res}{space 2} 6.423049{col 26}{space 2} 4.246002{col 37}{space 1}    1.51{col 46}{space 3}0.130{col 54}{space 4}-1.898962{col 67}{space 3} 14.74506
{txt}{space 8}F33. {c |}{col 14}{res}{space 2} 4.557719{col 26}{space 2} 4.075308{col 37}{space 1}    1.12{col 46}{space 3}0.263{col 54}{space 4}-3.429738{col 67}{space 3} 12.54518
{txt}{space 8}F34. {c |}{col 14}{res}{space 2} 5.710266{col 26}{space 2} 3.864101{col 37}{space 1}    1.48{col 46}{space 3}0.139{col 54}{space 4}-1.863233{col 67}{space 3} 13.28376
{txt}{space 8}F35. {c |}{col 14}{res}{space 2} 5.009091{col 26}{space 2} 3.683661{col 37}{space 1}    1.36{col 46}{space 3}0.174{col 54}{space 4}-2.210753{col 67}{space 3} 12.22893
{txt}{space 8}F36. {c |}{col 14}{res}{space 2} 4.219673{col 26}{space 2} 3.542324{col 37}{space 1}    1.19{col 46}{space 3}0.234{col 54}{space 4}-2.723155{col 67}{space 3}  11.1625
{txt}{space 8}F37. {c |}{col 14}{res}{space 2} 3.745311{col 26}{space 2} 3.318376{col 37}{space 1}    1.13{col 46}{space 3}0.259{col 54}{space 4}-2.758587{col 67}{space 3} 10.24921
{txt}{space 8}F38. {c |}{col 14}{res}{space 2} 4.173278{col 26}{space 2} 3.350137{col 37}{space 1}    1.25{col 46}{space 3}0.213{col 54}{space 4}-2.392871{col 67}{space 3} 10.73943
{txt}{space 8}F39. {c |}{col 14}{res}{space 2} 5.129436{col 26}{space 2} 3.267089{col 37}{space 1}    1.57{col 46}{space 3}0.116{col 54}{space 4}-1.273941{col 67}{space 3} 11.53281
{txt}{space 8}F40. {c |}{col 14}{res}{space 2} 5.430991{col 26}{space 2} 3.274658{col 37}{space 1}    1.66{col 46}{space 3}0.097{col 54}{space 4}-.9872198{col 67}{space 3}  11.8492
{txt}{space 8}F41. {c |}{col 14}{res}{space 2} 6.453963{col 26}{space 2} 3.220705{col 37}{space 1}    2.00{col 46}{space 3}0.045{col 54}{space 4} .1414974{col 67}{space 3} 12.76643
{txt}{space 8}F42. {c |}{col 14}{res}{space 2} 7.098078{col 26}{space 2} 3.248848{col 37}{space 1}    2.18{col 46}{space 3}0.029{col 54}{space 4} .7304519{col 67}{space 3}  13.4657
{txt}{space 8}F43. {c |}{col 14}{res}{space 2} 7.469213{col 26}{space 2} 3.178055{col 37}{space 1}    2.35{col 46}{space 3}0.019{col 54}{space 4}  1.24034{col 67}{space 3} 13.69809
{txt}{space 8}F44. {c |}{col 14}{res}{space 2}  7.73923{col 26}{space 2} 3.199261{col 37}{space 1}    2.42{col 46}{space 3}0.016{col 54}{space 4} 1.468793{col 67}{space 3} 14.00967
{txt}{space 8}F45. {c |}{col 14}{res}{space 2} 9.558716{col 26}{space 2} 3.318485{col 37}{space 1}    2.88{col 46}{space 3}0.004{col 54}{space 4} 3.054606{col 67}{space 3} 16.06283
{txt}{space 8}F46. {c |}{col 14}{res}{space 2} 10.88257{col 26}{space 2} 3.669217{col 37}{space 1}    2.97{col 46}{space 3}0.003{col 54}{space 4} 3.691032{col 67}{space 3}  18.0741
{txt}{space 8}F47. {c |}{col 14}{res}{space 2} 8.530855{col 26}{space 2} 3.935616{col 37}{space 1}    2.17{col 46}{space 3}0.030{col 54}{space 4} .8171888{col 67}{space 3} 16.24452
{txt}{space 8}F48. {c |}{col 14}{res}{space 2} 6.254434{col 26}{space 2} 3.937757{col 37}{space 1}    1.59{col 46}{space 3}0.112{col 54}{space 4}-1.463428{col 67}{space 3}  13.9723
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ldem         {txt}{c |}
{space 8}lpro {c |}
{space 9}F1. {c |}{col 14}{res}{space 2} .3218579{col 26}{space 2} .0910807{col 37}{space 1}    3.53{col 46}{space 3}0.000{col 54}{space 4}  .143343{col 67}{space 3} .5003727
{txt}{space 9}F2. {c |}{col 14}{res}{space 2} .4428703{col 26}{space 2} .1334749{col 37}{space 1}    3.32{col 46}{space 3}0.001{col 54}{space 4} .1812642{col 67}{space 3} .7044763
{txt}{space 9}F3. {c |}{col 14}{res}{space 2} .3195908{col 26}{space 2} .1426911{col 37}{space 1}    2.24{col 46}{space 3}0.025{col 54}{space 4} .0399215{col 67}{space 3} .5992602
{txt}{space 9}F4. {c |}{col 14}{res}{space 2} .4915388{col 26}{space 2} .1554505{col 37}{space 1}    3.16{col 46}{space 3}0.002{col 54}{space 4} .1868614{col 67}{space 3} .7962162
{txt}{space 9}F5. {c |}{col 14}{res}{space 2} .7269921{col 26}{space 2} .1626585{col 37}{space 1}    4.47{col 46}{space 3}0.000{col 54}{space 4} .4081873{col 67}{space 3} 1.045797
{txt}{space 9}F6. {c |}{col 14}{res}{space 2} .7564078{col 26}{space 2} .1874509{col 37}{space 1}    4.04{col 46}{space 3}0.000{col 54}{space 4} .3890109{col 67}{space 3} 1.123805
{txt}{space 9}F7. {c |}{col 14}{res}{space 2} .5879759{col 26}{space 2} .1972382{col 37}{space 1}    2.98{col 46}{space 3}0.003{col 54}{space 4} .2013963{col 67}{space 3} .9745556
{txt}{space 9}F8. {c |}{col 14}{res}{space 2} .4602799{col 26}{space 2} .2064895{col 37}{space 1}    2.23{col 46}{space 3}0.026{col 54}{space 4} .0555679{col 67}{space 3} .8649919
{txt}{space 9}F9. {c |}{col 14}{res}{space 2} .6524492{col 26}{space 2} .2050842{col 37}{space 1}    3.18{col 46}{space 3}0.001{col 54}{space 4} .2504915{col 67}{space 3} 1.054407
{txt}{space 8}F10. {c |}{col 14}{res}{space 2}  .591629{col 26}{space 2} .2187036{col 37}{space 1}    2.71{col 46}{space 3}0.007{col 54}{space 4} .1629777{col 67}{space 3}  1.02028
{txt}{space 8}F11. {c |}{col 14}{res}{space 2} .5738532{col 26}{space 2} .2178568{col 37}{space 1}    2.63{col 46}{space 3}0.008{col 54}{space 4} .1468617{col 67}{space 3} 1.000845
{txt}{space 8}F12. {c |}{col 14}{res}{space 2} .6057503{col 26}{space 2} .2212695{col 37}{space 1}    2.74{col 46}{space 3}0.006{col 54}{space 4}   .17207{col 67}{space 3} 1.039431
{txt}{space 8}F13. {c |}{col 14}{res}{space 2} .4983642{col 26}{space 2} .2038757{col 37}{space 1}    2.44{col 46}{space 3}0.015{col 54}{space 4}  .098775{col 67}{space 3} .8979533
{txt}{space 8}F14. {c |}{col 14}{res}{space 2} .5570758{col 26}{space 2} .2145951{col 37}{space 1}    2.60{col 46}{space 3}0.009{col 54}{space 4} .1364771{col 67}{space 3} .9776745
{txt}{space 8}F15. {c |}{col 14}{res}{space 2} .5056131{col 26}{space 2} .2028804{col 37}{space 1}    2.49{col 46}{space 3}0.013{col 54}{space 4} .1079747{col 67}{space 3} .9032514
{txt}{space 8}F16. {c |}{col 14}{res}{space 2} .4177053{col 26}{space 2}  .196318{col 37}{space 1}    2.13{col 46}{space 3}0.033{col 54}{space 4} .0329292{col 67}{space 3} .8024814
{txt}{space 8}F17. {c |}{col 14}{res}{space 2}  .408629{col 26}{space 2} .1966107{col 37}{space 1}    2.08{col 46}{space 3}0.038{col 54}{space 4} .0232791{col 67}{space 3} .7939788
{txt}{space 8}F18. {c |}{col 14}{res}{space 2} .5966669{col 26}{space 2} .1871414{col 37}{space 1}    3.19{col 46}{space 3}0.001{col 54}{space 4} .2298765{col 67}{space 3} .9634572
{txt}{space 8}F19. {c |}{col 14}{res}{space 2}   .58759{col 26}{space 2} .1771672{col 37}{space 1}    3.32{col 46}{space 3}0.001{col 54}{space 4} .2403486{col 67}{space 3} .9348313
{txt}{space 8}F20. {c |}{col 14}{res}{space 2} .5188852{col 26}{space 2}  .184892{col 37}{space 1}    2.81{col 46}{space 3}0.005{col 54}{space 4} .1565036{col 67}{space 3} .8812668
{txt}{space 8}F21. {c |}{col 14}{res}{space 2} .5649462{col 26}{space 2} .1908402{col 37}{space 1}    2.96{col 46}{space 3}0.003{col 54}{space 4} .1909062{col 67}{space 3} .9389862
{txt}{space 8}F22. {c |}{col 14}{res}{space 2}  .561033{col 26}{space 2} .1948505{col 37}{space 1}    2.88{col 46}{space 3}0.004{col 54}{space 4} .1791331{col 67}{space 3} .9429329
{txt}{space 8}F23. {c |}{col 14}{res}{space 2} .7656009{col 26}{space 2} .1883894{col 37}{space 1}    4.06{col 46}{space 3}0.000{col 54}{space 4} .3963644{col 67}{space 3} 1.134837
{txt}{space 8}F24. {c |}{col 14}{res}{space 2} .4079868{col 26}{space 2}  .204855{col 37}{space 1}    1.99{col 46}{space 3}0.046{col 54}{space 4} .0064784{col 67}{space 3} .8094953
{txt}{space 8}F25. {c |}{col 14}{res}{space 2} .2598199{col 26}{space 2}  .186693{col 37}{space 1}    1.39{col 46}{space 3}0.164{col 54}{space 4}-.1060916{col 67}{space 3} .6257313
{txt}{space 8}F26. {c |}{col 14}{res}{space 2}  .331356{col 26}{space 2} .1719945{col 37}{space 1}    1.93{col 46}{space 3}0.054{col 54}{space 4}-.0057471{col 67}{space 3}  .668459
{txt}{space 8}F27. {c |}{col 14}{res}{space 2} .4525581{col 26}{space 2} .1763741{col 37}{space 1}    2.57{col 46}{space 3}0.010{col 54}{space 4} .1068712{col 67}{space 3} .7982451
{txt}{space 8}F28. {c |}{col 14}{res}{space 2} .6538103{col 26}{space 2} .1880163{col 37}{space 1}    3.48{col 46}{space 3}0.001{col 54}{space 4} .2853051{col 67}{space 3} 1.022316
{txt}{space 8}F29. {c |}{col 14}{res}{space 2} .8910809{col 26}{space 2} .1807428{col 37}{space 1}    4.93{col 46}{space 3}0.000{col 54}{space 4} .5368315{col 67}{space 3}  1.24533
{txt}{space 8}F30. {c |}{col 14}{res}{space 2} .9407266{col 26}{space 2} .1861336{col 37}{space 1}    5.05{col 46}{space 3}0.000{col 54}{space 4} .5759115{col 67}{space 3} 1.305542
{txt}{space 8}F31. {c |}{col 14}{res}{space 2} .8617307{col 26}{space 2} .2108947{col 37}{space 1}    4.09{col 46}{space 3}0.000{col 54}{space 4} .4483846{col 67}{space 3} 1.275077
{txt}{space 8}F32. {c |}{col 14}{res}{space 2}  .945135{col 26}{space 2} .1989665{col 37}{space 1}    4.75{col 46}{space 3}0.000{col 54}{space 4} .5551678{col 67}{space 3} 1.335102
{txt}{space 8}F33. {c |}{col 14}{res}{space 2} .8910511{col 26}{space 2}  .217999{col 37}{space 1}    4.09{col 46}{space 3}0.000{col 54}{space 4} .4637808{col 67}{space 3} 1.318321
{txt}{space 8}F34. {c |}{col 14}{res}{space 2} .9575819{col 26}{space 2} .2260582{col 37}{space 1}    4.24{col 46}{space 3}0.000{col 54}{space 4}  .514516{col 67}{space 3} 1.400648
{txt}{space 8}F35. {c |}{col 14}{res}{space 2} .8644397{col 26}{space 2} .2208256{col 37}{space 1}    3.91{col 46}{space 3}0.000{col 54}{space 4} .4316295{col 67}{space 3}  1.29725
{txt}{space 8}F36. {c |}{col 14}{res}{space 2}  .888287{col 26}{space 2} .2250398{col 37}{space 1}    3.95{col 46}{space 3}0.000{col 54}{space 4}  .447217{col 67}{space 3} 1.329357
{txt}{space 8}F37. {c |}{col 14}{res}{space 2} .7420386{col 26}{space 2} .2448387{col 37}{space 1}    3.03{col 46}{space 3}0.002{col 54}{space 4} .2621636{col 67}{space 3} 1.221914
{txt}{space 8}F38. {c |}{col 14}{res}{space 2} .7204428{col 26}{space 2} .2654041{col 37}{space 1}    2.71{col 46}{space 3}0.007{col 54}{space 4} .2002603{col 67}{space 3} 1.240625
{txt}{space 8}F39. {c |}{col 14}{res}{space 2} .7580354{col 26}{space 2} .2554207{col 37}{space 1}    2.97{col 46}{space 3}0.003{col 54}{space 4} .2574201{col 67}{space 3} 1.258651
{txt}{space 8}F40. {c |}{col 14}{res}{space 2} .6823911{col 26}{space 2} .2442358{col 37}{space 1}    2.79{col 46}{space 3}0.005{col 54}{space 4} .2036978{col 67}{space 3} 1.161084
{txt}{space 8}F41. {c |}{col 14}{res}{space 2} .6562083{col 26}{space 2} .2312158{col 37}{space 1}    2.84{col 46}{space 3}0.005{col 54}{space 4} .2030337{col 67}{space 3} 1.109383
{txt}{space 8}F42. {c |}{col 14}{res}{space 2}  .950369{col 26}{space 2} .2340493{col 37}{space 1}    4.06{col 46}{space 3}0.000{col 54}{space 4} .4916409{col 67}{space 3} 1.409097
{txt}{space 8}F43. {c |}{col 14}{res}{space 2} .9629309{col 26}{space 2} .2462152{col 37}{space 1}    3.91{col 46}{space 3}0.000{col 54}{space 4}  .480358{col 67}{space 3} 1.445504
{txt}{space 8}F44. {c |}{col 14}{res}{space 2} .9633353{col 26}{space 2} .2502064{col 37}{space 1}    3.85{col 46}{space 3}0.000{col 54}{space 4} .4729397{col 67}{space 3} 1.453731
{txt}{space 8}F45. {c |}{col 14}{res}{space 2} 1.050868{col 26}{space 2} .2512891{col 37}{space 1}    4.18{col 46}{space 3}0.000{col 54}{space 4} .5583507{col 67}{space 3} 1.543386
{txt}{space 8}F46. {c |}{col 14}{res}{space 2} 1.053585{col 26}{space 2} .2576562{col 37}{space 1}    4.09{col 46}{space 3}0.000{col 54}{space 4} .5485877{col 67}{space 3} 1.558581
{txt}{space 8}F47. {c |}{col 14}{res}{space 2} .8059982{col 26}{space 2} .2465543{col 37}{space 1}    3.27{col 46}{space 3}0.001{col 54}{space 4} .3227607{col 67}{space 3} 1.289236
{txt}{space 8}F48. {c |}{col 14}{res}{space 2}  .763417{col 26}{space 2} .2353578{col 37}{space 1}    3.24{col 46}{space 3}0.001{col 54}{space 4} .3021242{col 67}{space 3}  1.22471
{txt}{space 12} {c |}
{space 8}ldem {c |}
{space 9}F1. {c |}{col 14}{res}{space 2} 1.046875{col 26}{space 2} .0948236{col 37}{space 1}   11.04{col 46}{space 3}0.000{col 54}{space 4} .8610236{col 67}{space 3} 1.232725
{txt}{space 9}F2. {c |}{col 14}{res}{space 2} 1.138593{col 26}{space 2}  .123139{col 37}{space 1}    9.25{col 46}{space 3}0.000{col 54}{space 4} .8972455{col 67}{space 3} 1.379941
{txt}{space 9}F3. {c |}{col 14}{res}{space 2} 1.133209{col 26}{space 2} .1377055{col 37}{space 1}    8.23{col 46}{space 3}0.000{col 54}{space 4} .8633117{col 67}{space 3} 1.403107
{txt}{space 9}F4. {c |}{col 14}{res}{space 2} 1.247688{col 26}{space 2}  .167295{col 37}{space 1}    7.46{col 46}{space 3}0.000{col 54}{space 4} .9197959{col 67}{space 3}  1.57558
{txt}{space 9}F5. {c |}{col 14}{res}{space 2}  1.44092{col 26}{space 2} .2036789{col 37}{space 1}    7.07{col 46}{space 3}0.000{col 54}{space 4} 1.041717{col 67}{space 3} 1.840124
{txt}{space 9}F6. {c |}{col 14}{res}{space 2} 1.392128{col 26}{space 2} .2255071{col 37}{space 1}    6.17{col 46}{space 3}0.000{col 54}{space 4} .9501422{col 67}{space 3} 1.834114
{txt}{space 9}F7. {c |}{col 14}{res}{space 2} 1.429536{col 26}{space 2} .2452196{col 37}{space 1}    5.83{col 46}{space 3}0.000{col 54}{space 4} .9489145{col 67}{space 3} 1.910158
{txt}{space 9}F8. {c |}{col 14}{res}{space 2}  1.47513{col 26}{space 2} .2531021{col 37}{space 1}    5.83{col 46}{space 3}0.000{col 54}{space 4} .9790591{col 67}{space 3} 1.971201
{txt}{space 9}F9. {c |}{col 14}{res}{space 2} 1.355504{col 26}{space 2} .2669248{col 37}{space 1}    5.08{col 46}{space 3}0.000{col 54}{space 4} .8323407{col 67}{space 3} 1.878667
{txt}{space 8}F10. {c |}{col 14}{res}{space 2} 1.235131{col 26}{space 2} .2944097{col 37}{space 1}    4.20{col 46}{space 3}0.000{col 54}{space 4} .6580985{col 67}{space 3} 1.812164
{txt}{space 8}F11. {c |}{col 14}{res}{space 2} 1.214894{col 26}{space 2} .3291087{col 37}{space 1}    3.69{col 46}{space 3}0.000{col 54}{space 4} .5698525{col 67}{space 3} 1.859935
{txt}{space 8}F12. {c |}{col 14}{res}{space 2} 1.028053{col 26}{space 2} .3463392{col 37}{space 1}    2.97{col 46}{space 3}0.003{col 54}{space 4} .3492408{col 67}{space 3} 1.706866
{txt}{space 8}F13. {c |}{col 14}{res}{space 2} 1.199871{col 26}{space 2} .3272665{col 37}{space 1}    3.67{col 46}{space 3}0.000{col 54}{space 4} .5584406{col 67}{space 3} 1.841302
{txt}{space 8}F14. {c |}{col 14}{res}{space 2} 1.226998{col 26}{space 2} .3312339{col 37}{space 1}    3.70{col 46}{space 3}0.000{col 54}{space 4} .5777915{col 67}{space 3} 1.876204
{txt}{space 8}F15. {c |}{col 14}{res}{space 2} 1.103731{col 26}{space 2} .3384474{col 37}{space 1}    3.26{col 46}{space 3}0.001{col 54}{space 4} .4403866{col 67}{space 3} 1.767076
{txt}{space 8}F16. {c |}{col 14}{res}{space 2} 1.207987{col 26}{space 2} .3370149{col 37}{space 1}    3.58{col 46}{space 3}0.000{col 54}{space 4} .5474499{col 67}{space 3} 1.868524
{txt}{space 8}F17. {c |}{col 14}{res}{space 2} 1.092354{col 26}{space 2} .3202961{col 37}{space 1}    3.41{col 46}{space 3}0.001{col 54}{space 4} .4645856{col 67}{space 3} 1.720123
{txt}{space 8}F18. {c |}{col 14}{res}{space 2} 1.226818{col 26}{space 2} .3231715{col 37}{space 1}    3.80{col 46}{space 3}0.000{col 54}{space 4} .5934133{col 67}{space 3} 1.860222
{txt}{space 8}F19. {c |}{col 14}{res}{space 2} 1.205697{col 26}{space 2}  .328559{col 37}{space 1}    3.67{col 46}{space 3}0.000{col 54}{space 4} .5617332{col 67}{space 3} 1.849661
{txt}{space 8}F20. {c |}{col 14}{res}{space 2} 1.123586{col 26}{space 2} .3234526{col 37}{space 1}    3.47{col 46}{space 3}0.001{col 54}{space 4} .4896307{col 67}{space 3} 1.757542
{txt}{space 8}F21. {c |}{col 14}{res}{space 2} 1.279156{col 26}{space 2} .3222445{col 37}{space 1}    3.97{col 46}{space 3}0.000{col 54}{space 4} .6475686{col 67}{space 3} 1.910744
{txt}{space 8}F22. {c |}{col 14}{res}{space 2} 1.050508{col 26}{space 2} .3222613{col 37}{space 1}    3.26{col 46}{space 3}0.001{col 54}{space 4} .4188873{col 67}{space 3} 1.682128
{txt}{space 8}F23. {c |}{col 14}{res}{space 2} .9477445{col 26}{space 2}  .336092{col 37}{space 1}    2.82{col 46}{space 3}0.005{col 54}{space 4} .2890163{col 67}{space 3} 1.606473
{txt}{space 8}F24. {c |}{col 14}{res}{space 2} .7361169{col 26}{space 2}  .340933{col 37}{space 1}    2.16{col 46}{space 3}0.031{col 54}{space 4} .0679005{col 67}{space 3} 1.404333
{txt}{space 8}F25. {c |}{col 14}{res}{space 2}  .564407{col 26}{space 2} .3657621{col 37}{space 1}    1.54{col 46}{space 3}0.123{col 54}{space 4}-.1524735{col 67}{space 3} 1.281288
{txt}{space 8}F26. {c |}{col 14}{res}{space 2} .6102541{col 26}{space 2}  .380518{col 37}{space 1}    1.60{col 46}{space 3}0.109{col 54}{space 4}-.1355474{col 67}{space 3} 1.356056
{txt}{space 8}F27. {c |}{col 14}{res}{space 2}  .733565{col 26}{space 2} .3768517{col 37}{space 1}    1.95{col 46}{space 3}0.052{col 54}{space 4}-.0050507{col 67}{space 3} 1.472181
{txt}{space 8}F28. {c |}{col 14}{res}{space 2} .7551864{col 26}{space 2} .3750475{col 37}{space 1}    2.01{col 46}{space 3}0.044{col 54}{space 4} .0201067{col 67}{space 3} 1.490266
{txt}{space 8}F29. {c |}{col 14}{res}{space 2} .7898558{col 26}{space 2} .3808331{col 37}{space 1}    2.07{col 46}{space 3}0.038{col 54}{space 4} .0434366{col 67}{space 3} 1.536275
{txt}{space 8}F30. {c |}{col 14}{res}{space 2} .8608661{col 26}{space 2} .3791527{col 37}{space 1}    2.27{col 46}{space 3}0.023{col 54}{space 4} .1177404{col 67}{space 3} 1.603992
{txt}{space 8}F31. {c |}{col 14}{res}{space 2} .8479831{col 26}{space 2} .3699377{col 37}{space 1}    2.29{col 46}{space 3}0.022{col 54}{space 4} .1229186{col 67}{space 3} 1.573048
{txt}{space 8}F32. {c |}{col 14}{res}{space 2} 1.042335{col 26}{space 2} .3556897{col 37}{space 1}    2.93{col 46}{space 3}0.003{col 54}{space 4} .3451959{col 67}{space 3} 1.739474
{txt}{space 8}F33. {c |}{col 14}{res}{space 2} .9019358{col 26}{space 2} .3379331{col 37}{space 1}    2.67{col 46}{space 3}0.008{col 54}{space 4} .2395991{col 67}{space 3} 1.564272
{txt}{space 8}F34. {c |}{col 14}{res}{space 2} 1.038526{col 26}{space 2} .3224536{col 37}{space 1}    3.22{col 46}{space 3}0.001{col 54}{space 4} .4065285{col 67}{space 3} 1.670523
{txt}{space 8}F35. {c |}{col 14}{res}{space 2} .9466069{col 26}{space 2} .3106914{col 37}{space 1}    3.05{col 46}{space 3}0.002{col 54}{space 4} .3376629{col 67}{space 3} 1.555551
{txt}{space 8}F36. {c |}{col 14}{res}{space 2} 1.045411{col 26}{space 2} .3085663{col 37}{space 1}    3.39{col 46}{space 3}0.001{col 54}{space 4} .4406319{col 67}{space 3} 1.650189
{txt}{space 8}F37. {c |}{col 14}{res}{space 2} .7412342{col 26}{space 2} .2902894{col 37}{space 1}    2.55{col 46}{space 3}0.011{col 54}{space 4} .1722775{col 67}{space 3} 1.310191
{txt}{space 8}F38. {c |}{col 14}{res}{space 2}  .596118{col 26}{space 2} .2927171{col 37}{space 1}    2.04{col 46}{space 3}0.042{col 54}{space 4}  .022403{col 67}{space 3} 1.169833
{txt}{space 8}F39. {c |}{col 14}{res}{space 2} .4660992{col 26}{space 2} .2868851{col 37}{space 1}    1.62{col 46}{space 3}0.104{col 54}{space 4}-.0961853{col 67}{space 3} 1.028384
{txt}{space 8}F40. {c |}{col 14}{res}{space 2} .4273622{col 26}{space 2} .2837572{col 37}{space 1}    1.51{col 46}{space 3}0.132{col 54}{space 4}-.1287916{col 67}{space 3} .9835161
{txt}{space 8}F41. {c |}{col 14}{res}{space 2} .4508696{col 26}{space 2} .2755601{col 37}{space 1}    1.64{col 46}{space 3}0.102{col 54}{space 4}-.0892182{col 67}{space 3} .9909575
{txt}{space 8}F42. {c |}{col 14}{res}{space 2} .3472458{col 26}{space 2} .2716963{col 37}{space 1}    1.28{col 46}{space 3}0.201{col 54}{space 4}-.1852691{col 67}{space 3} .8797607
{txt}{space 8}F43. {c |}{col 14}{res}{space 2} .4315119{col 26}{space 2}  .262933{col 37}{space 1}    1.64{col 46}{space 3}0.101{col 54}{space 4}-.0838272{col 67}{space 3} .9468511
{txt}{space 8}F44. {c |}{col 14}{res}{space 2} .4113413{col 26}{space 2} .2513728{col 37}{space 1}    1.64{col 46}{space 3}0.102{col 54}{space 4}-.0813403{col 67}{space 3} .9040229
{txt}{space 8}F45. {c |}{col 14}{res}{space 2} .3240129{col 26}{space 2} .2517879{col 37}{space 1}    1.29{col 46}{space 3}0.198{col 54}{space 4}-.1694822{col 67}{space 3} .8175081
{txt}{space 8}F46. {c |}{col 14}{res}{space 2} .2229858{col 26}{space 2} .2475456{col 37}{space 1}    0.90{col 46}{space 3}0.368{col 54}{space 4}-.2621946{col 67}{space 3} .7081663
{txt}{space 8}F47. {c |}{col 14}{res}{space 2} .1982591{col 26}{space 2} .2381288{col 37}{space 1}    0.83{col 46}{space 3}0.405{col 54}{space 4}-.2684648{col 67}{space 3} .6649829
{txt}{space 8}F48. {c |}{col 14}{res}{space 2} .2268915{col 26}{space 2} .2352574{col 37}{space 1}    0.96{col 46}{space 3}0.335{col 54}{space 4}-.2342045{col 67}{space 3} .6879875
{txt}{space 12} {c |}
{space 8}lrpo {c |}
{space 9}F1. {c |}{col 14}{res}{space 2} 1.689508{col 26}{space 2} 1.118601{col 37}{space 1}    1.51{col 46}{space 3}0.131{col 54}{space 4}-.5029093{col 67}{space 3} 3.881926
{txt}{space 9}F2. {c |}{col 14}{res}{space 2} 3.641443{col 26}{space 2} 1.781668{col 37}{space 1}    2.04{col 46}{space 3}0.041{col 54}{space 4} .1494385{col 67}{space 3} 7.133447
{txt}{space 9}F3. {c |}{col 14}{res}{space 2} 6.059927{col 26}{space 2} 2.397912{col 37}{space 1}    2.53{col 46}{space 3}0.011{col 54}{space 4} 1.360105{col 67}{space 3} 10.75975
{txt}{space 9}F4. {c |}{col 14}{res}{space 2} 5.830916{col 26}{space 2} 2.655073{col 37}{space 1}    2.20{col 46}{space 3}0.028{col 54}{space 4} .6270688{col 67}{space 3} 11.03476
{txt}{space 9}F5. {c |}{col 14}{res}{space 2} 4.562135{col 26}{space 2} 2.777301{col 37}{space 1}    1.64{col 46}{space 3}0.100{col 54}{space 4}-.8812742{col 67}{space 3} 10.00554
{txt}{space 9}F6. {c |}{col 14}{res}{space 2} 3.624713{col 26}{space 2} 2.849752{col 37}{space 1}    1.27{col 46}{space 3}0.203{col 54}{space 4}-1.960697{col 67}{space 3} 9.210124
{txt}{space 9}F7. {c |}{col 14}{res}{space 2} 3.630378{col 26}{space 2} 2.638742{col 37}{space 1}    1.38{col 46}{space 3}0.169{col 54}{space 4}-1.541462{col 67}{space 3} 8.802218
{txt}{space 9}F8. {c |}{col 14}{res}{space 2} 4.280426{col 26}{space 2} 2.748472{col 37}{space 1}    1.56{col 46}{space 3}0.119{col 54}{space 4}-1.106481{col 67}{space 3} 9.667332
{txt}{space 9}F9. {c |}{col 14}{res}{space 2} 1.869367{col 26}{space 2} 2.699248{col 37}{space 1}    0.69{col 46}{space 3}0.489{col 54}{space 4}-3.421062{col 67}{space 3} 7.159796
{txt}{space 8}F10. {c |}{col 14}{res}{space 2} .5613656{col 26}{space 2} 2.851775{col 37}{space 1}    0.20{col 46}{space 3}0.844{col 54}{space 4} -5.02801{col 67}{space 3} 6.150741
{txt}{space 8}F11. {c |}{col 14}{res}{space 2}-4.080022{col 26}{space 2}  2.99243{col 37}{space 1}   -1.36{col 46}{space 3}0.173{col 54}{space 4}-9.945077{col 67}{space 3} 1.785032
{txt}{space 8}F12. {c |}{col 14}{res}{space 2} -5.24124{col 26}{space 2} 3.323472{col 37}{space 1}   -1.58{col 46}{space 3}0.115{col 54}{space 4}-11.75513{col 67}{space 3} 1.272647
{txt}{space 8}F13. {c |}{col 14}{res}{space 2}-4.077873{col 26}{space 2} 3.525243{col 37}{space 1}   -1.16{col 46}{space 3}0.247{col 54}{space 4}-10.98722{col 67}{space 3} 2.831476
{txt}{space 8}F14. {c |}{col 14}{res}{space 2}-2.267105{col 26}{space 2} 3.649733{col 37}{space 1}   -0.62{col 46}{space 3}0.534{col 54}{space 4} -9.42045{col 67}{space 3}  4.88624
{txt}{space 8}F15. {c |}{col 14}{res}{space 2}-1.118864{col 26}{space 2} 3.805283{col 37}{space 1}   -0.29{col 46}{space 3}0.769{col 54}{space 4}-8.577083{col 67}{space 3} 6.339354
{txt}{space 8}F16. {c |}{col 14}{res}{space 2} .9258585{col 26}{space 2} 3.743501{col 37}{space 1}    0.25{col 46}{space 3}0.805{col 54}{space 4}-6.411269{col 67}{space 3} 8.262986
{txt}{space 8}F17. {c |}{col 14}{res}{space 2}-.8571546{col 26}{space 2} 3.627721{col 37}{space 1}   -0.24{col 46}{space 3}0.813{col 54}{space 4}-7.967358{col 67}{space 3} 6.253049
{txt}{space 8}F18. {c |}{col 14}{res}{space 2} -1.33632{col 26}{space 2} 3.567704{col 37}{space 1}   -0.37{col 46}{space 3}0.708{col 54}{space 4}-8.328893{col 67}{space 3} 5.656252
{txt}{space 8}F19. {c |}{col 14}{res}{space 2}-.6736052{col 26}{space 2} 3.424858{col 37}{space 1}   -0.20{col 46}{space 3}0.844{col 54}{space 4}-7.386204{col 67}{space 3} 6.038993
{txt}{space 8}F20. {c |}{col 14}{res}{space 2} .5451716{col 26}{space 2} 3.431301{col 37}{space 1}    0.16{col 46}{space 3}0.874{col 54}{space 4}-6.180056{col 67}{space 3} 7.270399
{txt}{space 8}F21. {c |}{col 14}{res}{space 2}-1.101258{col 26}{space 2} 3.508483{col 37}{space 1}   -0.31{col 46}{space 3}0.754{col 54}{space 4}-7.977758{col 67}{space 3} 5.775242
{txt}{space 8}F22. {c |}{col 14}{res}{space 2}-1.647044{col 26}{space 2} 3.698109{col 37}{space 1}   -0.45{col 46}{space 3}0.656{col 54}{space 4}-8.895204{col 67}{space 3} 5.601116
{txt}{space 8}F23. {c |}{col 14}{res}{space 2}-3.361666{col 26}{space 2} 3.817995{col 37}{space 1}   -0.88{col 46}{space 3}0.379{col 54}{space 4} -10.8448{col 67}{space 3} 4.121467
{txt}{space 8}F24. {c |}{col 14}{res}{space 2}-4.490175{col 26}{space 2} 4.215046{col 37}{space 1}   -1.07{col 46}{space 3}0.287{col 54}{space 4}-12.75151{col 67}{space 3} 3.771163
{txt}{space 8}F25. {c |}{col 14}{res}{space 2}-4.524242{col 26}{space 2} 4.613686{col 37}{space 1}   -0.98{col 46}{space 3}0.327{col 54}{space 4} -13.5669{col 67}{space 3} 4.518416
{txt}{space 8}F26. {c |}{col 14}{res}{space 2}-3.605187{col 26}{space 2} 4.843228{col 37}{space 1}   -0.74{col 46}{space 3}0.457{col 54}{space 4}-13.09774{col 67}{space 3} 5.887365
{txt}{space 8}F27. {c |}{col 14}{res}{space 2}-2.689425{col 26}{space 2} 4.961399{col 37}{space 1}   -0.54{col 46}{space 3}0.588{col 54}{space 4}-12.41359{col 67}{space 3} 7.034739
{txt}{space 8}F28. {c |}{col 14}{res}{space 2}-6.419297{col 26}{space 2} 4.978141{col 37}{space 1}   -1.29{col 46}{space 3}0.197{col 54}{space 4}-16.17627{col 67}{space 3}  3.33768
{txt}{space 8}F29. {c |}{col 14}{res}{space 2} -6.65785{col 26}{space 2}  5.05813{col 37}{space 1}   -1.32{col 46}{space 3}0.188{col 54}{space 4} -16.5716{col 67}{space 3} 3.255902
{txt}{space 8}F30. {c |}{col 14}{res}{space 2}-7.081197{col 26}{space 2} 4.977401{col 37}{space 1}   -1.42{col 46}{space 3}0.155{col 54}{space 4}-16.83672{col 67}{space 3}  2.67433
{txt}{space 8}F31. {c |}{col 14}{res}{space 2}-4.754398{col 26}{space 2} 5.073191{col 37}{space 1}   -0.94{col 46}{space 3}0.349{col 54}{space 4}-14.69767{col 67}{space 3} 5.188874
{txt}{space 8}F32. {c |}{col 14}{res}{space 2}-4.723033{col 26}{space 2} 4.812308{col 37}{space 1}   -0.98{col 46}{space 3}0.326{col 54}{space 4}-14.15498{col 67}{space 3} 4.708917
{txt}{space 8}F33. {c |}{col 14}{res}{space 2}-1.843157{col 26}{space 2} 4.628529{col 37}{space 1}   -0.40{col 46}{space 3}0.690{col 54}{space 4}-10.91491{col 67}{space 3} 7.228593
{txt}{space 8}F34. {c |}{col 14}{res}{space 2}-2.449906{col 26}{space 2} 4.518413{col 37}{space 1}   -0.54{col 46}{space 3}0.588{col 54}{space 4}-11.30583{col 67}{space 3}  6.40602
{txt}{space 8}F35. {c |}{col 14}{res}{space 2}-2.059151{col 26}{space 2} 4.419265{col 37}{space 1}   -0.47{col 46}{space 3}0.641{col 54}{space 4}-10.72075{col 67}{space 3} 6.602449
{txt}{space 8}F36. {c |}{col 14}{res}{space 2} -3.11107{col 26}{space 2} 4.138521{col 37}{space 1}   -0.75{col 46}{space 3}0.452{col 54}{space 4}-11.22242{col 67}{space 3} 5.000281
{txt}{space 8}F37. {c |}{col 14}{res}{space 2}-5.189581{col 26}{space 2}  3.94664{col 37}{space 1}   -1.31{col 46}{space 3}0.189{col 54}{space 4}-12.92485{col 67}{space 3} 2.545691
{txt}{space 8}F38. {c |}{col 14}{res}{space 2}-7.095076{col 26}{space 2} 3.871436{col 37}{space 1}   -1.83{col 46}{space 3}0.067{col 54}{space 4}-14.68295{col 67}{space 3} .4927996
{txt}{space 8}F39. {c |}{col 14}{res}{space 2}-9.542277{col 26}{space 2} 3.868521{col 37}{space 1}   -2.47{col 46}{space 3}0.014{col 54}{space 4}-17.12444{col 67}{space 3}-1.960116
{txt}{space 8}F40. {c |}{col 14}{res}{space 2}-11.38773{col 26}{space 2} 3.651754{col 37}{space 1}   -3.12{col 46}{space 3}0.002{col 54}{space 4}-18.54504{col 67}{space 3}-4.230425
{txt}{space 8}F41. {c |}{col 14}{res}{space 2}-9.759108{col 26}{space 2} 3.690208{col 37}{space 1}   -2.64{col 46}{space 3}0.008{col 54}{space 4}-16.99178{col 67}{space 3}-2.526432
{txt}{space 8}F42. {c |}{col 14}{res}{space 2} -10.7876{col 26}{space 2} 3.772677{col 37}{space 1}   -2.86{col 46}{space 3}0.004{col 54}{space 4}-18.18191{col 67}{space 3}-3.393288
{txt}{space 8}F43. {c |}{col 14}{res}{space 2} -12.9678{col 26}{space 2}  3.73216{col 37}{space 1}   -3.47{col 46}{space 3}0.001{col 54}{space 4} -20.2827{col 67}{space 3}-5.652905
{txt}{space 8}F44. {c |}{col 14}{res}{space 2}-13.89193{col 26}{space 2} 3.920096{col 37}{space 1}   -3.54{col 46}{space 3}0.000{col 54}{space 4}-21.57518{col 67}{space 3}-6.208685
{txt}{space 8}F45. {c |}{col 14}{res}{space 2} -13.4807{col 26}{space 2} 4.006229{col 37}{space 1}   -3.36{col 46}{space 3}0.001{col 54}{space 4}-21.33276{col 67}{space 3}-5.628633
{txt}{space 8}F46. {c |}{col 14}{res}{space 2}-11.89431{col 26}{space 2} 4.132063{col 37}{space 1}   -2.88{col 46}{space 3}0.004{col 54}{space 4}-19.99301{col 67}{space 3}-3.795617
{txt}{space 8}F47. {c |}{col 14}{res}{space 2}-11.00377{col 26}{space 2} 4.566892{col 37}{space 1}   -2.41{col 46}{space 3}0.016{col 54}{space 4}-19.95471{col 67}{space 3}-2.052824
{txt}{space 8}F48. {c |}{col 14}{res}{space 2}-11.75092{col 26}{space 2} 4.622477{col 37}{space 1}   -2.54{col 46}{space 3}0.011{col 54}{space 4}-20.81081{col 67}{space 3}-2.691034
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lrpo         {txt}{c |}
{space 8}lpro {c |}
{space 9}F1. {c |}{col 14}{res}{space 2} .0052053{col 26}{space 2} .0060159{col 37}{space 1}    0.87{col 46}{space 3}0.387{col 54}{space 4}-.0065858{col 67}{space 3} .0169963
{txt}{space 9}F2. {c |}{col 14}{res}{space 2}  .004056{col 26}{space 2} .0074946{col 37}{space 1}    0.54{col 46}{space 3}0.588{col 54}{space 4}-.0106331{col 67}{space 3} .0187451
{txt}{space 9}F3. {c |}{col 14}{res}{space 2} .0036249{col 26}{space 2} .0094164{col 37}{space 1}    0.38{col 46}{space 3}0.700{col 54}{space 4}-.0148309{col 67}{space 3} .0220807
{txt}{space 9}F4. {c |}{col 14}{res}{space 2}   .00405{col 26}{space 2} .0110565{col 37}{space 1}    0.37{col 46}{space 3}0.714{col 54}{space 4}-.0176203{col 67}{space 3} .0257204
{txt}{space 9}F5. {c |}{col 14}{res}{space 2}-.0024532{col 26}{space 2} .0122807{col 37}{space 1}   -0.20{col 46}{space 3}0.842{col 54}{space 4} -.026523{col 67}{space 3} .0216166
{txt}{space 9}F6. {c |}{col 14}{res}{space 2}-.0023882{col 26}{space 2} .0148443{col 37}{space 1}   -0.16{col 46}{space 3}0.872{col 54}{space 4}-.0314825{col 67}{space 3}  .026706
{txt}{space 9}F7. {c |}{col 14}{res}{space 2}-.0168234{col 26}{space 2} .0144413{col 37}{space 1}   -1.16{col 46}{space 3}0.244{col 54}{space 4}-.0451278{col 67}{space 3}  .011481
{txt}{space 9}F8. {c |}{col 14}{res}{space 2}-.0254675{col 26}{space 2}  .015771{col 37}{space 1}   -1.61{col 46}{space 3}0.106{col 54}{space 4}-.0563781{col 67}{space 3} .0054431
{txt}{space 9}F9. {c |}{col 14}{res}{space 2}-.0168313{col 26}{space 2} .0167993{col 37}{space 1}   -1.00{col 46}{space 3}0.316{col 54}{space 4}-.0497572{col 67}{space 3} .0160947
{txt}{space 8}F10. {c |}{col 14}{res}{space 2}-.0153133{col 26}{space 2} .0172554{col 37}{space 1}   -0.89{col 46}{space 3}0.375{col 54}{space 4}-.0491332{col 67}{space 3} .0185065
{txt}{space 8}F11. {c |}{col 14}{res}{space 2}-.0426611{col 26}{space 2} .0162281{col 37}{space 1}   -2.63{col 46}{space 3}0.009{col 54}{space 4}-.0744677{col 67}{space 3}-.0108545
{txt}{space 8}F12. {c |}{col 14}{res}{space 2}-.0412498{col 26}{space 2} .0164066{col 37}{space 1}   -2.51{col 46}{space 3}0.012{col 54}{space 4} -.073406{col 67}{space 3}-.0090935
{txt}{space 8}F13. {c |}{col 14}{res}{space 2}-.0109932{col 26}{space 2} .0156672{col 37}{space 1}   -0.70{col 46}{space 3}0.483{col 54}{space 4}-.0417004{col 67}{space 3} .0197139
{txt}{space 8}F14. {c |}{col 14}{res}{space 2}-.0126838{col 26}{space 2} .0144843{col 37}{space 1}   -0.88{col 46}{space 3}0.381{col 54}{space 4}-.0410725{col 67}{space 3} .0157049
{txt}{space 8}F15. {c |}{col 14}{res}{space 2}-.0141398{col 26}{space 2} .0147833{col 37}{space 1}   -0.96{col 46}{space 3}0.339{col 54}{space 4}-.0431145{col 67}{space 3}  .014835
{txt}{space 8}F16. {c |}{col 14}{res}{space 2}-.0129845{col 26}{space 2} .0137483{col 37}{space 1}   -0.94{col 46}{space 3}0.345{col 54}{space 4}-.0399306{col 67}{space 3} .0139617
{txt}{space 8}F17. {c |}{col 14}{res}{space 2}-.0118767{col 26}{space 2} .0132293{col 37}{space 1}   -0.90{col 46}{space 3}0.369{col 54}{space 4}-.0378056{col 67}{space 3} .0140522
{txt}{space 8}F18. {c |}{col 14}{res}{space 2}-.0186488{col 26}{space 2} .0129739{col 37}{space 1}   -1.44{col 46}{space 3}0.151{col 54}{space 4}-.0440772{col 67}{space 3} .0067795
{txt}{space 8}F19. {c |}{col 14}{res}{space 2}-.0160467{col 26}{space 2} .0132708{col 37}{space 1}   -1.21{col 46}{space 3}0.227{col 54}{space 4} -.042057{col 67}{space 3} .0099637
{txt}{space 8}F20. {c |}{col 14}{res}{space 2}-.0182938{col 26}{space 2} .0125949{col 37}{space 1}   -1.45{col 46}{space 3}0.146{col 54}{space 4}-.0429794{col 67}{space 3} .0063919
{txt}{space 8}F21. {c |}{col 14}{res}{space 2}-.0067059{col 26}{space 2} .0127548{col 37}{space 1}   -0.53{col 46}{space 3}0.599{col 54}{space 4}-.0317048{col 67}{space 3} .0182931
{txt}{space 8}F22. {c |}{col 14}{res}{space 2}-.0011373{col 26}{space 2} .0141506{col 37}{space 1}   -0.08{col 46}{space 3}0.936{col 54}{space 4} -.028872{col 67}{space 3} .0265974
{txt}{space 8}F23. {c |}{col 14}{res}{space 2}-.0245262{col 26}{space 2} .0145592{col 37}{space 1}   -1.68{col 46}{space 3}0.092{col 54}{space 4}-.0530618{col 67}{space 3} .0040093
{txt}{space 8}F24. {c |}{col 14}{res}{space 2}-.0104283{col 26}{space 2} .0149199{col 37}{space 1}   -0.70{col 46}{space 3}0.485{col 54}{space 4}-.0396706{col 67}{space 3} .0188141
{txt}{space 8}F25. {c |}{col 14}{res}{space 2} .0122388{col 26}{space 2} .0146589{col 37}{space 1}    0.83{col 46}{space 3}0.404{col 54}{space 4} -.016492{col 67}{space 3} .0409697
{txt}{space 8}F26. {c |}{col 14}{res}{space 2} .0146134{col 26}{space 2} .0148915{col 37}{space 1}    0.98{col 46}{space 3}0.326{col 54}{space 4}-.0145734{col 67}{space 3} .0438002
{txt}{space 8}F27. {c |}{col 14}{res}{space 2} .0024358{col 26}{space 2} .0129899{col 37}{space 1}    0.19{col 46}{space 3}0.851{col 54}{space 4}-.0230239{col 67}{space 3} .0278955
{txt}{space 8}F28. {c |}{col 14}{res}{space 2} .0095651{col 26}{space 2} .0136662{col 37}{space 1}    0.70{col 46}{space 3}0.484{col 54}{space 4}-.0172201{col 67}{space 3} .0363503
{txt}{space 8}F29. {c |}{col 14}{res}{space 2}  .016853{col 26}{space 2} .0137069{col 37}{space 1}    1.23{col 46}{space 3}0.219{col 54}{space 4}-.0100119{col 67}{space 3}  .043718
{txt}{space 8}F30. {c |}{col 14}{res}{space 2} .0139468{col 26}{space 2} .0145667{col 37}{space 1}    0.96{col 46}{space 3}0.338{col 54}{space 4}-.0146033{col 67}{space 3} .0424969
{txt}{space 8}F31. {c |}{col 14}{res}{space 2} .0150546{col 26}{space 2} .0154627{col 37}{space 1}    0.97{col 46}{space 3}0.330{col 54}{space 4}-.0152518{col 67}{space 3} .0453611
{txt}{space 8}F32. {c |}{col 14}{res}{space 2} .0047796{col 26}{space 2} .0147977{col 37}{space 1}    0.32{col 46}{space 3}0.747{col 54}{space 4}-.0242233{col 67}{space 3} .0337825
{txt}{space 8}F33. {c |}{col 14}{res}{space 2}-.0017073{col 26}{space 2} .0154474{col 37}{space 1}   -0.11{col 46}{space 3}0.912{col 54}{space 4}-.0319837{col 67}{space 3} .0285691
{txt}{space 8}F34. {c |}{col 14}{res}{space 2}-.0046839{col 26}{space 2}  .016364{col 37}{space 1}   -0.29{col 46}{space 3}0.775{col 54}{space 4}-.0367568{col 67}{space 3} .0273889
{txt}{space 8}F35. {c |}{col 14}{res}{space 2}-.0147507{col 26}{space 2} .0165896{col 37}{space 1}   -0.89{col 46}{space 3}0.374{col 54}{space 4}-.0472657{col 67}{space 3} .0177642
{txt}{space 8}F36. {c |}{col 14}{res}{space 2}-.0242607{col 26}{space 2}  .016498{col 37}{space 1}   -1.47{col 46}{space 3}0.141{col 54}{space 4}-.0565962{col 67}{space 3} .0080748
{txt}{space 8}F37. {c |}{col 14}{res}{space 2}-.0376792{col 26}{space 2} .0163459{col 37}{space 1}   -2.31{col 46}{space 3}0.021{col 54}{space 4}-.0697165{col 67}{space 3}-.0056419
{txt}{space 8}F38. {c |}{col 14}{res}{space 2}-.0305346{col 26}{space 2} .0153913{col 37}{space 1}   -1.98{col 46}{space 3}0.047{col 54}{space 4} -.060701{col 67}{space 3}-.0003682
{txt}{space 8}F39. {c |}{col 14}{res}{space 2}-.0342551{col 26}{space 2} .0149231{col 37}{space 1}   -2.30{col 46}{space 3}0.022{col 54}{space 4}-.0635038{col 67}{space 3}-.0050063
{txt}{space 8}F40. {c |}{col 14}{res}{space 2}-.0369034{col 26}{space 2}  .015505{col 37}{space 1}   -2.38{col 46}{space 3}0.017{col 54}{space 4}-.0672926{col 67}{space 3}-.0065141
{txt}{space 8}F41. {c |}{col 14}{res}{space 2} -.032139{col 26}{space 2} .0154745{col 37}{space 1}   -2.08{col 46}{space 3}0.038{col 54}{space 4}-.0624684{col 67}{space 3}-.0018096
{txt}{space 8}F42. {c |}{col 14}{res}{space 2}-.0297801{col 26}{space 2} .0154501{col 37}{space 1}   -1.93{col 46}{space 3}0.054{col 54}{space 4}-.0600619{col 67}{space 3} .0005016
{txt}{space 8}F43. {c |}{col 14}{res}{space 2}-.0334148{col 26}{space 2} .0168765{col 37}{space 1}   -1.98{col 46}{space 3}0.048{col 54}{space 4}-.0664922{col 67}{space 3}-.0003374
{txt}{space 8}F44. {c |}{col 14}{res}{space 2}-.0462841{col 26}{space 2} .0170157{col 37}{space 1}   -2.72{col 46}{space 3}0.007{col 54}{space 4}-.0796343{col 67}{space 3}-.0129339
{txt}{space 8}F45. {c |}{col 14}{res}{space 2}-.0373983{col 26}{space 2} .0173081{col 37}{space 1}   -2.16{col 46}{space 3}0.031{col 54}{space 4}-.0713216{col 67}{space 3} -.003475
{txt}{space 8}F46. {c |}{col 14}{res}{space 2}-.0274242{col 26}{space 2} .0181836{col 37}{space 1}   -1.51{col 46}{space 3}0.132{col 54}{space 4}-.0630634{col 67}{space 3} .0082151
{txt}{space 8}F47. {c |}{col 14}{res}{space 2}-.0226437{col 26}{space 2} .0181548{col 37}{space 1}   -1.25{col 46}{space 3}0.212{col 54}{space 4}-.0582265{col 67}{space 3} .0129391
{txt}{space 8}F48. {c |}{col 14}{res}{space 2}-.0318031{col 26}{space 2} .0185742{col 37}{space 1}   -1.71{col 46}{space 3}0.087{col 54}{space 4}-.0682078{col 67}{space 3} .0046016
{txt}{space 12} {c |}
{space 8}ldem {c |}
{space 9}F1. {c |}{col 14}{res}{space 2} .0229185{col 26}{space 2} .0064968{col 37}{space 1}    3.53{col 46}{space 3}0.000{col 54}{space 4} .0101851{col 67}{space 3} .0356519
{txt}{space 9}F2. {c |}{col 14}{res}{space 2} .0361475{col 26}{space 2} .0093631{col 37}{space 1}    3.86{col 46}{space 3}0.000{col 54}{space 4} .0177961{col 67}{space 3} .0544988
{txt}{space 9}F3. {c |}{col 14}{res}{space 2} .0551467{col 26}{space 2} .0130568{col 37}{space 1}    4.22{col 46}{space 3}0.000{col 54}{space 4} .0295559{col 67}{space 3} .0807376
{txt}{space 9}F4. {c |}{col 14}{res}{space 2} .0596056{col 26}{space 2}  .014453{col 37}{space 1}    4.12{col 46}{space 3}0.000{col 54}{space 4} .0312783{col 67}{space 3} .0879329
{txt}{space 9}F5. {c |}{col 14}{res}{space 2} .0482406{col 26}{space 2}  .016917{col 37}{space 1}    2.85{col 46}{space 3}0.004{col 54}{space 4} .0150839{col 67}{space 3} .0813973
{txt}{space 9}F6. {c |}{col 14}{res}{space 2} .0261639{col 26}{space 2} .0194368{col 37}{space 1}    1.35{col 46}{space 3}0.178{col 54}{space 4}-.0119316{col 67}{space 3} .0642593
{txt}{space 9}F7. {c |}{col 14}{res}{space 2} .0157703{col 26}{space 2} .0201046{col 37}{space 1}    0.78{col 46}{space 3}0.433{col 54}{space 4}-.0236339{col 67}{space 3} .0551745
{txt}{space 9}F8. {c |}{col 14}{res}{space 2}-.0062569{col 26}{space 2} .0211992{col 37}{space 1}   -0.30{col 46}{space 3}0.768{col 54}{space 4}-.0478065{col 67}{space 3} .0352927
{txt}{space 9}F9. {c |}{col 14}{res}{space 2}-.0115381{col 26}{space 2} .0225068{col 37}{space 1}   -0.51{col 46}{space 3}0.608{col 54}{space 4}-.0556506{col 67}{space 3} .0325744
{txt}{space 8}F10. {c |}{col 14}{res}{space 2} -.016903{col 26}{space 2} .0229836{col 37}{space 1}   -0.74{col 46}{space 3}0.462{col 54}{space 4}  -.06195{col 67}{space 3}  .028144
{txt}{space 8}F11. {c |}{col 14}{res}{space 2}-.0174367{col 26}{space 2} .0225497{col 37}{space 1}   -0.77{col 46}{space 3}0.439{col 54}{space 4}-.0616332{col 67}{space 3} .0267598
{txt}{space 8}F12. {c |}{col 14}{res}{space 2}-.0183244{col 26}{space 2} .0228272{col 37}{space 1}   -0.80{col 46}{space 3}0.422{col 54}{space 4}-.0630648{col 67}{space 3} .0264161
{txt}{space 8}F13. {c |}{col 14}{res}{space 2}-.0169214{col 26}{space 2} .0222881{col 37}{space 1}   -0.76{col 46}{space 3}0.448{col 54}{space 4}-.0606052{col 67}{space 3} .0267624
{txt}{space 8}F14. {c |}{col 14}{res}{space 2}-.0166759{col 26}{space 2} .0222032{col 37}{space 1}   -0.75{col 46}{space 3}0.453{col 54}{space 4}-.0601934{col 67}{space 3} .0268416
{txt}{space 8}F15. {c |}{col 14}{res}{space 2}-.0270606{col 26}{space 2} .0220921{col 37}{space 1}   -1.22{col 46}{space 3}0.221{col 54}{space 4}-.0703603{col 67}{space 3} .0162392
{txt}{space 8}F16. {c |}{col 14}{res}{space 2}-.0216806{col 26}{space 2} .0236303{col 37}{space 1}   -0.92{col 46}{space 3}0.359{col 54}{space 4}-.0679951{col 67}{space 3} .0246339
{txt}{space 8}F17. {c |}{col 14}{res}{space 2}-.0207023{col 26}{space 2} .0233685{col 37}{space 1}   -0.89{col 46}{space 3}0.376{col 54}{space 4}-.0665037{col 67}{space 3} .0250991
{txt}{space 8}F18. {c |}{col 14}{res}{space 2}-.0053528{col 26}{space 2} .0228147{col 37}{space 1}   -0.23{col 46}{space 3}0.815{col 54}{space 4}-.0500688{col 67}{space 3} .0393633
{txt}{space 8}F19. {c |}{col 14}{res}{space 2} .0045592{col 26}{space 2} .0232285{col 37}{space 1}    0.20{col 46}{space 3}0.844{col 54}{space 4}-.0409679{col 67}{space 3} .0500863
{txt}{space 8}F20. {c |}{col 14}{res}{space 2} .0215173{col 26}{space 2} .0238017{col 37}{space 1}    0.90{col 46}{space 3}0.366{col 54}{space 4}-.0251331{col 67}{space 3} .0681678
{txt}{space 8}F21. {c |}{col 14}{res}{space 2} .0312246{col 26}{space 2} .0240958{col 37}{space 1}    1.30{col 46}{space 3}0.195{col 54}{space 4}-.0160024{col 67}{space 3} .0784516
{txt}{space 8}F22. {c |}{col 14}{res}{space 2} .0535299{col 26}{space 2}  .025507{col 37}{space 1}    2.10{col 46}{space 3}0.036{col 54}{space 4} .0035371{col 67}{space 3} .1035228
{txt}{space 8}F23. {c |}{col 14}{res}{space 2} .0643739{col 26}{space 2} .0262751{col 37}{space 1}    2.45{col 46}{space 3}0.014{col 54}{space 4} .0128756{col 67}{space 3} .1158722
{txt}{space 8}F24. {c |}{col 14}{res}{space 2} .0716954{col 26}{space 2} .0279064{col 37}{space 1}    2.57{col 46}{space 3}0.010{col 54}{space 4} .0169998{col 67}{space 3}  .126391
{txt}{space 8}F25. {c |}{col 14}{res}{space 2}  .066037{col 26}{space 2} .0277087{col 37}{space 1}    2.38{col 46}{space 3}0.017{col 54}{space 4} .0117289{col 67}{space 3} .1203451
{txt}{space 8}F26. {c |}{col 14}{res}{space 2} .0680486{col 26}{space 2} .0273263{col 37}{space 1}    2.49{col 46}{space 3}0.013{col 54}{space 4} .0144902{col 67}{space 3} .1216071
{txt}{space 8}F27. {c |}{col 14}{res}{space 2} .0481204{col 26}{space 2}  .027024{col 37}{space 1}    1.78{col 46}{space 3}0.075{col 54}{space 4}-.0048456{col 67}{space 3} .1010864
{txt}{space 8}F28. {c |}{col 14}{res}{space 2} .0623984{col 26}{space 2} .0269494{col 37}{space 1}    2.32{col 46}{space 3}0.021{col 54}{space 4} .0095784{col 67}{space 3} .1152183
{txt}{space 8}F29. {c |}{col 14}{res}{space 2} .0465302{col 26}{space 2} .0268878{col 37}{space 1}    1.73{col 46}{space 3}0.084{col 54}{space 4}-.0061688{col 67}{space 3} .0992292
{txt}{space 8}F30. {c |}{col 14}{res}{space 2} .0518982{col 26}{space 2} .0265643{col 37}{space 1}    1.95{col 46}{space 3}0.051{col 54}{space 4}-.0001668{col 67}{space 3} .1039632
{txt}{space 8}F31. {c |}{col 14}{res}{space 2} .0454896{col 26}{space 2} .0248521{col 37}{space 1}    1.83{col 46}{space 3}0.067{col 54}{space 4}-.0032196{col 67}{space 3} .0941987
{txt}{space 8}F32. {c |}{col 14}{res}{space 2} .0300406{col 26}{space 2} .0246851{col 37}{space 1}    1.22{col 46}{space 3}0.224{col 54}{space 4}-.0183414{col 67}{space 3} .0784226
{txt}{space 8}F33. {c |}{col 14}{res}{space 2} .0139453{col 26}{space 2} .0237568{col 37}{space 1}    0.59{col 46}{space 3}0.557{col 54}{space 4}-.0326171{col 67}{space 3} .0605077
{txt}{space 8}F34. {c |}{col 14}{res}{space 2} .0034439{col 26}{space 2} .0226141{col 37}{space 1}    0.15{col 46}{space 3}0.879{col 54}{space 4}-.0408789{col 67}{space 3} .0477667
{txt}{space 8}F35. {c |}{col 14}{res}{space 2}-.0152319{col 26}{space 2} .0217978{col 37}{space 1}   -0.70{col 46}{space 3}0.485{col 54}{space 4}-.0579549{col 67}{space 3}  .027491
{txt}{space 8}F36. {c |}{col 14}{res}{space 2}-.0312678{col 26}{space 2} .0215412{col 37}{space 1}   -1.45{col 46}{space 3}0.147{col 54}{space 4}-.0734877{col 67}{space 3} .0109521
{txt}{space 8}F37. {c |}{col 14}{res}{space 2}-.0473031{col 26}{space 2} .0208319{col 37}{space 1}   -2.27{col 46}{space 3}0.023{col 54}{space 4}-.0881328{col 67}{space 3}-.0064734
{txt}{space 8}F38. {c |}{col 14}{res}{space 2} -.052007{col 26}{space 2} .0200182{col 37}{space 1}   -2.60{col 46}{space 3}0.009{col 54}{space 4} -.091242{col 67}{space 3} -.012772
{txt}{space 8}F39. {c |}{col 14}{res}{space 2}-.0499729{col 26}{space 2} .0190719{col 37}{space 1}   -2.62{col 46}{space 3}0.009{col 54}{space 4}-.0873531{col 67}{space 3}-.0125926
{txt}{space 8}F40. {c |}{col 14}{res}{space 2}-.0595644{col 26}{space 2} .0197442{col 37}{space 1}   -3.02{col 46}{space 3}0.003{col 54}{space 4}-.0982623{col 67}{space 3}-.0208665
{txt}{space 8}F41. {c |}{col 14}{res}{space 2}-.0512516{col 26}{space 2} .0188916{col 37}{space 1}   -2.71{col 46}{space 3}0.007{col 54}{space 4}-.0882784{col 67}{space 3}-.0142248
{txt}{space 8}F42. {c |}{col 14}{res}{space 2}-.0464976{col 26}{space 2} .0185218{col 37}{space 1}   -2.51{col 46}{space 3}0.012{col 54}{space 4}-.0827996{col 67}{space 3}-.0101955
{txt}{space 8}F43. {c |}{col 14}{res}{space 2}-.0426282{col 26}{space 2} .0176357{col 37}{space 1}   -2.42{col 46}{space 3}0.016{col 54}{space 4}-.0771935{col 67}{space 3}-.0080628
{txt}{space 8}F44. {c |}{col 14}{res}{space 2}-.0344794{col 26}{space 2} .0174984{col 37}{space 1}   -1.97{col 46}{space 3}0.049{col 54}{space 4}-.0687755{col 67}{space 3}-.0001832
{txt}{space 8}F45. {c |}{col 14}{res}{space 2}-.0199213{col 26}{space 2} .0173862{col 37}{space 1}   -1.15{col 46}{space 3}0.252{col 54}{space 4}-.0539977{col 67}{space 3}  .014155
{txt}{space 8}F46. {c |}{col 14}{res}{space 2}-.0172028{col 26}{space 2} .0162545{col 37}{space 1}   -1.06{col 46}{space 3}0.290{col 54}{space 4} -.049061{col 67}{space 3} .0146553
{txt}{space 8}F47. {c |}{col 14}{res}{space 2}-.0034282{col 26}{space 2} .0163909{col 37}{space 1}   -0.21{col 46}{space 3}0.834{col 54}{space 4}-.0355538{col 67}{space 3} .0286973
{txt}{space 8}F48. {c |}{col 14}{res}{space 2}-.0064113{col 26}{space 2} .0160682{col 37}{space 1}   -0.40{col 46}{space 3}0.690{col 54}{space 4}-.0379043{col 67}{space 3} .0250818
{txt}{space 12} {c |}
{space 8}lrpo {c |}
{space 9}F1. {c |}{col 14}{res}{space 2}  1.19312{col 26}{space 2} .0777059{col 37}{space 1}   15.35{col 46}{space 3}0.000{col 54}{space 4} 1.040819{col 67}{space 3} 1.345421
{txt}{space 9}F2. {c |}{col 14}{res}{space 2} 1.317329{col 26}{space 2} .1244779{col 37}{space 1}   10.58{col 46}{space 3}0.000{col 54}{space 4} 1.073356{col 67}{space 3} 1.561301
{txt}{space 9}F3. {c |}{col 14}{res}{space 2} 1.127359{col 26}{space 2} .1583148{col 37}{space 1}    7.12{col 46}{space 3}0.000{col 54}{space 4} .8170676{col 67}{space 3}  1.43765
{txt}{space 9}F4. {c |}{col 14}{res}{space 2} 1.008175{col 26}{space 2}  .179093{col 37}{space 1}    5.63{col 46}{space 3}0.000{col 54}{space 4} .6571588{col 67}{space 3}  1.35919
{txt}{space 9}F5. {c |}{col 14}{res}{space 2} .8812843{col 26}{space 2} .1894935{col 37}{space 1}    4.65{col 46}{space 3}0.000{col 54}{space 4} .5098839{col 67}{space 3} 1.252685
{txt}{space 9}F6. {c |}{col 14}{res}{space 2} .5853649{col 26}{space 2} .1862204{col 37}{space 1}    3.14{col 46}{space 3}0.002{col 54}{space 4} .2203796{col 67}{space 3} .9503502
{txt}{space 9}F7. {c |}{col 14}{res}{space 2} .5044248{col 26}{space 2} .1822082{col 37}{space 1}    2.77{col 46}{space 3}0.006{col 54}{space 4} .1473032{col 67}{space 3} .8615463
{txt}{space 9}F8. {c |}{col 14}{res}{space 2} .4956237{col 26}{space 2} .1812766{col 37}{space 1}    2.73{col 46}{space 3}0.006{col 54}{space 4} .1403282{col 67}{space 3} .8509192
{txt}{space 9}F9. {c |}{col 14}{res}{space 2} .4096491{col 26}{space 2} .1752823{col 37}{space 1}    2.34{col 46}{space 3}0.019{col 54}{space 4}  .066102{col 67}{space 3} .7531961
{txt}{space 8}F10. {c |}{col 14}{res}{space 2} .3479601{col 26}{space 2} .1612621{col 37}{space 1}    2.16{col 46}{space 3}0.031{col 54}{space 4} .0318921{col 67}{space 3}  .664028
{txt}{space 8}F11. {c |}{col 14}{res}{space 2} .3396816{col 26}{space 2} .1557056{col 37}{space 1}    2.18{col 46}{space 3}0.029{col 54}{space 4} .0345041{col 67}{space 3}  .644859
{txt}{space 8}F12. {c |}{col 14}{res}{space 2} .5161203{col 26}{space 2}  .179377{col 37}{space 1}    2.88{col 46}{space 3}0.004{col 54}{space 4} .1645478{col 67}{space 3} .8676929
{txt}{space 8}F13. {c |}{col 14}{res}{space 2} .4504903{col 26}{space 2} .2185308{col 37}{space 1}    2.06{col 46}{space 3}0.039{col 54}{space 4} .0221778{col 67}{space 3} .8788028
{txt}{space 8}F14. {c |}{col 14}{res}{space 2} .3440796{col 26}{space 2} .2426065{col 37}{space 1}    1.42{col 46}{space 3}0.156{col 54}{space 4}-.1314205{col 67}{space 3} .8195796
{txt}{space 8}F15. {c |}{col 14}{res}{space 2} .1548365{col 26}{space 2} .2712285{col 37}{space 1}    0.57{col 46}{space 3}0.568{col 54}{space 4}-.3767616{col 67}{space 3} .6864346
{txt}{space 8}F16. {c |}{col 14}{res}{space 2} .1460826{col 26}{space 2}    .2623{col 37}{space 1}    0.56{col 46}{space 3}0.578{col 54}{space 4}-.3680159{col 67}{space 3} .6601811
{txt}{space 8}F17. {c |}{col 14}{res}{space 2} .1198075{col 26}{space 2} .2663839{col 37}{space 1}    0.45{col 46}{space 3}0.653{col 54}{space 4}-.4022953{col 67}{space 3} .6419103
{txt}{space 8}F18. {c |}{col 14}{res}{space 2} .2330533{col 26}{space 2} .2465494{col 37}{space 1}    0.95{col 46}{space 3}0.345{col 54}{space 4}-.2501748{col 67}{space 3} .7162813
{txt}{space 8}F19. {c |}{col 14}{res}{space 2} .3908747{col 26}{space 2} .2324778{col 37}{space 1}    1.68{col 46}{space 3}0.093{col 54}{space 4}-.0647735{col 67}{space 3} .8465229
{txt}{space 8}F20. {c |}{col 14}{res}{space 2} .5157365{col 26}{space 2} .2304365{col 37}{space 1}    2.24{col 46}{space 3}0.025{col 54}{space 4} .0640893{col 67}{space 3} .9673837
{txt}{space 8}F21. {c |}{col 14}{res}{space 2} .8269299{col 26}{space 2} .2208634{col 37}{space 1}    3.74{col 46}{space 3}0.000{col 54}{space 4} .3940457{col 67}{space 3} 1.259814
{txt}{space 8}F22. {c |}{col 14}{res}{space 2} .9695149{col 26}{space 2} .2320409{col 37}{space 1}    4.18{col 46}{space 3}0.000{col 54}{space 4} .5147231{col 67}{space 3} 1.424307
{txt}{space 8}F23. {c |}{col 14}{res}{space 2} .9807949{col 26}{space 2} .2626151{col 37}{space 1}    3.73{col 46}{space 3}0.000{col 54}{space 4} .4660788{col 67}{space 3} 1.495511
{txt}{space 8}F24. {c |}{col 14}{res}{space 2} .7187573{col 26}{space 2} .2797182{col 37}{space 1}    2.57{col 46}{space 3}0.010{col 54}{space 4} .1705197{col 67}{space 3} 1.266995
{txt}{space 8}F25. {c |}{col 14}{res}{space 2} .7501919{col 26}{space 2} .3052282{col 37}{space 1}    2.46{col 46}{space 3}0.014{col 54}{space 4} .1519556{col 67}{space 3} 1.348428
{txt}{space 8}F26. {c |}{col 14}{res}{space 2} .4260231{col 26}{space 2} .3114455{col 37}{space 1}    1.37{col 46}{space 3}0.171{col 54}{space 4}-.1843989{col 67}{space 3} 1.036445
{txt}{space 8}F27. {c |}{col 14}{res}{space 2} .3907294{col 26}{space 2} .3049394{col 37}{space 1}    1.28{col 46}{space 3}0.200{col 54}{space 4}-.2069409{col 67}{space 3} .9883996
{txt}{space 8}F28. {c |}{col 14}{res}{space 2} .2681762{col 26}{space 2} .3059735{col 37}{space 1}    0.88{col 46}{space 3}0.381{col 54}{space 4}-.3315207{col 67}{space 3} .8678732
{txt}{space 8}F29. {c |}{col 14}{res}{space 2} .3143758{col 26}{space 2} .3122043{col 37}{space 1}    1.01{col 46}{space 3}0.314{col 54}{space 4}-.2975334{col 67}{space 3} .9262851
{txt}{space 8}F30. {c |}{col 14}{res}{space 2}  .419161{col 26}{space 2} .3219842{col 37}{space 1}    1.30{col 46}{space 3}0.193{col 54}{space 4}-.2119163{col 67}{space 3} 1.050238
{txt}{space 8}F31. {c |}{col 14}{res}{space 2} .3174228{col 26}{space 2} .3335019{col 37}{space 1}    0.95{col 46}{space 3}0.341{col 54}{space 4}-.3362289{col 67}{space 3} .9710744
{txt}{space 8}F32. {c |}{col 14}{res}{space 2} .2915537{col 26}{space 2}   .33253{col 37}{space 1}    0.88{col 46}{space 3}0.381{col 54}{space 4}-.3601931{col 67}{space 3} .9433006
{txt}{space 8}F33. {c |}{col 14}{res}{space 2} .3308172{col 26}{space 2} .3342383{col 37}{space 1}    0.99{col 46}{space 3}0.322{col 54}{space 4}-.3242779{col 67}{space 3} .9859123
{txt}{space 8}F34. {c |}{col 14}{res}{space 2}  .418731{col 26}{space 2} .3290324{col 37}{space 1}    1.27{col 46}{space 3}0.203{col 54}{space 4}-.2261607{col 67}{space 3} 1.063623
{txt}{space 8}F35. {c |}{col 14}{res}{space 2} .1890836{col 26}{space 2} .3242983{col 37}{space 1}    0.58{col 46}{space 3}0.560{col 54}{space 4}-.4465293{col 67}{space 3} .8246965
{txt}{space 8}F36. {c |}{col 14}{res}{space 2}-.0888121{col 26}{space 2}  .314043{col 37}{space 1}   -0.28{col 46}{space 3}0.777{col 54}{space 4} -.704325{col 67}{space 3} .5267009
{txt}{space 8}F37. {c |}{col 14}{res}{space 2}-.2593667{col 26}{space 2} .2942022{col 37}{space 1}   -0.88{col 46}{space 3}0.378{col 54}{space 4}-.8359924{col 67}{space 3}  .317259
{txt}{space 8}F38. {c |}{col 14}{res}{space 2}-.4163635{col 26}{space 2} .2850924{col 37}{space 1}   -1.46{col 46}{space 3}0.144{col 54}{space 4}-.9751344{col 67}{space 3} .1424074
{txt}{space 8}F39. {c |}{col 14}{res}{space 2}-.6555835{col 26}{space 2} .2818467{col 37}{space 1}   -2.33{col 46}{space 3}0.020{col 54}{space 4}-1.207993{col 67}{space 3}-.1031741
{txt}{space 8}F40. {c |}{col 14}{res}{space 2}-.5455146{col 26}{space 2} .2714896{col 37}{space 1}   -2.01{col 46}{space 3}0.045{col 54}{space 4}-1.077624{col 67}{space 3}-.0134047
{txt}{space 8}F41. {c |}{col 14}{res}{space 2}-.3809725{col 26}{space 2} .2750155{col 37}{space 1}   -1.39{col 46}{space 3}0.166{col 54}{space 4} -.919993{col 67}{space 3} .1580479
{txt}{space 8}F42. {c |}{col 14}{res}{space 2}-.2552248{col 26}{space 2}  .275776{col 37}{space 1}   -0.93{col 46}{space 3}0.355{col 54}{space 4}-.7957357{col 67}{space 3} .2852861
{txt}{space 8}F43. {c |}{col 14}{res}{space 2}-.0225553{col 26}{space 2} .2655572{col 37}{space 1}   -0.08{col 46}{space 3}0.932{col 54}{space 4}-.5430379{col 67}{space 3} .4979273
{txt}{space 8}F44. {c |}{col 14}{res}{space 2} .1089227{col 26}{space 2} .2657687{col 37}{space 1}    0.41{col 46}{space 3}0.682{col 54}{space 4}-.4119743{col 67}{space 3} .6298197
{txt}{space 8}F45. {c |}{col 14}{res}{space 2}-.0125055{col 26}{space 2} .2611542{col 37}{space 1}   -0.05{col 46}{space 3}0.962{col 54}{space 4}-.5243583{col 67}{space 3} .4993474
{txt}{space 8}F46. {c |}{col 14}{res}{space 2}  .119751{col 26}{space 2}  .277105{col 37}{space 1}    0.43{col 46}{space 3}0.666{col 54}{space 4}-.4233648{col 67}{space 3} .6628669
{txt}{space 8}F47. {c |}{col 14}{res}{space 2}  .198677{col 26}{space 2} .2763498{col 37}{space 1}    0.72{col 46}{space 3}0.472{col 54}{space 4}-.3429587{col 67}{space 3} .7403127
{txt}{space 8}F48. {c |}{col 14}{res}{space 2} .2940614{col 26}{space 2} .2813938{col 37}{space 1}    1.05{col 46}{space 3}0.296{col 54}{space 4}-.2574602{col 67}{space 3} .8455831
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}e1           {txt}{c |}
{space 8}lpro {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .0009814{col 26}{space 2} .0004433{col 37}{space 1}    2.21{col 46}{space 3}0.027{col 54}{space 4} .0001126{col 67}{space 3} .0018502
{txt}{space 9}F1. {c |}{col 14}{res}{space 2}  .000921{col 26}{space 2} .0006442{col 37}{space 1}    1.43{col 46}{space 3}0.153{col 54}{space 4}-.0003416{col 67}{space 3} .0021836
{txt}{space 9}F2. {c |}{col 14}{res}{space 2} .0000361{col 26}{space 2} .0007066{col 37}{space 1}    0.05{col 46}{space 3}0.959{col 54}{space 4}-.0013489{col 67}{space 3} .0014211
{txt}{space 9}F3. {c |}{col 14}{res}{space 2}-.0002022{col 26}{space 2} .0007374{col 37}{space 1}   -0.27{col 46}{space 3}0.784{col 54}{space 4}-.0016475{col 67}{space 3}  .001243
{txt}{space 9}F4. {c |}{col 14}{res}{space 2}-.0012388{col 26}{space 2} .0008145{col 37}{space 1}   -1.52{col 46}{space 3}0.128{col 54}{space 4}-.0028351{col 67}{space 3} .0003575
{txt}{space 9}F5. {c |}{col 14}{res}{space 2}-.0009066{col 26}{space 2} .0008097{col 37}{space 1}   -1.12{col 46}{space 3}0.263{col 54}{space 4}-.0024935{col 67}{space 3} .0006803
{txt}{space 9}F6. {c |}{col 14}{res}{space 2}-.0003546{col 26}{space 2} .0009655{col 37}{space 1}   -0.37{col 46}{space 3}0.713{col 54}{space 4}-.0022471{col 67}{space 3} .0015378
{txt}{space 9}F7. {c |}{col 14}{res}{space 2}-5.25e-06{col 26}{space 2} .0008787{col 37}{space 1}   -0.01{col 46}{space 3}0.995{col 54}{space 4}-.0017274{col 67}{space 3} .0017169
{txt}{space 9}F8. {c |}{col 14}{res}{space 2}-.0007282{col 26}{space 2} .0010086{col 37}{space 1}   -0.72{col 46}{space 3}0.470{col 54}{space 4}-.0027049{col 67}{space 3} .0012486
{txt}{space 9}F9. {c |}{col 14}{res}{space 2}-.0001338{col 26}{space 2}  .000998{col 37}{space 1}   -0.13{col 46}{space 3}0.893{col 54}{space 4}-.0020898{col 67}{space 3} .0018222
{txt}{space 8}F10. {c |}{col 14}{res}{space 2}-.0003013{col 26}{space 2}  .000924{col 37}{space 1}   -0.33{col 46}{space 3}0.744{col 54}{space 4}-.0021123{col 67}{space 3} .0015098
{txt}{space 8}F11. {c |}{col 14}{res}{space 2}-.0001856{col 26}{space 2} .0009772{col 37}{space 1}   -0.19{col 46}{space 3}0.849{col 54}{space 4}-.0021009{col 67}{space 3} .0017296
{txt}{space 8}F12. {c |}{col 14}{res}{space 2} .0005152{col 26}{space 2} .0009526{col 37}{space 1}    0.54{col 46}{space 3}0.589{col 54}{space 4}-.0013518{col 67}{space 3} .0023821
{txt}{space 8}F13. {c |}{col 14}{res}{space 2} .0008212{col 26}{space 2} .0009949{col 37}{space 1}    0.83{col 46}{space 3}0.409{col 54}{space 4}-.0011288{col 67}{space 3} .0027713
{txt}{space 8}F14. {c |}{col 14}{res}{space 2} .0006319{col 26}{space 2} .0009739{col 37}{space 1}    0.65{col 46}{space 3}0.516{col 54}{space 4} -.001277{col 67}{space 3} .0025408
{txt}{space 8}F15. {c |}{col 14}{res}{space 2} .0009731{col 26}{space 2} .0008853{col 37}{space 1}    1.10{col 46}{space 3}0.272{col 54}{space 4}-.0007621{col 67}{space 3} .0027083
{txt}{space 8}F16. {c |}{col 14}{res}{space 2} .0009316{col 26}{space 2} .0009641{col 37}{space 1}    0.97{col 46}{space 3}0.334{col 54}{space 4} -.000958{col 67}{space 3} .0028213
{txt}{space 8}F17. {c |}{col 14}{res}{space 2} .0007686{col 26}{space 2} .0009957{col 37}{space 1}    0.77{col 46}{space 3}0.440{col 54}{space 4} -.001183{col 67}{space 3} .0027202
{txt}{space 8}F18. {c |}{col 14}{res}{space 2} .0002739{col 26}{space 2} .0009081{col 37}{space 1}    0.30{col 46}{space 3}0.763{col 54}{space 4} -.001506{col 67}{space 3} .0020538
{txt}{space 8}F19. {c |}{col 14}{res}{space 2} .0004821{col 26}{space 2} .0009125{col 37}{space 1}    0.53{col 46}{space 3}0.597{col 54}{space 4}-.0013063{col 67}{space 3} .0022704
{txt}{space 8}F20. {c |}{col 14}{res}{space 2} .0014487{col 26}{space 2} .0010236{col 37}{space 1}    1.42{col 46}{space 3}0.157{col 54}{space 4}-.0005575{col 67}{space 3} .0034549
{txt}{space 8}F21. {c |}{col 14}{res}{space 2} .0009527{col 26}{space 2}   .00094{col 37}{space 1}    1.01{col 46}{space 3}0.311{col 54}{space 4}-.0008897{col 67}{space 3} .0027951
{txt}{space 8}F22. {c |}{col 14}{res}{space 2} .0007052{col 26}{space 2}  .000864{col 37}{space 1}    0.82{col 46}{space 3}0.414{col 54}{space 4}-.0009882{col 67}{space 3} .0023987
{txt}{space 8}F23. {c |}{col 14}{res}{space 2} .0011727{col 26}{space 2} .0009326{col 37}{space 1}    1.26{col 46}{space 3}0.209{col 54}{space 4}-.0006552{col 67}{space 3} .0030007
{txt}{space 8}F24. {c |}{col 14}{res}{space 2} .0014681{col 26}{space 2} .0010011{col 37}{space 1}    1.47{col 46}{space 3}0.143{col 54}{space 4}-.0004941{col 67}{space 3} .0034303
{txt}{space 8}F25. {c |}{col 14}{res}{space 2} .0011328{col 26}{space 2} .0009843{col 37}{space 1}    1.15{col 46}{space 3}0.250{col 54}{space 4}-.0007964{col 67}{space 3}  .003062
{txt}{space 8}F26. {c |}{col 14}{res}{space 2} .0002073{col 26}{space 2} .0009251{col 37}{space 1}    0.22{col 46}{space 3}0.823{col 54}{space 4}-.0016058{col 67}{space 3} .0020205
{txt}{space 8}F27. {c |}{col 14}{res}{space 2} .0004102{col 26}{space 2} .0008165{col 37}{space 1}    0.50{col 46}{space 3}0.615{col 54}{space 4}-.0011901{col 67}{space 3} .0020105
{txt}{space 8}F28. {c |}{col 14}{res}{space 2}-.0000377{col 26}{space 2} .0007914{col 37}{space 1}   -0.05{col 46}{space 3}0.962{col 54}{space 4}-.0015888{col 67}{space 3} .0015133
{txt}{space 8}F29. {c |}{col 14}{res}{space 2} .0001896{col 26}{space 2} .0008275{col 37}{space 1}    0.23{col 46}{space 3}0.819{col 54}{space 4}-.0014322{col 67}{space 3} .0018114
{txt}{space 8}F30. {c |}{col 14}{res}{space 2} .0005338{col 26}{space 2} .0009283{col 37}{space 1}    0.58{col 46}{space 3}0.565{col 54}{space 4}-.0012856{col 67}{space 3} .0023532
{txt}{space 8}F31. {c |}{col 14}{res}{space 2}-.0000477{col 26}{space 2} .0009847{col 37}{space 1}   -0.05{col 46}{space 3}0.961{col 54}{space 4}-.0019777{col 67}{space 3} .0018824
{txt}{space 8}F32. {c |}{col 14}{res}{space 2}-.0003557{col 26}{space 2} .0010033{col 37}{space 1}   -0.35{col 46}{space 3}0.723{col 54}{space 4}-.0023221{col 67}{space 3} .0016107
{txt}{space 8}F33. {c |}{col 14}{res}{space 2}-.0004321{col 26}{space 2} .0009355{col 37}{space 1}   -0.46{col 46}{space 3}0.644{col 54}{space 4}-.0022657{col 67}{space 3} .0014015
{txt}{space 8}F34. {c |}{col 14}{res}{space 2}-.0014322{col 26}{space 2} .0009821{col 37}{space 1}   -1.46{col 46}{space 3}0.145{col 54}{space 4} -.003357{col 67}{space 3} .0004926
{txt}{space 8}F35. {c |}{col 14}{res}{space 2}-.0003165{col 26}{space 2}   .00117{col 37}{space 1}   -0.27{col 46}{space 3}0.787{col 54}{space 4}-.0026097{col 67}{space 3} .0019767
{txt}{space 8}F36. {c |}{col 14}{res}{space 2} .0004551{col 26}{space 2}  .001282{col 37}{space 1}    0.35{col 46}{space 3}0.723{col 54}{space 4}-.0020577{col 67}{space 3} .0029678
{txt}{space 8}F37. {c |}{col 14}{res}{space 2} .0003783{col 26}{space 2}  .001285{col 37}{space 1}    0.29{col 46}{space 3}0.768{col 54}{space 4}-.0021404{col 67}{space 3} .0028969
{txt}{space 8}F38. {c |}{col 14}{res}{space 2}-.0001218{col 26}{space 2} .0012436{col 37}{space 1}   -0.10{col 46}{space 3}0.922{col 54}{space 4}-.0025593{col 67}{space 3} .0023157
{txt}{space 8}F39. {c |}{col 14}{res}{space 2} .0002326{col 26}{space 2} .0012947{col 37}{space 1}    0.18{col 46}{space 3}0.857{col 54}{space 4} -.002305{col 67}{space 3} .0027701
{txt}{space 8}F40. {c |}{col 14}{res}{space 2} 2.47e-07{col 26}{space 2} .0012849{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4}-.0025182{col 67}{space 3} .0025186
{txt}{space 8}F41. {c |}{col 14}{res}{space 2}-.0005172{col 26}{space 2} .0013099{col 37}{space 1}   -0.39{col 46}{space 3}0.693{col 54}{space 4}-.0030847{col 67}{space 3} .0020502
{txt}{space 8}F42. {c |}{col 14}{res}{space 2}  .000825{col 26}{space 2} .0012792{col 37}{space 1}    0.64{col 46}{space 3}0.519{col 54}{space 4}-.0016821{col 67}{space 3} .0033321
{txt}{space 8}F43. {c |}{col 14}{res}{space 2} .0012161{col 26}{space 2} .0012053{col 37}{space 1}    1.01{col 46}{space 3}0.313{col 54}{space 4}-.0011462{col 67}{space 3} .0035785
{txt}{space 8}F44. {c |}{col 14}{res}{space 2} .0013684{col 26}{space 2}  .001325{col 37}{space 1}    1.03{col 46}{space 3}0.302{col 54}{space 4}-.0012285{col 67}{space 3} .0039654
{txt}{space 8}F45. {c |}{col 14}{res}{space 2}   .00038{col 26}{space 2} .0012593{col 37}{space 1}    0.30{col 46}{space 3}0.763{col 54}{space 4}-.0020882{col 67}{space 3} .0028481
{txt}{space 8}F46. {c |}{col 14}{res}{space 2} .0001707{col 26}{space 2} .0012201{col 37}{space 1}    0.14{col 46}{space 3}0.889{col 54}{space 4}-.0022206{col 67}{space 3}  .002562
{txt}{space 8}F47. {c |}{col 14}{res}{space 2} .0008782{col 26}{space 2} .0012055{col 37}{space 1}    0.73{col 46}{space 3}0.466{col 54}{space 4}-.0014845{col 67}{space 3} .0032409
{txt}{space 12} {c |}
{space 8}ldem {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .0003924{col 26}{space 2} .0002947{col 37}{space 1}    1.33{col 46}{space 3}0.183{col 54}{space 4}-.0001852{col 67}{space 3}   .00097
{txt}{space 9}F1. {c |}{col 14}{res}{space 2} .0011359{col 26}{space 2} .0004537{col 37}{space 1}    2.50{col 46}{space 3}0.012{col 54}{space 4} .0002466{col 67}{space 3} .0020252
{txt}{space 9}F2. {c |}{col 14}{res}{space 2} .0015577{col 26}{space 2} .0006806{col 37}{space 1}    2.29{col 46}{space 3}0.022{col 54}{space 4} .0002238{col 67}{space 3} .0028916
{txt}{space 9}F3. {c |}{col 14}{res}{space 2}  .002141{col 26}{space 2} .0008913{col 37}{space 1}    2.40{col 46}{space 3}0.016{col 54}{space 4} .0003941{col 67}{space 3}  .003888
{txt}{space 9}F4. {c |}{col 14}{res}{space 2} .0027495{col 26}{space 2} .0010047{col 37}{space 1}    2.74{col 46}{space 3}0.006{col 54}{space 4} .0007804{col 67}{space 3} .0047186
{txt}{space 9}F5. {c |}{col 14}{res}{space 2} .0022024{col 26}{space 2} .0010389{col 37}{space 1}    2.12{col 46}{space 3}0.034{col 54}{space 4} .0001663{col 67}{space 3} .0042385
{txt}{space 9}F6. {c |}{col 14}{res}{space 2} .0025577{col 26}{space 2} .0010769{col 37}{space 1}    2.38{col 46}{space 3}0.018{col 54}{space 4} .0004471{col 67}{space 3} .0046683
{txt}{space 9}F7. {c |}{col 14}{res}{space 2} .0027714{col 26}{space 2} .0011895{col 37}{space 1}    2.33{col 46}{space 3}0.020{col 54}{space 4} .0004401{col 67}{space 3} .0051027
{txt}{space 9}F8. {c |}{col 14}{res}{space 2} .0027236{col 26}{space 2} .0013407{col 37}{space 1}    2.03{col 46}{space 3}0.042{col 54}{space 4} .0000959{col 67}{space 3} .0053513
{txt}{space 9}F9. {c |}{col 14}{res}{space 2} .0030076{col 26}{space 2} .0014126{col 37}{space 1}    2.13{col 46}{space 3}0.033{col 54}{space 4} .0002389{col 67}{space 3} .0057763
{txt}{space 8}F10. {c |}{col 14}{res}{space 2} .0033778{col 26}{space 2}   .00147{col 37}{space 1}    2.30{col 46}{space 3}0.022{col 54}{space 4} .0004966{col 67}{space 3}  .006259
{txt}{space 8}F11. {c |}{col 14}{res}{space 2} .0032638{col 26}{space 2} .0014663{col 37}{space 1}    2.23{col 46}{space 3}0.026{col 54}{space 4}   .00039{col 67}{space 3} .0061377
{txt}{space 8}F12. {c |}{col 14}{res}{space 2}  .003788{col 26}{space 2} .0015173{col 37}{space 1}    2.50{col 46}{space 3}0.013{col 54}{space 4} .0008142{col 67}{space 3} .0067619
{txt}{space 8}F13. {c |}{col 14}{res}{space 2} .0044849{col 26}{space 2} .0015582{col 37}{space 1}    2.88{col 46}{space 3}0.004{col 54}{space 4} .0014308{col 67}{space 3}  .007539
{txt}{space 8}F14. {c |}{col 14}{res}{space 2} .0055155{col 26}{space 2} .0016124{col 37}{space 1}    3.42{col 46}{space 3}0.001{col 54}{space 4} .0023553{col 67}{space 3} .0086756
{txt}{space 8}F15. {c |}{col 14}{res}{space 2} .0056243{col 26}{space 2}  .001637{col 37}{space 1}    3.44{col 46}{space 3}0.001{col 54}{space 4} .0024159{col 67}{space 3} .0088327
{txt}{space 8}F16. {c |}{col 14}{res}{space 2} .0057079{col 26}{space 2} .0016294{col 37}{space 1}    3.50{col 46}{space 3}0.000{col 54}{space 4} .0025144{col 67}{space 3} .0089015
{txt}{space 8}F17. {c |}{col 14}{res}{space 2} .0055207{col 26}{space 2} .0016065{col 37}{space 1}    3.44{col 46}{space 3}0.001{col 54}{space 4} .0023721{col 67}{space 3} .0086693
{txt}{space 8}F18. {c |}{col 14}{res}{space 2} .0054383{col 26}{space 2} .0015771{col 37}{space 1}    3.45{col 46}{space 3}0.001{col 54}{space 4} .0023472{col 67}{space 3} .0085294
{txt}{space 8}F19. {c |}{col 14}{res}{space 2} .0053726{col 26}{space 2} .0015273{col 37}{space 1}    3.52{col 46}{space 3}0.000{col 54}{space 4} .0023791{col 67}{space 3}  .008366
{txt}{space 8}F20. {c |}{col 14}{res}{space 2} .0050532{col 26}{space 2} .0015238{col 37}{space 1}    3.32{col 46}{space 3}0.001{col 54}{space 4} .0020666{col 67}{space 3} .0080399
{txt}{space 8}F21. {c |}{col 14}{res}{space 2} .0040175{col 26}{space 2} .0015984{col 37}{space 1}    2.51{col 46}{space 3}0.012{col 54}{space 4} .0008847{col 67}{space 3} .0071504
{txt}{space 8}F22. {c |}{col 14}{res}{space 2} .0031658{col 26}{space 2} .0015897{col 37}{space 1}    1.99{col 46}{space 3}0.046{col 54}{space 4} .0000499{col 67}{space 3} .0062816
{txt}{space 8}F23. {c |}{col 14}{res}{space 2} .0027032{col 26}{space 2} .0016073{col 37}{space 1}    1.68{col 46}{space 3}0.093{col 54}{space 4}-.0004471{col 67}{space 3} .0058536
{txt}{space 8}F24. {c |}{col 14}{res}{space 2} .0027629{col 26}{space 2} .0016011{col 37}{space 1}    1.73{col 46}{space 3}0.084{col 54}{space 4}-.0003752{col 67}{space 3}  .005901
{txt}{space 8}F25. {c |}{col 14}{res}{space 2} .0013797{col 26}{space 2} .0016298{col 37}{space 1}    0.85{col 46}{space 3}0.397{col 54}{space 4}-.0018146{col 67}{space 3}  .004574
{txt}{space 8}F26. {c |}{col 14}{res}{space 2} .0006105{col 26}{space 2} .0016342{col 37}{space 1}    0.37{col 46}{space 3}0.709{col 54}{space 4}-.0025925{col 67}{space 3} .0038136
{txt}{space 8}F27. {c |}{col 14}{res}{space 2}-.0002725{col 26}{space 2} .0016853{col 37}{space 1}   -0.16{col 46}{space 3}0.872{col 54}{space 4}-.0035755{col 67}{space 3} .0030306
{txt}{space 8}F28. {c |}{col 14}{res}{space 2}-.0015594{col 26}{space 2} .0016446{col 37}{space 1}   -0.95{col 46}{space 3}0.343{col 54}{space 4}-.0047827{col 67}{space 3}  .001664
{txt}{space 8}F29. {c |}{col 14}{res}{space 2}-.0019186{col 26}{space 2} .0017258{col 37}{space 1}   -1.11{col 46}{space 3}0.266{col 54}{space 4}-.0053011{col 67}{space 3} .0014639
{txt}{space 8}F30. {c |}{col 14}{res}{space 2}-.0026405{col 26}{space 2}  .001739{col 37}{space 1}   -1.52{col 46}{space 3}0.129{col 54}{space 4}-.0060489{col 67}{space 3} .0007678
{txt}{space 8}F31. {c |}{col 14}{res}{space 2}-.0016197{col 26}{space 2} .0016612{col 37}{space 1}   -0.98{col 46}{space 3}0.330{col 54}{space 4}-.0048755{col 67}{space 3} .0016362
{txt}{space 8}F32. {c |}{col 14}{res}{space 2}-.0018509{col 26}{space 2}  .001605{col 37}{space 1}   -1.15{col 46}{space 3}0.249{col 54}{space 4}-.0049966{col 67}{space 3} .0012949
{txt}{space 8}F33. {c |}{col 14}{res}{space 2}-.0018874{col 26}{space 2} .0015203{col 37}{space 1}   -1.24{col 46}{space 3}0.214{col 54}{space 4}-.0048672{col 67}{space 3} .0010923
{txt}{space 8}F34. {c |}{col 14}{res}{space 2}-.0016248{col 26}{space 2} .0014787{col 37}{space 1}   -1.10{col 46}{space 3}0.272{col 54}{space 4}-.0045229{col 67}{space 3} .0012734
{txt}{space 8}F35. {c |}{col 14}{res}{space 2}-.0018515{col 26}{space 2} .0014633{col 37}{space 1}   -1.27{col 46}{space 3}0.206{col 54}{space 4}-.0047194{col 67}{space 3} .0010165
{txt}{space 8}F36. {c |}{col 14}{res}{space 2}-.0004858{col 26}{space 2} .0015419{col 37}{space 1}   -0.32{col 46}{space 3}0.753{col 54}{space 4}-.0035078{col 67}{space 3} .0025363
{txt}{space 8}F37. {c |}{col 14}{res}{space 2} .0002588{col 26}{space 2} .0015522{col 37}{space 1}    0.17{col 46}{space 3}0.868{col 54}{space 4}-.0027836{col 67}{space 3} .0033011
{txt}{space 8}F38. {c |}{col 14}{res}{space 2} .0006703{col 26}{space 2} .0015253{col 37}{space 1}    0.44{col 46}{space 3}0.660{col 54}{space 4}-.0023192{col 67}{space 3} .0036598
{txt}{space 8}F39. {c |}{col 14}{res}{space 2} .0003197{col 26}{space 2} .0014924{col 37}{space 1}    0.21{col 46}{space 3}0.830{col 54}{space 4}-.0026054{col 67}{space 3} .0032448
{txt}{space 8}F40. {c |}{col 14}{res}{space 2}-.0006103{col 26}{space 2} .0014755{col 37}{space 1}   -0.41{col 46}{space 3}0.679{col 54}{space 4}-.0035023{col 67}{space 3} .0022817
{txt}{space 8}F41. {c |}{col 14}{res}{space 2}-.0002424{col 26}{space 2} .0014524{col 37}{space 1}   -0.17{col 46}{space 3}0.867{col 54}{space 4} -.003089{col 67}{space 3} .0026042
{txt}{space 8}F42. {c |}{col 14}{res}{space 2} .0000533{col 26}{space 2} .0013779{col 37}{space 1}    0.04{col 46}{space 3}0.969{col 54}{space 4}-.0026473{col 67}{space 3}  .002754
{txt}{space 8}F43. {c |}{col 14}{res}{space 2} .0001006{col 26}{space 2} .0013972{col 37}{space 1}    0.07{col 46}{space 3}0.943{col 54}{space 4}-.0026378{col 67}{space 3}  .002839
{txt}{space 8}F44. {c |}{col 14}{res}{space 2} .0005239{col 26}{space 2} .0013587{col 37}{space 1}    0.39{col 46}{space 3}0.700{col 54}{space 4}-.0021392{col 67}{space 3} .0031869
{txt}{space 8}F45. {c |}{col 14}{res}{space 2} .0016039{col 26}{space 2} .0012479{col 37}{space 1}    1.29{col 46}{space 3}0.199{col 54}{space 4}-.0008419{col 67}{space 3} .0040497
{txt}{space 8}F46. {c |}{col 14}{res}{space 2} .0024559{col 26}{space 2} .0011426{col 37}{space 1}    2.15{col 46}{space 3}0.032{col 54}{space 4} .0002163{col 67}{space 3} .0046954
{txt}{space 8}F47. {c |}{col 14}{res}{space 2} .0032363{col 26}{space 2} .0010892{col 37}{space 1}    2.97{col 46}{space 3}0.003{col 54}{space 4} .0011015{col 67}{space 3} .0053711
{txt}{space 12} {c |}
{space 8}lrpo {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .0013511{col 26}{space 2} .0051458{col 37}{space 1}    0.26{col 46}{space 3}0.793{col 54}{space 4}-.0087346{col 67}{space 3} .0114367
{txt}{space 9}F1. {c |}{col 14}{res}{space 2}-.0112431{col 26}{space 2}  .008878{col 37}{space 1}   -1.27{col 46}{space 3}0.205{col 54}{space 4}-.0286436{col 67}{space 3} .0061575
{txt}{space 9}F2. {c |}{col 14}{res}{space 2}-.0217877{col 26}{space 2} .0124406{col 37}{space 1}   -1.75{col 46}{space 3}0.080{col 54}{space 4}-.0461709{col 67}{space 3} .0025955
{txt}{space 9}F3. {c |}{col 14}{res}{space 2}  -.01469{col 26}{space 2} .0132082{col 37}{space 1}   -1.11{col 46}{space 3}0.266{col 54}{space 4}-.0405775{col 67}{space 3} .0111975
{txt}{space 9}F4. {c |}{col 14}{res}{space 2}-.0105322{col 26}{space 2} .0128015{col 37}{space 1}   -0.82{col 46}{space 3}0.411{col 54}{space 4}-.0356226{col 67}{space 3} .0145583
{txt}{space 9}F5. {c |}{col 14}{res}{space 2}-.0084807{col 26}{space 2} .0124823{col 37}{space 1}   -0.68{col 46}{space 3}0.497{col 54}{space 4}-.0329455{col 67}{space 3} .0159841
{txt}{space 9}F6. {c |}{col 14}{res}{space 2}-.0186063{col 26}{space 2}  .012226{col 37}{space 1}   -1.52{col 46}{space 3}0.128{col 54}{space 4}-.0425688{col 67}{space 3} .0053562
{txt}{space 9}F7. {c |}{col 14}{res}{space 2}-.0262283{col 26}{space 2} .0125337{col 37}{space 1}   -2.09{col 46}{space 3}0.036{col 54}{space 4}-.0507939{col 67}{space 3}-.0016626
{txt}{space 9}F8. {c |}{col 14}{res}{space 2}-.0138771{col 26}{space 2} .0142621{col 37}{space 1}   -0.97{col 46}{space 3}0.331{col 54}{space 4}-.0418303{col 67}{space 3} .0140761
{txt}{space 9}F9. {c |}{col 14}{res}{space 2} .0083945{col 26}{space 2} .0159153{col 37}{space 1}    0.53{col 46}{space 3}0.598{col 54}{space 4} -.022799{col 67}{space 3}  .039588
{txt}{space 8}F10. {c |}{col 14}{res}{space 2} .0212248{col 26}{space 2} .0153846{col 37}{space 1}    1.38{col 46}{space 3}0.168{col 54}{space 4}-.0089285{col 67}{space 3} .0513781
{txt}{space 8}F11. {c |}{col 14}{res}{space 2} .0276662{col 26}{space 2} .0162095{col 37}{space 1}    1.71{col 46}{space 3}0.088{col 54}{space 4}-.0041038{col 67}{space 3} .0594361
{txt}{space 8}F12. {c |}{col 14}{res}{space 2} .0233992{col 26}{space 2} .0160486{col 37}{space 1}    1.46{col 46}{space 3}0.145{col 54}{space 4}-.0080555{col 67}{space 3}  .054854
{txt}{space 8}F13. {c |}{col 14}{res}{space 2} .0340186{col 26}{space 2} .0162344{col 37}{space 1}    2.10{col 46}{space 3}0.036{col 54}{space 4} .0021999{col 67}{space 3} .0658374
{txt}{space 8}F14. {c |}{col 14}{res}{space 2} .0300292{col 26}{space 2} .0177802{col 37}{space 1}    1.69{col 46}{space 3}0.091{col 54}{space 4}-.0048194{col 67}{space 3} .0648778
{txt}{space 8}F15. {c |}{col 14}{res}{space 2} .0494807{col 26}{space 2} .0189734{col 37}{space 1}    2.61{col 46}{space 3}0.009{col 54}{space 4} .0122935{col 67}{space 3} .0866679
{txt}{space 8}F16. {c |}{col 14}{res}{space 2} .0561542{col 26}{space 2} .0176141{col 37}{space 1}    3.19{col 46}{space 3}0.001{col 54}{space 4} .0216312{col 67}{space 3} .0906772
{txt}{space 8}F17. {c |}{col 14}{res}{space 2} .0407946{col 26}{space 2}  .015323{col 37}{space 1}    2.66{col 46}{space 3}0.008{col 54}{space 4} .0107621{col 67}{space 3}  .070827
{txt}{space 8}F18. {c |}{col 14}{res}{space 2} .0502409{col 26}{space 2} .0137604{col 37}{space 1}    3.65{col 46}{space 3}0.000{col 54}{space 4} .0232711{col 67}{space 3} .0772108
{txt}{space 8}F19. {c |}{col 14}{res}{space 2} .0481719{col 26}{space 2} .0148623{col 37}{space 1}    3.24{col 46}{space 3}0.001{col 54}{space 4} .0190422{col 67}{space 3} .0773016
{txt}{space 8}F20. {c |}{col 14}{res}{space 2} .0569722{col 26}{space 2} .0155028{col 37}{space 1}    3.67{col 46}{space 3}0.000{col 54}{space 4} .0265873{col 67}{space 3} .0873571
{txt}{space 8}F21. {c |}{col 14}{res}{space 2} .0451112{col 26}{space 2} .0196076{col 37}{space 1}    2.30{col 46}{space 3}0.021{col 54}{space 4} .0066811{col 67}{space 3} .0835413
{txt}{space 8}F22. {c |}{col 14}{res}{space 2} .0493651{col 26}{space 2} .0197609{col 37}{space 1}    2.50{col 46}{space 3}0.012{col 54}{space 4} .0106343{col 67}{space 3} .0880958
{txt}{space 8}F23. {c |}{col 14}{res}{space 2} .0422496{col 26}{space 2} .0186795{col 37}{space 1}    2.26{col 46}{space 3}0.024{col 54}{space 4} .0056384{col 67}{space 3} .0788607
{txt}{space 8}F24. {c |}{col 14}{res}{space 2} .0321232{col 26}{space 2} .0193694{col 37}{space 1}    1.66{col 46}{space 3}0.097{col 54}{space 4}-.0058402{col 67}{space 3} .0700866
{txt}{space 8}F25. {c |}{col 14}{res}{space 2} .0285798{col 26}{space 2}  .019828{col 37}{space 1}    1.44{col 46}{space 3}0.149{col 54}{space 4}-.0102824{col 67}{space 3} .0674419
{txt}{space 8}F26. {c |}{col 14}{res}{space 2} .0157408{col 26}{space 2} .0210253{col 37}{space 1}    0.75{col 46}{space 3}0.454{col 54}{space 4} -.025468{col 67}{space 3} .0569496
{txt}{space 8}F27. {c |}{col 14}{res}{space 2} .0149291{col 26}{space 2} .0226822{col 37}{space 1}    0.66{col 46}{space 3}0.510{col 54}{space 4}-.0295272{col 67}{space 3} .0593854
{txt}{space 8}F28. {c |}{col 14}{res}{space 2}-.0013663{col 26}{space 2} .0243995{col 37}{space 1}   -0.06{col 46}{space 3}0.955{col 54}{space 4}-.0491884{col 67}{space 3} .0464559
{txt}{space 8}F29. {c |}{col 14}{res}{space 2} -.005092{col 26}{space 2} .0242687{col 37}{space 1}   -0.21{col 46}{space 3}0.834{col 54}{space 4}-.0526579{col 67}{space 3} .0424738
{txt}{space 8}F30. {c |}{col 14}{res}{space 2}-.0035645{col 26}{space 2} .0239365{col 37}{space 1}   -0.15{col 46}{space 3}0.882{col 54}{space 4}-.0504791{col 67}{space 3} .0433501
{txt}{space 8}F31. {c |}{col 14}{res}{space 2}-.0033362{col 26}{space 2} .0238544{col 37}{space 1}   -0.14{col 46}{space 3}0.889{col 54}{space 4}-.0500898{col 67}{space 3} .0434175
{txt}{space 8}F32. {c |}{col 14}{res}{space 2}-.0010198{col 26}{space 2} .0227685{col 37}{space 1}   -0.04{col 46}{space 3}0.964{col 54}{space 4}-.0456451{col 67}{space 3} .0436056
{txt}{space 8}F33. {c |}{col 14}{res}{space 2}-.0062167{col 26}{space 2} .0218648{col 37}{space 1}   -0.28{col 46}{space 3}0.776{col 54}{space 4}-.0490709{col 67}{space 3} .0366375
{txt}{space 8}F34. {c |}{col 14}{res}{space 2}  .014186{col 26}{space 2} .0205577{col 37}{space 1}    0.69{col 46}{space 3}0.490{col 54}{space 4}-.0261064{col 67}{space 3} .0544784
{txt}{space 8}F35. {c |}{col 14}{res}{space 2} .0327719{col 26}{space 2} .0186578{col 37}{space 1}    1.76{col 46}{space 3}0.079{col 54}{space 4}-.0037968{col 67}{space 3} .0693405
{txt}{space 8}F36. {c |}{col 14}{res}{space 2} .0301761{col 26}{space 2} .0173633{col 37}{space 1}    1.74{col 46}{space 3}0.082{col 54}{space 4}-.0038555{col 67}{space 3} .0642076
{txt}{space 8}F37. {c |}{col 14}{res}{space 2} .0213292{col 26}{space 2} .0170137{col 37}{space 1}    1.25{col 46}{space 3}0.210{col 54}{space 4} -.012017{col 67}{space 3} .0546754
{txt}{space 8}F38. {c |}{col 14}{res}{space 2}  .020173{col 26}{space 2} .0173628{col 37}{space 1}    1.16{col 46}{space 3}0.245{col 54}{space 4}-.0138575{col 67}{space 3} .0542034
{txt}{space 8}F39. {c |}{col 14}{res}{space 2} .0071807{col 26}{space 2} .0171701{col 37}{space 1}    0.42{col 46}{space 3}0.676{col 54}{space 4}-.0264721{col 67}{space 3} .0408334
{txt}{space 8}F40. {c |}{col 14}{res}{space 2}-.0063622{col 26}{space 2} .0168762{col 37}{space 1}   -0.38{col 46}{space 3}0.706{col 54}{space 4}-.0394388{col 67}{space 3} .0267145
{txt}{space 8}F41. {c |}{col 14}{res}{space 2}-.0172578{col 26}{space 2}  .015843{col 37}{space 1}   -1.09{col 46}{space 3}0.276{col 54}{space 4}-.0483096{col 67}{space 3} .0137939
{txt}{space 8}F42. {c |}{col 14}{res}{space 2}-.0182428{col 26}{space 2} .0158452{col 37}{space 1}   -1.15{col 46}{space 3}0.250{col 54}{space 4}-.0492987{col 67}{space 3} .0128132
{txt}{space 8}F43. {c |}{col 14}{res}{space 2}-.0213688{col 26}{space 2} .0160851{col 37}{space 1}   -1.33{col 46}{space 3}0.184{col 54}{space 4}-.0528949{col 67}{space 3} .0101573
{txt}{space 8}F44. {c |}{col 14}{res}{space 2}-.0135937{col 26}{space 2} .0164044{col 37}{space 1}   -0.83{col 46}{space 3}0.407{col 54}{space 4}-.0457458{col 67}{space 3} .0185584
{txt}{space 8}F45. {c |}{col 14}{res}{space 2}-.0091659{col 26}{space 2} .0184707{col 37}{space 1}   -0.50{col 46}{space 3}0.620{col 54}{space 4}-.0453677{col 67}{space 3}  .027036
{txt}{space 8}F46. {c |}{col 14}{res}{space 2}  -.00537{col 26}{space 2} .0219332{col 37}{space 1}   -0.24{col 46}{space 3}0.807{col 54}{space 4}-.0483583{col 67}{space 3} .0376184
{txt}{space 8}F47. {c |}{col 14}{res}{space 2}-.0050954{col 26}{space 2} .0229942{col 37}{space 1}   -0.22{col 46}{space 3}0.825{col 54}{space 4}-.0501631{col 67}{space 3} .0399724
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Note: IRF coefficients for exogenous variables are dynamic multipliers.
{p 0 11 2} Impulses:{space 1} {res:lpro ldem lrpo e1} {p_end}
{p 0 11 2} Responses:{space 0} {res:lpro ldem lrpo} {p_end}
{p 0 11 2} Controls:{space 1} {res:L.e1 L10.e1 L10.ldem L10.lpro L10.lrpo L11.e1 L11.ldem L11.lpro L11.lrpo L12.e1 L12.ldem L12.lpro L12.lrpo L13.e1 L13.ldem L13.lpro L13.lrpo L14.e1 L14.ldem L14.lpro L14.lrpo L15.e1 L15.ldem L15.lpro L15.lrpo L16.e1 L16.ldem L16.lpro L16.lrpo L17.e1 L17.ldem L17.lpro L17.lrpo L18.e1 L18.ldem L18.lpro L18.lrpo L19.e1 L19.ldem L19.lpro L19.lrpo L2.e1 L2.ldem L2.lpro L2.lrpo L20.e1 L20.ldem L20.lpro L20.lrpo L21.e1 L21.ldem L21.lpro L21.lrpo L22.e1 L22.ldem L22.lpro L22.lrpo L23.e1 L23.ldem L23.lpro L23.lrpo L24.e1 L24.ldem L24.lpro L24.lrpo L3.e1 L3.ldem L3.lpro L3.lrpo L4.e1 L4.ldem L4.lpro L4.lrpo L5.e1 L5.ldem L5.lpro L5.lrpo L6.e1 L6.ldem L6.lpro L6.lrpo L7.e1 L7.ldem L7.lpro L7.lrpo L8.e1 L8.ldem L8.lpro L8.lrpo L9.e1 L9.ldem L9.lpro L9.lrpo} {p_end}

{com}. irf create lpmodel 
{res}{txt}(file {bf:comparemodels.irf} updated)

{com}. 
. var lpro ldem lrpo, lags(1/24)            ///
>   exog(L(0/24).e1)
{res}
{txt}Vector autoregression

{col 1}Sample: {res}2002m2 {txt}thru{res} 2019m12 {txt}{col 49}Number of obs{col 67}= {res}       215
{txt}Log likelihood =  {res} 2035.871{txt}{col 38}{col 49}AIC{col 67}=  {res}-16.20345
{txt}FPE{col 16}=  {res} 2.29e-11{txt}{col 49}HQIC{col 67}=  {res}-14.34114
{txt}Det(Sigma_ml){col 16}=  {res} 1.20e-12{txt}{col 49}SBIC{col 67}=  {res} -11.5943

{col 1}{text}Equation        {col 18}  Parms{col 26}     RMSE {col 37}   R-sq  {col 47}   chi2   {col 58} P>chi2
{res}{col 1}{text}{hline 17}{hline 8}{hline 11}{hline 10}{hline 11}{hline 7}
{col 1}{text}lpro            {col 18}{result}    98{col 26}{space 2} .007113{col 37}{space 1} 0.9914{col 47} 24801.23{col 58} 0.0000
{col 1}{text}ldem            {col 18}{result}    98{col 26}{space 2} .005032{col 37}{space 1} 0.9991{col 47} 233660.2{col 58} 0.0000
{col 1}{text}lrpo            {col 18}{result}    98{col 26}{space 2} .079568{col 37}{space 1} 0.9744{col 47} 8198.041{col 58} 0.0000
{col 1}{text}{hline 17}{hline 8}{hline 11}{hline 10}{hline 11}{hline 7}
{res}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lpro         {txt}{c |}
{space 8}lpro {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .7879949{col 26}{space 2} .0692835{col 37}{space 1}   11.37{col 46}{space 3}0.000{col 54}{space 4} .6522017{col 67}{space 3}  .923788
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0631854{col 26}{space 2} .0869277{col 37}{space 1}   -0.73{col 46}{space 3}0.467{col 54}{space 4}-.2335606{col 67}{space 3} .1071898
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .2023932{col 26}{space 2} .0858433{col 37}{space 1}    2.36{col 46}{space 3}0.018{col 54}{space 4} .0341434{col 67}{space 3} .3706429
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0730708{col 26}{space 2} .0888056{col 37}{space 1}    0.82{col 46}{space 3}0.411{col 54}{space 4}-.1009851{col 67}{space 3} .2471267
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.1151858{col 26}{space 2} .0918968{col 37}{space 1}   -1.25{col 46}{space 3}0.210{col 54}{space 4}-.2953002{col 67}{space 3} .0649286
{txt}{space 9}L6. {c |}{col 14}{res}{space 2}-.0201493{col 26}{space 2} .0984429{col 37}{space 1}   -0.20{col 46}{space 3}0.838{col 54}{space 4}-.2130938{col 67}{space 3} .1727952
{txt}{space 9}L7. {c |}{col 14}{res}{space 2} .2311445{col 26}{space 2} .0957485{col 37}{space 1}    2.41{col 46}{space 3}0.016{col 54}{space 4} .0434808{col 67}{space 3} .4188082
{txt}{space 9}L8. {c |}{col 14}{res}{space 2}-.0627162{col 26}{space 2}  .090523{col 37}{space 1}   -0.69{col 46}{space 3}0.488{col 54}{space 4} -.240138{col 67}{space 3} .1147056
{txt}{space 9}L9. {c |}{col 14}{res}{space 2} .0255698{col 26}{space 2} .0918134{col 37}{space 1}    0.28{col 46}{space 3}0.781{col 54}{space 4}-.1543811{col 67}{space 3} .2055207
{txt}{space 8}L10. {c |}{col 14}{res}{space 2}-.0577637{col 26}{space 2} .0918826{col 37}{space 1}   -0.63{col 46}{space 3}0.530{col 54}{space 4}-.2378504{col 67}{space 3}  .122323
{txt}{space 8}L11. {c |}{col 14}{res}{space 2}-.2631134{col 26}{space 2}   .09324{col 37}{space 1}   -2.82{col 46}{space 3}0.005{col 54}{space 4}-.4458604{col 67}{space 3}-.0803665
{txt}{space 8}L12. {c |}{col 14}{res}{space 2} .1351736{col 26}{space 2} .0969136{col 37}{space 1}    1.39{col 46}{space 3}0.163{col 54}{space 4}-.0547735{col 67}{space 3} .3251208
{txt}{space 8}L13. {c |}{col 14}{res}{space 2}-.1130812{col 26}{space 2}  .100048{col 37}{space 1}   -1.13{col 46}{space 3}0.258{col 54}{space 4}-.3091717{col 67}{space 3} .0830093
{txt}{space 8}L14. {c |}{col 14}{res}{space 2} .1280824{col 26}{space 2} .0981712{col 37}{space 1}    1.30{col 46}{space 3}0.192{col 54}{space 4}-.0643297{col 67}{space 3} .3204945
{txt}{space 8}L15. {c |}{col 14}{res}{space 2} .1379407{col 26}{space 2} .0968572{col 37}{space 1}    1.42{col 46}{space 3}0.154{col 54}{space 4}-.0518959{col 67}{space 3} .3277773
{txt}{space 8}L16. {c |}{col 14}{res}{space 2}-.0188705{col 26}{space 2}   .09921{col 37}{space 1}   -0.19{col 46}{space 3}0.849{col 54}{space 4}-.2133186{col 67}{space 3} .1755776
{txt}{space 8}L17. {c |}{col 14}{res}{space 2} .0085058{col 26}{space 2} .0998564{col 37}{space 1}    0.09{col 46}{space 3}0.932{col 54}{space 4}-.1872092{col 67}{space 3} .2042208
{txt}{space 8}L18. {c |}{col 14}{res}{space 2}-.1043324{col 26}{space 2} .0978343{col 37}{space 1}   -1.07{col 46}{space 3}0.286{col 54}{space 4}-.2960841{col 67}{space 3} .0874194
{txt}{space 8}L19. {c |}{col 14}{res}{space 2} .0425337{col 26}{space 2} .0968214{col 37}{space 1}    0.44{col 46}{space 3}0.660{col 54}{space 4}-.1472327{col 67}{space 3} .2323001
{txt}{space 8}L20. {c |}{col 14}{res}{space 2}-.0703884{col 26}{space 2} .1009632{col 37}{space 1}   -0.70{col 46}{space 3}0.486{col 54}{space 4}-.2682726{col 67}{space 3} .1274958
{txt}{space 8}L21. {c |}{col 14}{res}{space 2} .0540267{col 26}{space 2}  .103463{col 37}{space 1}    0.52{col 46}{space 3}0.602{col 54}{space 4} -.148757{col 67}{space 3} .2568104
{txt}{space 8}L22. {c |}{col 14}{res}{space 2}-.2854944{col 26}{space 2} .1014338{col 37}{space 1}   -2.81{col 46}{space 3}0.005{col 54}{space 4}-.4843009{col 67}{space 3}-.0866879
{txt}{space 8}L23. {c |}{col 14}{res}{space 2} .2627192{col 26}{space 2} .1007724{col 37}{space 1}    2.61{col 46}{space 3}0.009{col 54}{space 4}  .065209{col 67}{space 3} .4602294
{txt}{space 8}L24. {c |}{col 14}{res}{space 2}-.0489188{col 26}{space 2} .0746624{col 37}{space 1}   -0.66{col 46}{space 3}0.512{col 54}{space 4}-.1952545{col 67}{space 3} .0974169
{txt}{space 12} {c |}
{space 8}ldem {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .2622377{col 26}{space 2} .0946512{col 37}{space 1}    2.77{col 46}{space 3}0.006{col 54}{space 4} .0767248{col 67}{space 3} .4477506
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0912289{col 26}{space 2} .1383191{col 37}{space 1}   -0.66{col 46}{space 3}0.510{col 54}{space 4}-.3623293{col 67}{space 3} .1798715
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.1931505{col 26}{space 2} .1349713{col 37}{space 1}   -1.43{col 46}{space 3}0.152{col 54}{space 4}-.4576894{col 67}{space 3} .0713884
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}  -.01315{col 26}{space 2} .1365722{col 37}{space 1}   -0.10{col 46}{space 3}0.923{col 54}{space 4}-.2808266{col 67}{space 3} .2545266
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0647977{col 26}{space 2}  .136803{col 37}{space 1}    0.47{col 46}{space 3}0.636{col 54}{space 4}-.2033313{col 67}{space 3} .3329266
{txt}{space 9}L6. {c |}{col 14}{res}{space 2} -.046445{col 26}{space 2} .1353454{col 37}{space 1}   -0.34{col 46}{space 3}0.731{col 54}{space 4} -.311717{col 67}{space 3} .2188271
{txt}{space 9}L7. {c |}{col 14}{res}{space 2}-.0417372{col 26}{space 2} .1335668{col 37}{space 1}   -0.31{col 46}{space 3}0.755{col 54}{space 4}-.3035233{col 67}{space 3} .2200488
{txt}{space 9}L8. {c |}{col 14}{res}{space 2}   .04403{col 26}{space 2} .1339006{col 37}{space 1}    0.33{col 46}{space 3}0.742{col 54}{space 4}-.2184103{col 67}{space 3} .3064704
{txt}{space 9}L9. {c |}{col 14}{res}{space 2} .0351739{col 26}{space 2}  .132076{col 37}{space 1}    0.27{col 46}{space 3}0.790{col 54}{space 4}-.2236903{col 67}{space 3} .2940381
{txt}{space 8}L10. {c |}{col 14}{res}{space 2} .0545007{col 26}{space 2} .1322648{col 37}{space 1}    0.41{col 46}{space 3}0.680{col 54}{space 4}-.2047336{col 67}{space 3}  .313735
{txt}{space 8}L11. {c |}{col 14}{res}{space 2} .0535951{col 26}{space 2} .1347606{col 37}{space 1}    0.40{col 46}{space 3}0.691{col 54}{space 4}-.2105308{col 67}{space 3}  .317721
{txt}{space 8}L12. {c |}{col 14}{res}{space 2} .0036769{col 26}{space 2} .1373713{col 37}{space 1}    0.03{col 46}{space 3}0.979{col 54}{space 4}-.2655659{col 67}{space 3} .2729198
{txt}{space 8}L13. {c |}{col 14}{res}{space 2} .0443255{col 26}{space 2} .1343356{col 37}{space 1}    0.33{col 46}{space 3}0.741{col 54}{space 4}-.2189674{col 67}{space 3} .3076185
{txt}{space 8}L14. {c |}{col 14}{res}{space 2}-.1954876{col 26}{space 2} .1329771{col 37}{space 1}   -1.47{col 46}{space 3}0.142{col 54}{space 4}-.4561179{col 67}{space 3} .0651428
{txt}{space 8}L15. {c |}{col 14}{res}{space 2}-.0496376{col 26}{space 2} .1320897{col 37}{space 1}   -0.38{col 46}{space 3}0.707{col 54}{space 4}-.3085286{col 67}{space 3} .2092535
{txt}{space 8}L16. {c |}{col 14}{res}{space 2}-.0204085{col 26}{space 2} .1278888{col 37}{space 1}   -0.16{col 46}{space 3}0.873{col 54}{space 4}-.2710659{col 67}{space 3}  .230249
{txt}{space 8}L17. {c |}{col 14}{res}{space 2} .1657999{col 26}{space 2} .1279593{col 37}{space 1}    1.30{col 46}{space 3}0.195{col 54}{space 4}-.0849957{col 67}{space 3} .4165955
{txt}{space 8}L18. {c |}{col 14}{res}{space 2}-.0682028{col 26}{space 2} .1293281{col 37}{space 1}   -0.53{col 46}{space 3}0.598{col 54}{space 4}-.3216812{col 67}{space 3} .1852756
{txt}{space 8}L19. {c |}{col 14}{res}{space 2}-.0315477{col 26}{space 2}  .129028{col 37}{space 1}   -0.24{col 46}{space 3}0.807{col 54}{space 4}-.2844378{col 67}{space 3} .2213425
{txt}{space 8}L20. {c |}{col 14}{res}{space 2}-.0557287{col 26}{space 2} .1279884{col 37}{space 1}   -0.44{col 46}{space 3}0.663{col 54}{space 4}-.3065814{col 67}{space 3}  .195124
{txt}{space 8}L21. {c |}{col 14}{res}{space 2} .1457968{col 26}{space 2} .1285363{col 37}{space 1}    1.13{col 46}{space 3}0.257{col 54}{space 4}-.1061297{col 67}{space 3} .3977233
{txt}{space 8}L22. {c |}{col 14}{res}{space 2}-.0252504{col 26}{space 2} .1268128{col 37}{space 1}   -0.20{col 46}{space 3}0.842{col 54}{space 4}-.2737988{col 67}{space 3} .2232981
{txt}{space 8}L23. {c |}{col 14}{res}{space 2} .2313788{col 26}{space 2} .1263453{col 37}{space 1}    1.83{col 46}{space 3}0.067{col 54}{space 4}-.0162534{col 67}{space 3} .4790111
{txt}{space 8}L24. {c |}{col 14}{res}{space 2}-.2098489{col 26}{space 2} .0832666{col 37}{space 1}   -2.52{col 46}{space 3}0.012{col 54}{space 4}-.3730484{col 67}{space 3}-.0466494
{txt}{space 12} {c |}
{space 8}lrpo {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .0065669{col 26}{space 2} .0062409{col 37}{space 1}    1.05{col 46}{space 3}0.293{col 54}{space 4} -.005665{col 67}{space 3} .0187988
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0074992{col 26}{space 2} .0094948{col 37}{space 1}   -0.79{col 46}{space 3}0.430{col 54}{space 4}-.0261087{col 67}{space 3} .0111103
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.0007644{col 26}{space 2} .0094618{col 37}{space 1}   -0.08{col 46}{space 3}0.936{col 54}{space 4}-.0193092{col 67}{space 3} .0177805
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0026542{col 26}{space 2} .0095919{col 37}{space 1}    0.28{col 46}{space 3}0.782{col 54}{space 4}-.0161457{col 67}{space 3} .0214541
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0143788{col 26}{space 2} .0094653{col 37}{space 1}   -1.52{col 46}{space 3}0.129{col 54}{space 4}-.0329304{col 67}{space 3} .0041728
{txt}{space 9}L6. {c |}{col 14}{res}{space 2} .0116302{col 26}{space 2} .0093298{col 37}{space 1}    1.25{col 46}{space 3}0.213{col 54}{space 4} -.006656{col 67}{space 3} .0299163
{txt}{space 9}L7. {c |}{col 14}{res}{space 2} .0152226{col 26}{space 2} .0093303{col 37}{space 1}    1.63{col 46}{space 3}0.103{col 54}{space 4}-.0030645{col 67}{space 3} .0335098
{txt}{space 9}L8. {c |}{col 14}{res}{space 2}-.0143775{col 26}{space 2} .0092974{col 37}{space 1}   -1.55{col 46}{space 3}0.122{col 54}{space 4}-.0326001{col 67}{space 3} .0038451
{txt}{space 9}L9. {c |}{col 14}{res}{space 2} .0075826{col 26}{space 2} .0092904{col 37}{space 1}    0.82{col 46}{space 3}0.414{col 54}{space 4}-.0106263{col 67}{space 3} .0257915
{txt}{space 8}L10. {c |}{col 14}{res}{space 2}-.0032035{col 26}{space 2} .0092824{col 37}{space 1}   -0.35{col 46}{space 3}0.730{col 54}{space 4}-.0213967{col 67}{space 3} .0149897
{txt}{space 8}L11. {c |}{col 14}{res}{space 2}-.0245342{col 26}{space 2} .0092149{col 37}{space 1}   -2.66{col 46}{space 3}0.008{col 54}{space 4} -.042595{col 67}{space 3}-.0064733
{txt}{space 8}L12. {c |}{col 14}{res}{space 2} .0112781{col 26}{space 2} .0092358{col 37}{space 1}    1.22{col 46}{space 3}0.222{col 54}{space 4}-.0068236{col 67}{space 3} .0293799
{txt}{space 8}L13. {c |}{col 14}{res}{space 2} .0242722{col 26}{space 2} .0092156{col 37}{space 1}    2.63{col 46}{space 3}0.008{col 54}{space 4} .0062099{col 67}{space 3} .0423345
{txt}{space 8}L14. {c |}{col 14}{res}{space 2}-.0269271{col 26}{space 2} .0092236{col 37}{space 1}   -2.92{col 46}{space 3}0.004{col 54}{space 4}-.0450051{col 67}{space 3}-.0088491
{txt}{space 8}L15. {c |}{col 14}{res}{space 2} .0122909{col 26}{space 2} .0092586{col 37}{space 1}    1.33{col 46}{space 3}0.184{col 54}{space 4}-.0058555{col 67}{space 3} .0304374
{txt}{space 8}L16. {c |}{col 14}{res}{space 2}-.0021652{col 26}{space 2} .0093146{col 37}{space 1}   -0.23{col 46}{space 3}0.816{col 54}{space 4}-.0204216{col 67}{space 3} .0160911
{txt}{space 8}L17. {c |}{col 14}{res}{space 2} .0039643{col 26}{space 2} .0097108{col 37}{space 1}    0.41{col 46}{space 3}0.683{col 54}{space 4}-.0150685{col 67}{space 3}  .022997
{txt}{space 8}L18. {c |}{col 14}{res}{space 2} .0020422{col 26}{space 2} .0096601{col 37}{space 1}    0.21{col 46}{space 3}0.833{col 54}{space 4}-.0168912{col 67}{space 3} .0209756
{txt}{space 8}L19. {c |}{col 14}{res}{space 2}-.0011984{col 26}{space 2} .0093908{col 37}{space 1}   -0.13{col 46}{space 3}0.898{col 54}{space 4} -.019604{col 67}{space 3} .0172071
{txt}{space 8}L20. {c |}{col 14}{res}{space 2}-.0005273{col 26}{space 2} .0092891{col 37}{space 1}   -0.06{col 46}{space 3}0.955{col 54}{space 4}-.0187337{col 67}{space 3}  .017679
{txt}{space 8}L21. {c |}{col 14}{res}{space 2} .0028018{col 26}{space 2} .0091468{col 37}{space 1}    0.31{col 46}{space 3}0.759{col 54}{space 4}-.0151255{col 67}{space 3} .0207291
{txt}{space 8}L22. {c |}{col 14}{res}{space 2}-.0111098{col 26}{space 2} .0089514{col 37}{space 1}   -1.24{col 46}{space 3}0.215{col 54}{space 4}-.0286543{col 67}{space 3} .0064348
{txt}{space 8}L23. {c |}{col 14}{res}{space 2}-.0038319{col 26}{space 2} .0087735{col 37}{space 1}   -0.44{col 46}{space 3}0.662{col 54}{space 4}-.0210277{col 67}{space 3}  .013364
{txt}{space 8}L24. {c |}{col 14}{res}{space 2}  .005139{col 26}{space 2} .0061444{col 37}{space 1}    0.84{col 46}{space 3}0.403{col 54}{space 4}-.0069039{col 67}{space 3} .0171818
{txt}{space 12} {c |}
{space 10}e1 {c |}
{space 9}--. {c |}{col 14}{res}{space 2} .0006115{col 26}{space 2} .0003859{col 37}{space 1}    1.58{col 46}{space 3}0.113{col 54}{space 4}-.0001448{col 67}{space 3} .0013678
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} .0002464{col 26}{space 2} .0003891{col 37}{space 1}    0.63{col 46}{space 3}0.527{col 54}{space 4}-.0005163{col 67}{space 3}  .001009
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0003582{col 26}{space 2} .0003899{col 37}{space 1}   -0.92{col 46}{space 3}0.358{col 54}{space 4}-.0011223{col 67}{space 3} .0004059
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.0005025{col 26}{space 2} .0003946{col 37}{space 1}   -1.27{col 46}{space 3}0.203{col 54}{space 4}-.0012759{col 67}{space 3} .0002708
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.0010801{col 26}{space 2} .0004042{col 37}{space 1}   -2.67{col 46}{space 3}0.008{col 54}{space 4}-.0018723{col 67}{space 3}-.0002879
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}   -.0004{col 26}{space 2} .0004144{col 37}{space 1}   -0.97{col 46}{space 3}0.334{col 54}{space 4}-.0012122{col 67}{space 3} .0004123
{txt}{space 9}L6. {c |}{col 14}{res}{space 2}-.0002556{col 26}{space 2} .0004111{col 37}{space 1}   -0.62{col 46}{space 3}0.534{col 54}{space 4}-.0010613{col 67}{space 3} .0005502
{txt}{space 9}L7. {c |}{col 14}{res}{space 2}-.0000213{col 26}{space 2} .0004097{col 37}{space 1}   -0.05{col 46}{space 3}0.959{col 54}{space 4}-.0008242{col 67}{space 3} .0007816
{txt}{space 9}L8. {c |}{col 14}{res}{space 2} .0000134{col 26}{space 2} .0004113{col 37}{space 1}    0.03{col 46}{space 3}0.974{col 54}{space 4}-.0007927{col 67}{space 3} .0008196
{txt}{space 9}L9. {c |}{col 14}{res}{space 2} .0014178{col 26}{space 2} .0004134{col 37}{space 1}    3.43{col 46}{space 3}0.001{col 54}{space 4} .0006075{col 67}{space 3}  .002228
{txt}{space 8}L10. {c |}{col 14}{res}{space 2}  .000199{col 26}{space 2} .0003986{col 37}{space 1}    0.50{col 46}{space 3}0.618{col 54}{space 4}-.0005823{col 67}{space 3} .0009802
{txt}{space 8}L11. {c |}{col 14}{res}{space 2} .0009847{col 26}{space 2} .0003717{col 37}{space 1}    2.65{col 46}{space 3}0.008{col 54}{space 4} .0002562{col 67}{space 3} .0017131
{txt}{space 8}L12. {c |}{col 14}{res}{space 2} .0002157{col 26}{space 2} .0003727{col 37}{space 1}    0.58{col 46}{space 3}0.563{col 54}{space 4}-.0005148{col 67}{space 3} .0009462
{txt}{space 8}L13. {c |}{col 14}{res}{space 2} .0008115{col 26}{space 2} .0003519{col 37}{space 1}    2.31{col 46}{space 3}0.021{col 54}{space 4} .0001217{col 67}{space 3} .0015013
{txt}{space 8}L14. {c |}{col 14}{res}{space 2} .0003189{col 26}{space 2} .0003545{col 37}{space 1}    0.90{col 46}{space 3}0.368{col 54}{space 4}-.0003759{col 67}{space 3} .0010136
{txt}{space 8}L15. {c |}{col 14}{res}{space 2} .0002629{col 26}{space 2} .0003559{col 37}{space 1}    0.74{col 46}{space 3}0.460{col 54}{space 4}-.0004347{col 67}{space 3} .0009605
{txt}{space 8}L16. {c |}{col 14}{res}{space 2}-.0005603{col 26}{space 2} .0003484{col 37}{space 1}   -1.61{col 46}{space 3}0.108{col 54}{space 4}-.0012431{col 67}{space 3} .0001225
{txt}{space 8}L17. {c |}{col 14}{res}{space 2} -.000353{col 26}{space 2} .0003453{col 37}{space 1}   -1.02{col 46}{space 3}0.307{col 54}{space 4}-.0010297{col 67}{space 3} .0003237
{txt}{space 8}L18. {c |}{col 14}{res}{space 2}-.0006709{col 26}{space 2} .0003453{col 37}{space 1}   -1.94{col 46}{space 3}0.052{col 54}{space 4}-.0013476{col 67}{space 3} 5.82e-06
{txt}{space 8}L19. {c |}{col 14}{res}{space 2}-.0002881{col 26}{space 2} .0003465{col 37}{space 1}   -0.83{col 46}{space 3}0.406{col 54}{space 4}-.0009671{col 67}{space 3}  .000391
{txt}{space 8}L20. {c |}{col 14}{res}{space 2} .0008483{col 26}{space 2} .0003474{col 37}{space 1}    2.44{col 46}{space 3}0.015{col 54}{space 4} .0001675{col 67}{space 3} .0015291
{txt}{space 8}L21. {c |}{col 14}{res}{space 2}-.0003638{col 26}{space 2} .0003503{col 37}{space 1}   -1.04{col 46}{space 3}0.299{col 54}{space 4}-.0010503{col 67}{space 3} .0003227
{txt}{space 8}L22. {c |}{col 14}{res}{space 2} -.000181{col 26}{space 2} .0003464{col 37}{space 1}   -0.52{col 46}{space 3}0.601{col 54}{space 4}  -.00086{col 67}{space 3}  .000498
{txt}{space 8}L23. {c |}{col 14}{res}{space 2} .0007854{col 26}{space 2}  .000348{col 37}{space 1}    2.26{col 46}{space 3}0.024{col 54}{space 4} .0001034{col 67}{space 3} .0014675
{txt}{space 8}L24. {c |}{col 14}{res}{space 2} .0005035{col 26}{space 2} .0003395{col 37}{space 1}    1.48{col 46}{space 3}0.138{col 54}{space 4}-.0001618{col 67}{space 3} .0011688
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .2976103{col 26}{space 2} .1248611{col 37}{space 1}    2.38{col 46}{space 3}0.017{col 54}{space 4} .0528871{col 67}{space 3} .5423335
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ldem         {txt}{c |}
{space 8}lpro {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .0324021{col 26}{space 2} .0490114{col 37}{space 1}    0.66{col 46}{space 3}0.509{col 54}{space 4}-.0636586{col 67}{space 3} .1284627
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0357855{col 26}{space 2}  .061493{col 37}{space 1}   -0.58{col 46}{space 3}0.561{col 54}{space 4}-.1563097{col 67}{space 3} .0847386
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .0675191{col 26}{space 2} .0607259{col 37}{space 1}    1.11{col 46}{space 3}0.266{col 54}{space 4}-.0515015{col 67}{space 3} .1865397
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0410793{col 26}{space 2} .0628215{col 37}{space 1}    0.65{col 46}{space 3}0.513{col 54}{space 4}-.0820485{col 67}{space 3} .1642072
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} -.195062{col 26}{space 2} .0650082{col 37}{space 1}   -3.00{col 46}{space 3}0.003{col 54}{space 4}-.3224757{col 67}{space 3}-.0676483
{txt}{space 9}L6. {c |}{col 14}{res}{space 2} .1083672{col 26}{space 2} .0696389{col 37}{space 1}    1.56{col 46}{space 3}0.120{col 54}{space 4}-.0281226{col 67}{space 3}  .244857
{txt}{space 9}L7. {c |}{col 14}{res}{space 2} .0221673{col 26}{space 2} .0677329{col 37}{space 1}    0.33{col 46}{space 3}0.743{col 54}{space 4}-.1105868{col 67}{space 3} .1549215
{txt}{space 9}L8. {c |}{col 14}{res}{space 2} -.145644{col 26}{space 2} .0640364{col 37}{space 1}   -2.27{col 46}{space 3}0.023{col 54}{space 4}-.2711529{col 67}{space 3} -.020135
{txt}{space 9}L9. {c |}{col 14}{res}{space 2}    .1964{col 26}{space 2} .0649492{col 37}{space 1}    3.02{col 46}{space 3}0.002{col 54}{space 4} .0691019{col 67}{space 3}  .323698
{txt}{space 8}L10. {c |}{col 14}{res}{space 2}-.1563078{col 26}{space 2} .0649982{col 37}{space 1}   -2.40{col 46}{space 3}0.016{col 54}{space 4}-.2837019{col 67}{space 3}-.0289137
{txt}{space 8}L11. {c |}{col 14}{res}{space 2} .0766612{col 26}{space 2} .0659584{col 37}{space 1}    1.16{col 46}{space 3}0.245{col 54}{space 4}-.0526148{col 67}{space 3} .2059372
{txt}{space 8}L12. {c |}{col 14}{res}{space 2} .0087775{col 26}{space 2} .0685571{col 37}{space 1}    0.13{col 46}{space 3}0.898{col 54}{space 4}-.1255919{col 67}{space 3}  .143147
{txt}{space 8}L13. {c |}{col 14}{res}{space 2}-.0057564{col 26}{space 2} .0707744{col 37}{space 1}   -0.08{col 46}{space 3}0.935{col 54}{space 4}-.1444717{col 67}{space 3} .1329589
{txt}{space 8}L14. {c |}{col 14}{res}{space 2}-.0118272{col 26}{space 2} .0694468{col 37}{space 1}   -0.17{col 46}{space 3}0.865{col 54}{space 4}-.1479403{col 67}{space 3}  .124286
{txt}{space 8}L15. {c |}{col 14}{res}{space 2}-.0245554{col 26}{space 2} .0685172{col 37}{space 1}   -0.36{col 46}{space 3}0.720{col 54}{space 4}-.1588467{col 67}{space 3} .1097358
{txt}{space 8}L16. {c |}{col 14}{res}{space 2} .0632548{col 26}{space 2} .0701816{col 37}{space 1}    0.90{col 46}{space 3}0.367{col 54}{space 4}-.0742986{col 67}{space 3} .2008083
{txt}{space 8}L17. {c |}{col 14}{res}{space 2} .0143549{col 26}{space 2} .0706389{col 37}{space 1}    0.20{col 46}{space 3}0.839{col 54}{space 4}-.1240948{col 67}{space 3} .1528045
{txt}{space 8}L18. {c |}{col 14}{res}{space 2} .0835481{col 26}{space 2} .0692084{col 37}{space 1}    1.21{col 46}{space 3}0.227{col 54}{space 4}-.0520979{col 67}{space 3} .2191942
{txt}{space 8}L19. {c |}{col 14}{res}{space 2}-.1832926{col 26}{space 2} .0684919{col 37}{space 1}   -2.68{col 46}{space 3}0.007{col 54}{space 4}-.3175342{col 67}{space 3} -.049051
{txt}{space 8}L20. {c |}{col 14}{res}{space 2} .1917345{col 26}{space 2} .0714218{col 37}{space 1}    2.68{col 46}{space 3}0.007{col 54}{space 4} .0517503{col 67}{space 3} .3317187
{txt}{space 8}L21. {c |}{col 14}{res}{space 2}-.1243021{col 26}{space 2} .0731902{col 37}{space 1}   -1.70{col 46}{space 3}0.089{col 54}{space 4}-.2677522{col 67}{space 3}  .019148
{txt}{space 8}L22. {c |}{col 14}{res}{space 2} .1095888{col 26}{space 2} .0717547{col 37}{space 1}    1.53{col 46}{space 3}0.127{col 54}{space 4}-.0310478{col 67}{space 3} .2502253
{txt}{space 8}L23. {c |}{col 14}{res}{space 2} .0064844{col 26}{space 2} .0712868{col 37}{space 1}    0.09{col 46}{space 3}0.928{col 54}{space 4}-.1332352{col 67}{space 3}  .146204
{txt}{space 8}L24. {c |}{col 14}{res}{space 2}-.0260427{col 26}{space 2} .0528165{col 37}{space 1}   -0.49{col 46}{space 3}0.622{col 54}{space 4}-.1295612{col 67}{space 3} .0774758
{txt}{space 12} {c |}
{space 8}ldem {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} 1.101956{col 26}{space 2} .0669567{col 37}{space 1}   16.46{col 46}{space 3}0.000{col 54}{space 4} .9707237{col 67}{space 3} 1.233189
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0781916{col 26}{space 2} .0978475{col 37}{space 1}    0.80{col 46}{space 3}0.424{col 54}{space 4}-.1135861{col 67}{space 3} .2699692
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.1970391{col 26}{space 2} .0954793{col 37}{space 1}   -2.06{col 46}{space 3}0.039{col 54}{space 4}-.3841751{col 67}{space 3}-.0099031
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}   .03612{col 26}{space 2} .0966118{col 37}{space 1}    0.37{col 46}{space 3}0.709{col 54}{space 4}-.1532356{col 67}{space 3} .2254757
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}  .053229{col 26}{space 2}  .096775{col 37}{space 1}    0.55{col 46}{space 3}0.582{col 54}{space 4}-.1364466{col 67}{space 3} .2429046
{txt}{space 9}L6. {c |}{col 14}{res}{space 2}-.2005829{col 26}{space 2} .0957439{col 37}{space 1}   -2.09{col 46}{space 3}0.036{col 54}{space 4}-.3882375{col 67}{space 3}-.0129283
{txt}{space 9}L7. {c |}{col 14}{res}{space 2} .1046851{col 26}{space 2} .0944857{col 37}{space 1}    1.11{col 46}{space 3}0.268{col 54}{space 4}-.0805035{col 67}{space 3} .2898738
{txt}{space 9}L8. {c |}{col 14}{res}{space 2} .0717688{col 26}{space 2} .0947219{col 37}{space 1}    0.76{col 46}{space 3}0.449{col 54}{space 4}-.1138826{col 67}{space 3} .2574203
{txt}{space 9}L9. {c |}{col 14}{res}{space 2}-.1513841{col 26}{space 2} .0934311{col 37}{space 1}   -1.62{col 46}{space 3}0.105{col 54}{space 4}-.3345058{col 67}{space 3} .0317375
{txt}{space 8}L10. {c |}{col 14}{res}{space 2}  .054617{col 26}{space 2} .0935647{col 37}{space 1}    0.58{col 46}{space 3}0.559{col 54}{space 4}-.1287665{col 67}{space 3} .2380005
{txt}{space 8}L11. {c |}{col 14}{res}{space 2} .0074416{col 26}{space 2} .0953302{col 37}{space 1}    0.08{col 46}{space 3}0.938{col 54}{space 4}-.1794022{col 67}{space 3} .1942854
{txt}{space 8}L12. {c |}{col 14}{res}{space 2}-.0520141{col 26}{space 2} .0971771{col 37}{space 1}   -0.54{col 46}{space 3}0.592{col 54}{space 4}-.2424777{col 67}{space 3} .1384495
{txt}{space 8}L13. {c |}{col 14}{res}{space 2} .1394519{col 26}{space 2} .0950296{col 37}{space 1}    1.47{col 46}{space 3}0.142{col 54}{space 4}-.0468027{col 67}{space 3} .3257065
{txt}{space 8}L14. {c |}{col 14}{res}{space 2}-.0485873{col 26}{space 2} .0940686{col 37}{space 1}   -0.52{col 46}{space 3}0.605{col 54}{space 4}-.2329583{col 67}{space 3} .1357838
{txt}{space 8}L15. {c |}{col 14}{res}{space 2}-.1695351{col 26}{space 2} .0934408{col 37}{space 1}   -1.81{col 46}{space 3}0.070{col 54}{space 4}-.3526758{col 67}{space 3} .0136055
{txt}{space 8}L16. {c |}{col 14}{res}{space 2} .1173461{col 26}{space 2} .0904691{col 37}{space 1}    1.30{col 46}{space 3}0.195{col 54}{space 4}-.0599701{col 67}{space 3} .2946623
{txt}{space 8}L17. {c |}{col 14}{res}{space 2} -.008659{col 26}{space 2}  .090519{col 37}{space 1}   -0.10{col 46}{space 3}0.924{col 54}{space 4}-.1860729{col 67}{space 3} .1687549
{txt}{space 8}L18. {c |}{col 14}{res}{space 2} .0284162{col 26}{space 2} .0914873{col 37}{space 1}    0.31{col 46}{space 3}0.756{col 54}{space 4}-.1508955{col 67}{space 3}  .207728
{txt}{space 8}L19. {c |}{col 14}{res}{space 2} -.069861{col 26}{space 2} .0912749{col 37}{space 1}   -0.77{col 46}{space 3}0.444{col 54}{space 4}-.2487566{col 67}{space 3} .1090346
{txt}{space 8}L20. {c |}{col 14}{res}{space 2} .0298873{col 26}{space 2} .0905396{col 37}{space 1}    0.33{col 46}{space 3}0.741{col 54}{space 4} -.147567{col 67}{space 3} .2073416
{txt}{space 8}L21. {c |}{col 14}{res}{space 2} .0037632{col 26}{space 2} .0909271{col 37}{space 1}    0.04{col 46}{space 3}0.967{col 54}{space 4}-.1744507{col 67}{space 3} .1819771
{txt}{space 8}L22. {c |}{col 14}{res}{space 2}-.1964998{col 26}{space 2} .0897079{col 37}{space 1}   -2.19{col 46}{space 3}0.028{col 54}{space 4}-.3723241{col 67}{space 3}-.0206755
{txt}{space 8}L23. {c |}{col 14}{res}{space 2} .2638027{col 26}{space 2} .0893772{col 37}{space 1}    2.95{col 46}{space 3}0.003{col 54}{space 4} .0886265{col 67}{space 3} .4389788
{txt}{space 8}L24. {c |}{col 14}{res}{space 2}-.0489091{col 26}{space 2} .0589032{col 37}{space 1}   -0.83{col 46}{space 3}0.406{col 54}{space 4}-.1643572{col 67}{space 3} .0665389
{txt}{space 12} {c |}
{space 8}lrpo {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .0185437{col 26}{space 2} .0044148{col 37}{space 1}    4.20{col 46}{space 3}0.000{col 54}{space 4} .0098908{col 67}{space 3} .0271966
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} -.016056{col 26}{space 2} .0067167{col 37}{space 1}   -2.39{col 46}{space 3}0.017{col 54}{space 4}-.0292204{col 67}{space 3}-.0028916
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .0080875{col 26}{space 2} .0066933{col 37}{space 1}    1.21{col 46}{space 3}0.227{col 54}{space 4}-.0050312{col 67}{space 3} .0212062
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.0055848{col 26}{space 2} .0067854{col 37}{space 1}   -0.82{col 46}{space 3}0.410{col 54}{space 4}-.0188839{col 67}{space 3} .0077143
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0168343{col 26}{space 2} .0066958{col 37}{space 1}   -2.51{col 46}{space 3}0.012{col 54}{space 4}-.0299578{col 67}{space 3}-.0037109
{txt}{space 9}L6. {c |}{col 14}{res}{space 2} .0077253{col 26}{space 2}    .0066{col 37}{space 1}    1.17{col 46}{space 3}0.242{col 54}{space 4}-.0052104{col 67}{space 3}  .020661
{txt}{space 9}L7. {c |}{col 14}{res}{space 2} .0105967{col 26}{space 2} .0066003{col 37}{space 1}    1.61{col 46}{space 3}0.108{col 54}{space 4}-.0023397{col 67}{space 3} .0235331
{txt}{space 9}L8. {c |}{col 14}{res}{space 2}-.0116012{col 26}{space 2}  .006577{col 37}{space 1}   -1.76{col 46}{space 3}0.078{col 54}{space 4}-.0244919{col 67}{space 3} .0012896
{txt}{space 9}L9. {c |}{col 14}{res}{space 2}  .010081{col 26}{space 2} .0065721{col 37}{space 1}    1.53{col 46}{space 3}0.125{col 54}{space 4}-.0028001{col 67}{space 3}  .022962
{txt}{space 8}L10. {c |}{col 14}{res}{space 2}  .002106{col 26}{space 2} .0065664{col 37}{space 1}    0.32{col 46}{space 3}0.748{col 54}{space 4} -.010764{col 67}{space 3} .0149759
{txt}{space 8}L11. {c |}{col 14}{res}{space 2} .0004307{col 26}{space 2} .0065186{col 37}{space 1}    0.07{col 46}{space 3}0.947{col 54}{space 4}-.0123456{col 67}{space 3}  .013207
{txt}{space 8}L12. {c |}{col 14}{res}{space 2} -.008318{col 26}{space 2} .0065334{col 37}{space 1}   -1.27{col 46}{space 3}0.203{col 54}{space 4}-.0211232{col 67}{space 3} .0044873
{txt}{space 8}L13. {c |}{col 14}{res}{space 2} .0003339{col 26}{space 2} .0065192{col 37}{space 1}    0.05{col 46}{space 3}0.959{col 54}{space 4}-.0124434{col 67}{space 3} .0131113
{txt}{space 8}L14. {c |}{col 14}{res}{space 2}  .006108{col 26}{space 2} .0065248{col 37}{space 1}    0.94{col 46}{space 3}0.349{col 54}{space 4}-.0066804{col 67}{space 3} .0188965
{txt}{space 8}L15. {c |}{col 14}{res}{space 2}-.0123329{col 26}{space 2} .0065496{col 37}{space 1}   -1.88{col 46}{space 3}0.060{col 54}{space 4}-.0251698{col 67}{space 3}  .000504
{txt}{space 8}L16. {c |}{col 14}{res}{space 2}  .022564{col 26}{space 2} .0065892{col 37}{space 1}    3.42{col 46}{space 3}0.001{col 54}{space 4} .0096494{col 67}{space 3} .0354786
{txt}{space 8}L17. {c |}{col 14}{res}{space 2}-.0119726{col 26}{space 2} .0068694{col 37}{space 1}   -1.74{col 46}{space 3}0.081{col 54}{space 4}-.0254365{col 67}{space 3} .0014912
{txt}{space 8}L18. {c |}{col 14}{res}{space 2} .0054591{col 26}{space 2} .0068336{col 37}{space 1}    0.80{col 46}{space 3}0.424{col 54}{space 4}-.0079345{col 67}{space 3} .0188527
{txt}{space 8}L19. {c |}{col 14}{res}{space 2}-.0048767{col 26}{space 2} .0066431{col 37}{space 1}   -0.73{col 46}{space 3}0.463{col 54}{space 4}-.0178969{col 67}{space 3} .0081434
{txt}{space 8}L20. {c |}{col 14}{res}{space 2} .0033648{col 26}{space 2} .0065712{col 37}{space 1}    0.51{col 46}{space 3}0.609{col 54}{space 4}-.0095145{col 67}{space 3}  .016244
{txt}{space 8}L21. {c |}{col 14}{res}{space 2}-.0076327{col 26}{space 2} .0064705{col 37}{space 1}   -1.18{col 46}{space 3}0.238{col 54}{space 4}-.0203145{col 67}{space 3} .0050492
{txt}{space 8}L22. {c |}{col 14}{res}{space 2}  .010468{col 26}{space 2} .0063323{col 37}{space 1}    1.65{col 46}{space 3}0.098{col 54}{space 4}-.0019431{col 67}{space 3} .0228791
{txt}{space 8}L23. {c |}{col 14}{res}{space 2}-.0011839{col 26}{space 2} .0062064{col 37}{space 1}   -0.19{col 46}{space 3}0.849{col 54}{space 4}-.0133483{col 67}{space 3} .0109805
{txt}{space 8}L24. {c |}{col 14}{res}{space 2}-.0070535{col 26}{space 2} .0043466{col 37}{space 1}   -1.62{col 46}{space 3}0.105{col 54}{space 4}-.0155726{col 67}{space 3} .0014657
{txt}{space 12} {c |}
{space 10}e1 {c |}
{space 9}--. {c |}{col 14}{res}{space 2}  .000193{col 26}{space 2}  .000273{col 37}{space 1}    0.71{col 46}{space 3}0.479{col 54}{space 4} -.000342{col 67}{space 3} .0007281
{txt}{space 9}L1. {c |}{col 14}{res}{space 2} .0004681{col 26}{space 2} .0002753{col 37}{space 1}    1.70{col 46}{space 3}0.089{col 54}{space 4}-.0000714{col 67}{space 3} .0010077
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0006763{col 26}{space 2} .0002758{col 37}{space 1}    2.45{col 46}{space 3}0.014{col 54}{space 4} .0001358{col 67}{space 3} .0012168
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .0001242{col 26}{space 2} .0002791{col 37}{space 1}    0.45{col 46}{space 3}0.656{col 54}{space 4}-.0004228{col 67}{space 3} .0006713
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0003534{col 26}{space 2} .0002859{col 37}{space 1}    1.24{col 46}{space 3}0.216{col 54}{space 4} -.000207{col 67}{space 3} .0009138
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0000671{col 26}{space 2} .0002932{col 37}{space 1}    0.23{col 46}{space 3}0.819{col 54}{space 4}-.0005074{col 67}{space 3} .0006417
{txt}{space 9}L6. {c |}{col 14}{res}{space 2} .0002561{col 26}{space 2} .0002908{col 37}{space 1}    0.88{col 46}{space 3}0.379{col 54}{space 4}-.0003139{col 67}{space 3} .0008261
{txt}{space 9}L7. {c |}{col 14}{res}{space 2}  .000497{col 26}{space 2} .0002898{col 37}{space 1}    1.72{col 46}{space 3}0.086{col 54}{space 4} -.000071{col 67}{space 3}  .001065
{txt}{space 9}L8. {c |}{col 14}{res}{space 2} .0006612{col 26}{space 2}  .000291{col 37}{space 1}    2.27{col 46}{space 3}0.023{col 54}{space 4} .0000909{col 67}{space 3} .0012315
{txt}{space 9}L9. {c |}{col 14}{res}{space 2} .0004277{col 26}{space 2} .0002924{col 37}{space 1}    1.46{col 46}{space 3}0.144{col 54}{space 4}-.0001454{col 67}{space 3} .0010009
{txt}{space 8}L10. {c |}{col 14}{res}{space 2} .0002775{col 26}{space 2}  .000282{col 37}{space 1}    0.98{col 46}{space 3}0.325{col 54}{space 4}-.0002752{col 67}{space 3} .0008302
{txt}{space 8}L11. {c |}{col 14}{res}{space 2}-.0003992{col 26}{space 2} .0002629{col 37}{space 1}   -1.52{col 46}{space 3}0.129{col 54}{space 4}-.0009145{col 67}{space 3} .0001161
{txt}{space 8}L12. {c |}{col 14}{res}{space 2} .0002523{col 26}{space 2} .0002637{col 37}{space 1}    0.96{col 46}{space 3}0.339{col 54}{space 4}-.0002644{col 67}{space 3} .0007691
{txt}{space 8}L13. {c |}{col 14}{res}{space 2} .0004781{col 26}{space 2}  .000249{col 37}{space 1}    1.92{col 46}{space 3}0.055{col 54}{space 4}-9.88e-06{col 67}{space 3}  .000966
{txt}{space 8}L14. {c |}{col 14}{res}{space 2} .0005407{col 26}{space 2} .0002508{col 37}{space 1}    2.16{col 46}{space 3}0.031{col 54}{space 4} .0000492{col 67}{space 3} .0010322
{txt}{space 8}L15. {c |}{col 14}{res}{space 2} .0002526{col 26}{space 2} .0002518{col 37}{space 1}    1.00{col 46}{space 3}0.316{col 54}{space 4}-.0002409{col 67}{space 3} .0007461
{txt}{space 8}L16. {c |}{col 14}{res}{space 2} .0002762{col 26}{space 2} .0002464{col 37}{space 1}    1.12{col 46}{space 3}0.262{col 54}{space 4}-.0002068{col 67}{space 3} .0007592
{txt}{space 8}L17. {c |}{col 14}{res}{space 2} .0004027{col 26}{space 2} .0002442{col 37}{space 1}    1.65{col 46}{space 3}0.099{col 54}{space 4} -.000076{col 67}{space 3} .0008814
{txt}{space 8}L18. {c |}{col 14}{res}{space 2} .0004009{col 26}{space 2} .0002442{col 37}{space 1}    1.64{col 46}{space 3}0.101{col 54}{space 4}-.0000778{col 67}{space 3} .0008796
{txt}{space 8}L19. {c |}{col 14}{res}{space 2}-.0002959{col 26}{space 2} .0002451{col 37}{space 1}   -1.21{col 46}{space 3}0.227{col 54}{space 4}-.0007762{col 67}{space 3} .0001845
{txt}{space 8}L20. {c |}{col 14}{res}{space 2} .0003082{col 26}{space 2} .0002457{col 37}{space 1}    1.25{col 46}{space 3}0.210{col 54}{space 4}-.0001734{col 67}{space 3} .0007898
{txt}{space 8}L21. {c |}{col 14}{res}{space 2}  .000157{col 26}{space 2} .0002478{col 37}{space 1}    0.63{col 46}{space 3}0.526{col 54}{space 4}-.0003286{col 67}{space 3} .0006426
{txt}{space 8}L22. {c |}{col 14}{res}{space 2} .0002535{col 26}{space 2} .0002451{col 37}{space 1}    1.03{col 46}{space 3}0.301{col 54}{space 4}-.0002268{col 67}{space 3} .0007338
{txt}{space 8}L23. {c |}{col 14}{res}{space 2} .0005231{col 26}{space 2} .0002462{col 37}{space 1}    2.12{col 46}{space 3}0.034{col 54}{space 4} .0000406{col 67}{space 3} .0010056
{txt}{space 8}L24. {c |}{col 14}{res}{space 2} .0009938{col 26}{space 2} .0002401{col 37}{space 1}    4.14{col 46}{space 3}0.000{col 54}{space 4} .0005232{col 67}{space 3} .0014645
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.2502073{col 26}{space 2} .0883273{col 37}{space 1}   -2.83{col 46}{space 3}0.005{col 54}{space 4}-.4233256{col 67}{space 3}-.0770891
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lrpo         {txt}{c |}
{space 8}lpro {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.9249983{col 26}{space 2} .7750174{col 37}{space 1}   -1.19{col 46}{space 3}0.233{col 54}{space 4}-2.444005{col 67}{space 3}  .594008
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .7432964{col 26}{space 2} .9723888{col 37}{space 1}    0.76{col 46}{space 3}0.445{col 54}{space 4}-1.162551{col 67}{space 3} 2.649143
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}  .110583{col 26}{space 2} .9602581{col 37}{space 1}    0.12{col 46}{space 3}0.908{col 54}{space 4}-1.771488{col 67}{space 3} 1.992654
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}  1.26185{col 26}{space 2} .9933957{col 37}{space 1}    1.27{col 46}{space 3}0.204{col 54}{space 4}-.6851695{col 67}{space 3}  3.20887
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-2.943788{col 26}{space 2} 1.027973{col 37}{space 1}   -2.86{col 46}{space 3}0.004{col 54}{space 4}-4.958579{col 67}{space 3} -.928997
{txt}{space 9}L6. {c |}{col 14}{res}{space 2}-.0014789{col 26}{space 2} 1.101199{col 37}{space 1}   -0.00{col 46}{space 3}0.999{col 54}{space 4} -2.15979{col 67}{space 3} 2.156832
{txt}{space 9}L7. {c |}{col 14}{res}{space 2} .1151396{col 26}{space 2}  1.07106{col 37}{space 1}    0.11{col 46}{space 3}0.914{col 54}{space 4}  -1.9841{col 67}{space 3} 2.214379
{txt}{space 9}L8. {c |}{col 14}{res}{space 2}   .41424{col 26}{space 2} 1.012606{col 37}{space 1}    0.41{col 46}{space 3}0.682{col 54}{space 4}-1.570432{col 67}{space 3} 2.398911
{txt}{space 9}L9. {c |}{col 14}{res}{space 2}-.2133938{col 26}{space 2} 1.027041{col 37}{space 1}   -0.21{col 46}{space 3}0.835{col 54}{space 4}-2.226356{col 67}{space 3} 1.799569
{txt}{space 8}L10. {c |}{col 14}{res}{space 2}-.9920378{col 26}{space 2} 1.027815{col 37}{space 1}   -0.97{col 46}{space 3}0.334{col 54}{space 4}-3.006519{col 67}{space 3} 1.022443
{txt}{space 8}L11. {c |}{col 14}{res}{space 2}-.1293712{col 26}{space 2} 1.042999{col 37}{space 1}   -0.12{col 46}{space 3}0.901{col 54}{space 4}-2.173611{col 67}{space 3} 1.914869
{txt}{space 8}L12. {c |}{col 14}{res}{space 2}  2.84894{col 26}{space 2} 1.084093{col 37}{space 1}    2.63{col 46}{space 3}0.009{col 54}{space 4} .7241575{col 67}{space 3} 4.973722
{txt}{space 8}L13. {c |}{col 14}{res}{space 2}-1.093007{col 26}{space 2} 1.119155{col 37}{space 1}   -0.98{col 46}{space 3}0.329{col 54}{space 4} -3.28651{col 67}{space 3} 1.100496
{txt}{space 8}L14. {c |}{col 14}{res}{space 2}-.7681974{col 26}{space 2} 1.098161{col 37}{space 1}   -0.70{col 46}{space 3}0.484{col 54}{space 4}-2.920553{col 67}{space 3} 1.384158
{txt}{space 8}L15. {c |}{col 14}{res}{space 2} 2.776545{col 26}{space 2} 1.083462{col 37}{space 1}    2.56{col 46}{space 3}0.010{col 54}{space 4} .6529992{col 67}{space 3} 4.900091
{txt}{space 8}L16. {c |}{col 14}{res}{space 2}-2.229014{col 26}{space 2} 1.109781{col 37}{space 1}   -2.01{col 46}{space 3}0.045{col 54}{space 4}-4.404145{col 67}{space 3}-.0538837
{txt}{space 8}L17. {c |}{col 14}{res}{space 2} 1.090162{col 26}{space 2} 1.117012{col 37}{space 1}    0.98{col 46}{space 3}0.329{col 54}{space 4} -1.09914{col 67}{space 3} 3.279465
{txt}{space 8}L18. {c |}{col 14}{res}{space 2} 1.199452{col 26}{space 2} 1.094392{col 37}{space 1}    1.10{col 46}{space 3}0.273{col 54}{space 4} -.945517{col 67}{space 3} 3.344421
{txt}{space 8}L19. {c |}{col 14}{res}{space 2} -4.35649{col 26}{space 2} 1.083061{col 37}{space 1}   -4.02{col 46}{space 3}0.000{col 54}{space 4} -6.47925{col 67}{space 3}-2.233729
{txt}{space 8}L20. {c |}{col 14}{res}{space 2} 3.554926{col 26}{space 2} 1.129392{col 37}{space 1}    3.15{col 46}{space 3}0.002{col 54}{space 4} 1.341358{col 67}{space 3} 5.768494
{txt}{space 8}L21. {c |}{col 14}{res}{space 2}-1.563164{col 26}{space 2} 1.157355{col 37}{space 1}   -1.35{col 46}{space 3}0.177{col 54}{space 4}-3.831539{col 67}{space 3} .7052099
{txt}{space 8}L22. {c |}{col 14}{res}{space 2} 1.947172{col 26}{space 2} 1.134656{col 37}{space 1}    1.72{col 46}{space 3}0.086{col 54}{space 4}-.2767127{col 67}{space 3} 4.171057
{txt}{space 8}L23. {c |}{col 14}{res}{space 2}-1.058091{col 26}{space 2} 1.127258{col 37}{space 1}   -0.94{col 46}{space 3}0.348{col 54}{space 4}-3.267475{col 67}{space 3} 1.151293
{txt}{space 8}L24. {c |}{col 14}{res}{space 2}-1.069517{col 26}{space 2} .8351873{col 37}{space 1}   -1.28{col 46}{space 3}0.200{col 54}{space 4}-2.706454{col 67}{space 3} .5674199
{txt}{space 12} {c |}
{space 8}ldem {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} 1.716577{col 26}{space 2} 1.058785{col 37}{space 1}    1.62{col 46}{space 3}0.105{col 54}{space 4}-.3586031{col 67}{space 3} 3.791757
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .4148455{col 26}{space 2} 1.547262{col 37}{space 1}    0.27{col 46}{space 3}0.789{col 54}{space 4}-2.617732{col 67}{space 3} 3.447423
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} -.518808{col 26}{space 2} 1.509813{col 37}{space 1}   -0.34{col 46}{space 3}0.731{col 54}{space 4}-3.477987{col 67}{space 3} 2.440371
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-2.804421{col 26}{space 2} 1.527721{col 37}{space 1}   -1.84{col 46}{space 3}0.066{col 54}{space 4}-5.798699{col 67}{space 3} .1898572
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} 2.721674{col 26}{space 2} 1.530302{col 37}{space 1}    1.78{col 46}{space 3}0.075{col 54}{space 4}-.2776638{col 67}{space 3} 5.721012
{txt}{space 9}L6. {c |}{col 14}{res}{space 2}-.4559891{col 26}{space 2} 1.513997{col 37}{space 1}   -0.30{col 46}{space 3}0.763{col 54}{space 4}-3.423369{col 67}{space 3} 2.511391
{txt}{space 9}L7. {c |}{col 14}{res}{space 2} 1.219858{col 26}{space 2} 1.494102{col 37}{space 1}    0.82{col 46}{space 3}0.414{col 54}{space 4}-1.708528{col 67}{space 3} 4.148243
{txt}{space 9}L8. {c |}{col 14}{res}{space 2}-1.751412{col 26}{space 2} 1.497836{col 37}{space 1}   -1.17{col 46}{space 3}0.242{col 54}{space 4}-4.687116{col 67}{space 3} 1.184292
{txt}{space 9}L9. {c |}{col 14}{res}{space 2}-1.278825{col 26}{space 2} 1.477425{col 37}{space 1}   -0.87{col 46}{space 3}0.387{col 54}{space 4}-4.174526{col 67}{space 3} 1.616875
{txt}{space 8}L10. {c |}{col 14}{res}{space 2} .0588023{col 26}{space 2} 1.479538{col 37}{space 1}    0.04{col 46}{space 3}0.968{col 54}{space 4}-2.841038{col 67}{space 3} 2.958643
{txt}{space 8}L11. {c |}{col 14}{res}{space 2} .7100588{col 26}{space 2} 1.507456{col 37}{space 1}    0.47{col 46}{space 3}0.638{col 54}{space 4}  -2.2445{col 67}{space 3} 3.664618
{txt}{space 8}L12. {c |}{col 14}{res}{space 2} .7468895{col 26}{space 2}  1.53666{col 37}{space 1}    0.49{col 46}{space 3}0.627{col 54}{space 4}-2.264909{col 67}{space 3} 3.758688
{txt}{space 8}L13. {c |}{col 14}{res}{space 2}-1.660323{col 26}{space 2} 1.502702{col 37}{space 1}   -1.10{col 46}{space 3}0.269{col 54}{space 4}-4.605565{col 67}{space 3} 1.284919
{txt}{space 8}L14. {c |}{col 14}{res}{space 2} 1.451499{col 26}{space 2} 1.487506{col 37}{space 1}    0.98{col 46}{space 3}0.329{col 54}{space 4}-1.463958{col 67}{space 3} 4.366956
{txt}{space 8}L15. {c |}{col 14}{res}{space 2} 1.474946{col 26}{space 2} 1.477579{col 37}{space 1}    1.00{col 46}{space 3}0.318{col 54}{space 4}-1.421055{col 67}{space 3} 4.370947
{txt}{space 8}L16. {c |}{col 14}{res}{space 2}-.1329659{col 26}{space 2} 1.430587{col 37}{space 1}   -0.09{col 46}{space 3}0.926{col 54}{space 4}-2.936865{col 67}{space 3} 2.670933
{txt}{space 8}L17. {c |}{col 14}{res}{space 2} -3.25918{col 26}{space 2} 1.431375{col 37}{space 1}   -2.28{col 46}{space 3}0.023{col 54}{space 4}-6.064624{col 67}{space 3}-.4537353
{txt}{space 8}L18. {c |}{col 14}{res}{space 2}  1.71968{col 26}{space 2} 1.446687{col 37}{space 1}    1.19{col 46}{space 3}0.235{col 54}{space 4}-1.115774{col 67}{space 3} 4.555135
{txt}{space 8}L19. {c |}{col 14}{res}{space 2} 1.340075{col 26}{space 2}  1.44333{col 37}{space 1}    0.93{col 46}{space 3}0.353{col 54}{space 4}-1.488799{col 67}{space 3} 4.168949
{txt}{space 8}L20. {c |}{col 14}{res}{space 2}-1.022236{col 26}{space 2} 1.431701{col 37}{space 1}   -0.71{col 46}{space 3}0.475{col 54}{space 4}-3.828318{col 67}{space 3} 1.783846
{txt}{space 8}L21. {c |}{col 14}{res}{space 2} -2.44318{col 26}{space 2} 1.437829{col 37}{space 1}   -1.70{col 46}{space 3}0.089{col 54}{space 4}-5.261274{col 67}{space 3} .3749143
{txt}{space 8}L22. {c |}{col 14}{res}{space 2}  2.24513{col 26}{space 2}  1.41855{col 37}{space 1}    1.58{col 46}{space 3}0.113{col 54}{space 4}-.5351777{col 67}{space 3} 5.025437
{txt}{space 8}L23. {c |}{col 14}{res}{space 2}-1.186083{col 26}{space 2} 1.413321{col 37}{space 1}   -0.84{col 46}{space 3}0.401{col 54}{space 4}-3.956141{col 67}{space 3} 1.583975
{txt}{space 8}L24. {c |}{col 14}{res}{space 2} 1.221674{col 26}{space 2} .9314348{col 37}{space 1}    1.31{col 46}{space 3}0.190{col 54}{space 4}-.6039045{col 67}{space 3} 3.047253
{txt}{space 12} {c |}
{space 8}lrpo {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} 1.124765{col 26}{space 2} .0698116{col 37}{space 1}   16.11{col 46}{space 3}0.000{col 54}{space 4} .9879369{col 67}{space 3} 1.261593
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.1108302{col 26}{space 2} .1062106{col 37}{space 1}   -1.04{col 46}{space 3}0.297{col 54}{space 4}-.3189991{col 67}{space 3} .0973387
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.2607467{col 26}{space 2} .1058418{col 37}{space 1}   -2.46{col 46}{space 3}0.014{col 54}{space 4}-.4681927{col 67}{space 3}-.0533006
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0824458{col 26}{space 2} .1072971{col 37}{space 1}    0.77{col 46}{space 3}0.442{col 54}{space 4}-.1278527{col 67}{space 3} .2927443
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0751608{col 26}{space 2} .1058802{col 37}{space 1}    0.71{col 46}{space 3}0.478{col 54}{space 4}-.1323606{col 67}{space 3} .2826822
{txt}{space 9}L6. {c |}{col 14}{res}{space 2}-.0914134{col 26}{space 2} .1043651{col 37}{space 1}   -0.88{col 46}{space 3}0.381{col 54}{space 4}-.2959652{col 67}{space 3} .1131385
{txt}{space 9}L7. {c |}{col 14}{res}{space 2} .1837921{col 26}{space 2} .1043709{col 37}{space 1}    1.76{col 46}{space 3}0.078{col 54}{space 4} -.020771{col 67}{space 3} .3883552
{txt}{space 9}L8. {c |}{col 14}{res}{space 2}-.1715744{col 26}{space 2} .1040026{col 37}{space 1}   -1.65{col 46}{space 3}0.099{col 54}{space 4}-.3754157{col 67}{space 3} .0322669
{txt}{space 9}L9. {c |}{col 14}{res}{space 2} .0148827{col 26}{space 2} .1039244{col 37}{space 1}    0.14{col 46}{space 3}0.886{col 54}{space 4}-.1888054{col 67}{space 3} .2185708
{txt}{space 8}L10. {c |}{col 14}{res}{space 2} .0941151{col 26}{space 2} .1038348{col 37}{space 1}    0.91{col 46}{space 3}0.365{col 54}{space 4}-.1093975{col 67}{space 3} .2976276
{txt}{space 8}L11. {c |}{col 14}{res}{space 2} .0898423{col 26}{space 2} .1030792{col 37}{space 1}    0.87{col 46}{space 3}0.383{col 54}{space 4}-.1121893{col 67}{space 3} .2918739
{txt}{space 8}L12. {c |}{col 14}{res}{space 2}-.0014507{col 26}{space 2} .1033127{col 37}{space 1}   -0.01{col 46}{space 3}0.989{col 54}{space 4}-.2039399{col 67}{space 3} .2010386
{txt}{space 8}L13. {c |}{col 14}{res}{space 2}-.1540792{col 26}{space 2} .1030878{col 37}{space 1}   -1.49{col 46}{space 3}0.135{col 54}{space 4}-.3561275{col 67}{space 3} .0479692
{txt}{space 8}L14. {c |}{col 14}{res}{space 2} .0434555{col 26}{space 2} .1031773{col 37}{space 1}    0.42{col 46}{space 3}0.674{col 54}{space 4}-.1587683{col 67}{space 3} .2456794
{txt}{space 8}L15. {c |}{col 14}{res}{space 2} .1204982{col 26}{space 2} .1035681{col 37}{space 1}    1.16{col 46}{space 3}0.245{col 54}{space 4}-.0824917{col 67}{space 3}  .323488
{txt}{space 8}L16. {c |}{col 14}{res}{space 2}-.1338556{col 26}{space 2} .1041952{col 37}{space 1}   -1.28{col 46}{space 3}0.199{col 54}{space 4}-.3380744{col 67}{space 3} .0703632
{txt}{space 8}L17. {c |}{col 14}{res}{space 2}-.0034794{col 26}{space 2} .1086265{col 37}{space 1}   -0.03{col 46}{space 3}0.974{col 54}{space 4}-.2163834{col 67}{space 3} .2094246
{txt}{space 8}L18. {c |}{col 14}{res}{space 2} .1365749{col 26}{space 2} .1080593{col 37}{space 1}    1.26{col 46}{space 3}0.206{col 54}{space 4}-.0752175{col 67}{space 3} .3483673
{txt}{space 8}L19. {c |}{col 14}{res}{space 2}-.1302539{col 26}{space 2} .1050466{col 37}{space 1}   -1.24{col 46}{space 3}0.215{col 54}{space 4}-.3361415{col 67}{space 3} .0756337
{txt}{space 8}L20. {c |}{col 14}{res}{space 2} .1908868{col 26}{space 2} .1039098{col 37}{space 1}    1.84{col 46}{space 3}0.066{col 54}{space 4}-.0127726{col 67}{space 3} .3945463
{txt}{space 8}L21. {c |}{col 14}{res}{space 2}-.1359731{col 26}{space 2} .1023172{col 37}{space 1}   -1.33{col 46}{space 3}0.184{col 54}{space 4}-.3365112{col 67}{space 3}  .064565
{txt}{space 8}L22. {c |}{col 14}{res}{space 2}  .094196{col 26}{space 2} .1001325{col 37}{space 1}    0.94{col 46}{space 3}0.347{col 54}{space 4}  -.10206{col 67}{space 3} .2904521
{txt}{space 8}L23. {c |}{col 14}{res}{space 2}  -.15816{col 26}{space 2} .0981424{col 37}{space 1}   -1.61{col 46}{space 3}0.107{col 54}{space 4}-.3505156{col 67}{space 3} .0341957
{txt}{space 8}L24. {c |}{col 14}{res}{space 2} .0376945{col 26}{space 2} .0687324{col 37}{space 1}    0.55{col 46}{space 3}0.583{col 54}{space 4}-.0970186{col 67}{space 3} .1724076
{txt}{space 12} {c |}
{space 10}e1 {c |}
{space 9}--. {c |}{col 14}{res}{space 2}-.0062406{col 26}{space 2} .0043166{col 37}{space 1}   -1.45{col 46}{space 3}0.148{col 54}{space 4}-.0147009{col 67}{space 3} .0022197
{txt}{space 9}L1. {c |}{col 14}{res}{space 2}-.0107449{col 26}{space 2} .0043529{col 37}{space 1}   -2.47{col 46}{space 3}0.014{col 54}{space 4}-.0192764{col 67}{space 3}-.0022134
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0085897{col 26}{space 2}  .004361{col 37}{space 1}   -1.97{col 46}{space 3}0.049{col 54}{space 4}-.0171371{col 67}{space 3}-.0000423
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}-.0064057{col 26}{space 2} .0044138{col 37}{space 1}   -1.45{col 46}{space 3}0.147{col 54}{space 4}-.0150566{col 67}{space 3} .0022451
{txt}{space 9}L4. {c |}{col 14}{res}{space 2}-.0043064{col 26}{space 2} .0045214{col 37}{space 1}   -0.95{col 46}{space 3}0.341{col 54}{space 4}-.0131682{col 67}{space 3} .0045554
{txt}{space 9}L5. {c |}{col 14}{res}{space 2}-.0100156{col 26}{space 2} .0046356{col 37}{space 1}   -2.16{col 46}{space 3}0.031{col 54}{space 4}-.0191012{col 67}{space 3}  -.00093
{txt}{space 9}L6. {c |}{col 14}{res}{space 2}-.0035331{col 26}{space 2} .0045987{col 37}{space 1}   -0.77{col 46}{space 3}0.442{col 54}{space 4}-.0125464{col 67}{space 3} .0054802
{txt}{space 9}L7. {c |}{col 14}{res}{space 2}-.0052877{col 26}{space 2} .0045825{col 37}{space 1}   -1.15{col 46}{space 3}0.249{col 54}{space 4}-.0142692{col 67}{space 3} .0036939
{txt}{space 9}L8. {c |}{col 14}{res}{space 2}  .013763{col 26}{space 2} .0046011{col 37}{space 1}    2.99{col 46}{space 3}0.003{col 54}{space 4}  .004745{col 67}{space 3}  .022781
{txt}{space 9}L9. {c |}{col 14}{res}{space 2} -.002087{col 26}{space 2} .0046243{col 37}{space 1}   -0.45{col 46}{space 3}0.652{col 54}{space 4}-.0111504{col 67}{space 3} .0069764
{txt}{space 8}L10. {c |}{col 14}{res}{space 2} -.003802{col 26}{space 2} .0044589{col 37}{space 1}   -0.85{col 46}{space 3}0.394{col 54}{space 4}-.0125414{col 67}{space 3} .0049373
{txt}{space 8}L11. {c |}{col 14}{res}{space 2}-.0015628{col 26}{space 2} .0041575{col 37}{space 1}   -0.38{col 46}{space 3}0.707{col 54}{space 4}-.0097114{col 67}{space 3} .0065858
{txt}{space 8}L12. {c |}{col 14}{res}{space 2} .0067725{col 26}{space 2} .0041693{col 37}{space 1}    1.62{col 46}{space 3}0.104{col 54}{space 4}-.0013991{col 67}{space 3} .0149441
{txt}{space 8}L13. {c |}{col 14}{res}{space 2}-.0051736{col 26}{space 2} .0039369{col 37}{space 1}   -1.31{col 46}{space 3}0.189{col 54}{space 4}-.0128898{col 67}{space 3} .0025425
{txt}{space 8}L14. {c |}{col 14}{res}{space 2}-.0008206{col 26}{space 2} .0039653{col 37}{space 1}   -0.21{col 46}{space 3}0.836{col 54}{space 4}-.0085924{col 67}{space 3} .0069513
{txt}{space 8}L15. {c |}{col 14}{res}{space 2} .0022372{col 26}{space 2} .0039816{col 37}{space 1}    0.56{col 46}{space 3}0.574{col 54}{space 4}-.0055666{col 67}{space 3} .0100411
{txt}{space 8}L16. {c |}{col 14}{res}{space 2} .0014943{col 26}{space 2} .0038969{col 37}{space 1}    0.38{col 46}{space 3}0.701{col 54}{space 4}-.0061435{col 67}{space 3} .0091322
{txt}{space 8}L17. {c |}{col 14}{res}{space 2}-.0004089{col 26}{space 2} .0038622{col 37}{space 1}   -0.11{col 46}{space 3}0.916{col 54}{space 4}-.0079787{col 67}{space 3} .0071609
{txt}{space 8}L18. {c |}{col 14}{res}{space 2} .0049704{col 26}{space 2} .0038622{col 37}{space 1}    1.29{col 46}{space 3}0.198{col 54}{space 4}-.0025993{col 67}{space 3} .0125402
{txt}{space 8}L19. {c |}{col 14}{res}{space 2} .0019738{col 26}{space 2} .0038755{col 37}{space 1}    0.51{col 46}{space 3}0.611{col 54}{space 4}-.0056222{col 67}{space 3} .0095697
{txt}{space 8}L20. {c |}{col 14}{res}{space 2} .0007615{col 26}{space 2} .0038856{col 37}{space 1}    0.20{col 46}{space 3}0.845{col 54}{space 4}-.0068541{col 67}{space 3} .0083771
{txt}{space 8}L21. {c |}{col 14}{res}{space 2}-.0048318{col 26}{space 2} .0039181{col 37}{space 1}   -1.23{col 46}{space 3}0.218{col 54}{space 4}-.0125112{col 67}{space 3} .0028476
{txt}{space 8}L22. {c |}{col 14}{res}{space 2} .0017003{col 26}{space 2} .0038753{col 37}{space 1}    0.44{col 46}{space 3}0.661{col 54}{space 4}-.0058951{col 67}{space 3} .0092957
{txt}{space 8}L23. {c |}{col 14}{res}{space 2} .0006624{col 26}{space 2} .0038929{col 37}{space 1}    0.17{col 46}{space 3}0.865{col 54}{space 4}-.0069676{col 67}{space 3} .0082924
{txt}{space 8}L24. {c |}{col 14}{res}{space 2}-.0022101{col 26}{space 2} .0037973{col 37}{space 1}   -0.58{col 46}{space 3}0.561{col 54}{space 4}-.0096527{col 67}{space 3} .0052325
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.247087{col 26}{space 2} 1.396718{col 37}{space 1}    2.32{col 46}{space 3}0.020{col 54}{space 4} .5095696{col 67}{space 3} 5.984604
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. irf create varmodel, step(48)
{res}{txt}(file {bf:comparemodels.irf} updated)

{com}. 
. irf graph dm, impulse(e1) response(lrpo)   ///
>   irf(lpmodel varmodel) level(95) name(G2, replace) ///
>     xline(0 10 20 30 40 50, lcolor(blue)) yline(-.05 0 .05 .1, lcolor(blue))
{res}{txt}
{com}. 
. graph export "G2.svg", replace
{txt}{p 0 4 2}
file {bf}
G2.svg{rm}
saved as
SVG
format
{p_end}

{com}. graph export "G2.png", as(png) width(4000) replace
{txt}{p 0 4 2}
file {bf}
G2.png{rm}
saved as
PNG
format
{p_end}

{com}. graph export "G2.pdf", as(pdf) replace
{txt}{p 0 4 2}
file {bf}
G2.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
. /* GPR */
. 
. matrix A = (1,0,0,0\.,1,0,0\.,.,1,0\.,.,.,1)
{txt}
{com}. matlist A
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:c1}{space 1}{space 1}{ralign 9:c2}{space 1}{space 1}{ralign 9:c3}{space 1}{space 1}{ralign 9:c4}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:r1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:r2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:r3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:r4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}

{com}. 
. matrix B = (.,0,0,0\0,.,0,0\0,0,.,0\0,0,0,.) 
{txt}
{com}. matlist B
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:c1}{space 1}{space 1}{ralign 9:c2}{space 1}{space 1}{ralign 9:c3}{space 1}{space 1}{ralign 9:c4}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:r1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:{space 9}}}}{space 1}{space 1}{ralign 9:{res:{sf:{space 9}}}}{space 1}{space 1}{ralign 9:{res:{sf:{space 9}}}}{space 1}
{space 0}{space 0}{ralign 12:r2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:{space 9}}}}{space 1}{space 1}{ralign 9:{res:{sf:{space 9}}}}{space 1}
{space 0}{space 0}{ralign 12:r3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:{space 9}}}}{space 1}
{space 0}{space 0}{ralign 12:r4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}

{com}. 
. svar gprcn lpro ldem lrpo if Period>tm(2000m1), aeq(A) beq(B) ///
> lags(1/24) 
{res}{txt}Estimating short-run parameters
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-1093.1299}  
Iteration 1:{space 2}Log likelihood = {res: 366.84133}  
Iteration 2:{space 2}Log likelihood = {res: 925.91491}  
Iteration 3:{space 2}Log likelihood = {res: 1190.8535}  
Iteration 4:{space 2}Log likelihood = {res: 1559.6293}  
Iteration 5:{space 2}Log likelihood = {res: 1872.7545}  
Iteration 6:{space 2}Log likelihood = {res: 2176.4317}  
Iteration 7:{space 2}Log likelihood = {res:  2281.754}  
Iteration 8:{space 2}Log likelihood = {res: 2324.3724}  
Iteration 9:{space 2}Log likelihood = {res: 2325.2756}  
Iteration 10:{space 1}Log likelihood = {res: 2325.2767}  
Iteration 11:{space 1}Log likelihood = {res: 2325.2767}  
{res}
{txt}Structural vector autoregression

{p 0 7}{space 1}{text:( 1)}{space 1} {res}[/A]1_1 = 1{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} [/A]1_2 = 0{p_end}
{p 0 7}{space 1}{text:( 3)}{space 1} [/A]1_3 = 0{p_end}
{p 0 7}{space 1}{text:( 4)}{space 1} [/A]1_4 = 0{p_end}
{p 0 7}{space 1}{text:( 5)}{space 1} [/A]2_2 = 1{p_end}
{p 0 7}{space 1}{text:( 6)}{space 1} [/A]2_3 = 0{p_end}
{p 0 7}{space 1}{text:( 7)}{space 1} [/A]2_4 = 0{p_end}
{p 0 7}{space 1}{text:( 8)}{space 1} [/A]3_3 = 1{p_end}
{p 0 7}{space 1}{text:( 9)}{space 1} [/A]3_4 = 0{p_end}
{p 0 7}{space 1}{text:(10)}{space 1} [/A]4_4 = 1{p_end}
{p 0 7}{space 1}{text:(11)}{space 1} [/B]1_2 = 0{p_end}
{p 0 7}{space 1}{text:(12)}{space 1} [/B]1_3 = 0{p_end}
{p 0 7}{space 1}{text:(13)}{space 1} [/B]1_4 = 0{p_end}
{p 0 7}{space 1}{text:(14)}{space 1} [/B]2_1 = 0{p_end}
{p 0 7}{space 1}{text:(15)}{space 1} [/B]2_3 = 0{p_end}
{p 0 7}{space 1}{text:(16)}{space 1} [/B]2_4 = 0{p_end}
{p 0 7}{space 1}{text:(17)}{space 1} [/B]3_1 = 0{p_end}
{p 0 7}{space 1}{text:(18)}{space 1} [/B]3_2 = 0{p_end}
{p 0 7}{space 1}{text:(19)}{space 1} [/B]3_4 = 0{p_end}
{p 0 7}{space 1}{text:(20)}{space 1} [/B]4_1 = 0{p_end}
{p 0 7}{space 1}{text:(21)}{space 1} [/B]4_2 = 0{p_end}
{p 0 7}{space 1}{text:(22)}{space 1} [/B]4_3 = 0{p_end}

{col 1}{txt}Sample: {res}2000m2 {txt}thru{res} 2019m12 {txt}{col 49}Number of obs{col 67}= {res}       239
{txt}Exactly identified model{col 49}Log likelihood{col 67}=  {res} 2325.277

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/A           {txt}{c |}
{space 9}1_1 {c |}{col 14}{res}{space 2}        1{col 26}{txt}  (constrained)
{space 9}2_1 {c |}{col 14}{res}{space 2}-.0049828{col 26}{space 2} .0029376{col 37}{space 1}   -1.70{col 46}{space 3}0.090{col 54}{space 4}-.0107404{col 67}{space 3} .0007749
{txt}{space 9}3_1 {c |}{col 14}{res}{space 2} .0020722{col 26}{space 2} .0019717{col 37}{space 1}    1.05{col 46}{space 3}0.293{col 54}{space 4}-.0017923{col 67}{space 3} .0059367
{txt}{space 9}4_1 {c |}{col 14}{res}{space 2} -.012775{col 26}{space 2} .0303738{col 37}{space 1}   -0.42{col 46}{space 3}0.674{col 54}{space 4}-.0723066{col 67}{space 3} .0467566
{txt}{space 9}1_2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_2 {c |}{col 14}{res}{space 2}        1{col 26}{txt}  (constrained)
{space 9}3_2 {c |}{col 14}{res}{space 2} -.101516{col 26}{space 2} .0431567{col 37}{space 1}   -2.35{col 46}{space 3}0.019{col 54}{space 4}-.1861016{col 67}{space 3}-.0169304
{txt}{space 9}4_2 {c |}{col 14}{res}{space 2} 1.783492{col 26}{space 2} .6709258{col 37}{space 1}    2.66{col 46}{space 3}0.008{col 54}{space 4} .4685019{col 67}{space 3} 3.098483
{txt}{space 9}1_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_3 {c |}{col 14}{res}{space 2}        1{col 26}{txt}  (constrained)
{space 9}4_3 {c |}{col 14}{res}{space 2}-2.378802{col 26}{space 2} .9941626{col 37}{space 1}   -2.39{col 46}{space 3}0.017{col 54}{space 4}-4.327325{col 67}{space 3}-.4302789
{txt}{space 9}1_4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}4_4 {c |}{col 14}{res}{space 2}        1{col 26}{txt}  (constrained)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/B           {txt}{c |}
{space 9}1_1 {c |}{col 14}{res}{space 2} .1335812{col 26}{space 2} .0061099{col 37}{space 1}   21.86{col 46}{space 3}0.000{col 54}{space 4} .1216061{col 67}{space 3} .1455563
{txt}{space 9}2_1 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_1 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}4_1 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}1_2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_2 {c |}{col 14}{res}{space 2} .0060665{col 26}{space 2} .0002775{col 37}{space 1}   21.86{col 46}{space 3}0.000{col 54}{space 4} .0055227{col 67}{space 3} .0066104
{txt}{space 9}3_2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}4_2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}1_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_3 {c |}{col 14}{res}{space 2} .0040475{col 26}{space 2} .0001851{col 37}{space 1}   21.86{col 46}{space 3}0.000{col 54}{space 4} .0036847{col 67}{space 3} .0044104
{txt}{space 9}4_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}1_4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}4_4 {c |}{col 14}{res}{space 2} .0622077{col 26}{space 2} .0028453{col 37}{space 1}   21.86{col 46}{space 3}0.000{col 54}{space 4}  .056631{col 67}{space 3} .0677844
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. /* compute the inv(B)*A matrix */
. matrix A=e(A)
{txt}
{com}. matrix B=e(B)
{txt}
{com}. matrix BA = inv(B)*A
{txt}
{com}. /* compute reduced form epsilon_t residuals */
. var gprcn lpro ldem lrpo if Period>tm(2000m1)
{res}
{txt}Vector autoregression

{col 1}Sample: {res}2000m2 {txt}thru{res} 2019m12 {txt}{col 49}Number of obs{col 67}= {res}       239
{txt}Log likelihood =  {res} 2090.976{txt}{col 38}{col 49}AIC{col 67}=  {res}-17.19645
{txt}FPE{col 16}=  {res} 4.00e-13{txt}{col 49}HQIC{col 67}=  {res}-16.98544
{txt}Det(Sigma_ml){col 16}=  {res} 2.96e-13{txt}{col 49}SBIC{col 67}=  {res} -16.6728

{col 1}{text}Equation        {col 18}  Parms{col 26}     RMSE {col 37}   R-sq  {col 47}   chi2   {col 58} P>chi2
{res}{col 1}{text}{hline 17}{hline 8}{hline 11}{hline 10}{hline 11}{hline 7}
{col 1}{text}gprcn           {col 18}{result}     9{col 26}{space 2}  .16742{col 37}{space 1} 0.5224{col 47} 261.3788{col 58} 0.0000
{col 1}{text}lpro            {col 18}{result}     9{col 26}{space 2} .007868{col 37}{space 1} 0.9847{col 47} 15341.54{col 58} 0.0000
{col 1}{text}ldem            {col 18}{result}     9{col 26}{space 2} .005694{col 37}{space 1} 0.9984{col 47} 149979.7{col 58} 0.0000
{col 1}{text}lrpo            {col 18}{result}     9{col 26}{space 2} .080839{col 37}{space 1} 0.9591{col 47} 5600.213{col 58} 0.0000
{col 1}{text}{hline 17}{hline 8}{hline 11}{hline 10}{hline 11}{hline 7}
{res}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}gprcn        {txt}{c |}
{space 7}gprcn {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .4500914{col 26}{space 2} .0620854{col 37}{space 1}    7.25{col 46}{space 3}0.000{col 54}{space 4} .3284062{col 67}{space 3} .5717767
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .1775588{col 26}{space 2} .0620725{col 37}{space 1}    2.86{col 46}{space 3}0.004{col 54}{space 4} .0558989{col 67}{space 3} .2992186
{txt}{space 12} {c |}
{space 8}lpro {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-3.200558{col 26}{space 2} 1.372682{col 37}{space 1}   -2.33{col 46}{space 3}0.020{col 54}{space 4}-5.890966{col 67}{space 3}-.5101505
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} 3.960201{col 26}{space 2} 1.376321{col 37}{space 1}    2.88{col 46}{space 3}0.004{col 54}{space 4} 1.262662{col 67}{space 3}  6.65774
{txt}{space 12} {c |}
{space 8}ldem {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} 1.927062{col 26}{space 2} 1.823162{col 37}{space 1}    1.06{col 46}{space 3}0.291{col 54}{space 4}-1.646271{col 67}{space 3} 5.500395
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}  -1.9184{col 26}{space 2} 1.801013{col 37}{space 1}   -1.07{col 46}{space 3}0.287{col 54}{space 4}-5.448321{col 67}{space 3} 1.611521
{txt}{space 12} {c |}
{space 8}lrpo {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .1292757{col 26}{space 2} .1330733{col 37}{space 1}    0.97{col 46}{space 3}0.331{col 54}{space 4}-.1315432{col 67}{space 3} .3900947
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.1787356{col 26}{space 2} .1316673{col 37}{space 1}   -1.36{col 46}{space 3}0.175{col 54}{space 4}-.4367988{col 67}{space 3} .0793277
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-2.978551{col 26}{space 2} 1.618397{col 37}{space 1}   -1.84{col 46}{space 3}0.066{col 54}{space 4} -6.15055{col 67}{space 3} .1934488
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lpro         {txt}{c |}
{space 7}gprcn {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} -.001069{col 26}{space 2} .0029176{col 37}{space 1}   -0.37{col 46}{space 3}0.714{col 54}{space 4}-.0067874{col 67}{space 3} .0046494
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0015092{col 26}{space 2}  .002917{col 37}{space 1}    0.52{col 46}{space 3}0.605{col 54}{space 4} -.004208{col 67}{space 3} .0072264
{txt}{space 12} {c |}
{space 8}lpro {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .9096059{col 26}{space 2} .0645068{col 37}{space 1}   14.10{col 46}{space 3}0.000{col 54}{space 4} .7831748{col 67}{space 3} 1.036037
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0128948{col 26}{space 2} .0646778{col 37}{space 1}   -0.20{col 46}{space 3}0.842{col 54}{space 4} -.139661{col 67}{space 3} .1138714
{txt}{space 12} {c |}
{space 8}ldem {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .1828189{col 26}{space 2} .0856764{col 37}{space 1}    2.13{col 46}{space 3}0.033{col 54}{space 4} .0148963{col 67}{space 3} .3507415
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.1369852{col 26}{space 2} .0846355{col 37}{space 1}   -1.62{col 46}{space 3}0.106{col 54}{space 4}-.3028678{col 67}{space 3} .0288973
{txt}{space 12} {c |}
{space 8}lrpo {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}  .007536{col 26}{space 2} .0062536{col 37}{space 1}    1.21{col 46}{space 3}0.228{col 54}{space 4}-.0047207{col 67}{space 3} .0197927
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0099852{col 26}{space 2} .0061875{col 37}{space 1}   -1.61{col 46}{space 3}0.107{col 54}{space 4}-.0221124{col 67}{space 3}  .002142
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .2389479{col 26}{space 2} .0760538{col 37}{space 1}    3.14{col 46}{space 3}0.002{col 54}{space 4} .0898853{col 67}{space 3} .3880106
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ldem         {txt}{c |}
{space 7}gprcn {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .0017658{col 26}{space 2} .0021117{col 37}{space 1}    0.84{col 46}{space 3}0.403{col 54}{space 4} -.002373{col 67}{space 3} .0059045
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} -.000872{col 26}{space 2} .0021112{col 37}{space 1}   -0.41{col 46}{space 3}0.680{col 54}{space 4}-.0050099{col 67}{space 3} .0032659
{txt}{space 12} {c |}
{space 8}lpro {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .0935613{col 26}{space 2} .0466877{col 37}{space 1}    2.00{col 46}{space 3}0.045{col 54}{space 4}  .002055{col 67}{space 3} .1850676
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0741439{col 26}{space 2} .0468115{col 37}{space 1}   -1.58{col 46}{space 3}0.113{col 54}{space 4}-.1658927{col 67}{space 3}  .017605
{txt}{space 12} {c |}
{space 8}ldem {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}  1.16219{col 26}{space 2} .0620095{col 37}{space 1}   18.74{col 46}{space 3}0.000{col 54}{space 4} 1.040653{col 67}{space 3} 1.283726
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.1734031{col 26}{space 2} .0612562{col 37}{space 1}   -2.83{col 46}{space 3}0.005{col 54}{space 4} -.293463{col 67}{space 3}-.0533433
{txt}{space 12} {c |}
{space 8}lrpo {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .0231581{col 26}{space 2} .0045261{col 37}{space 1}    5.12{col 46}{space 3}0.000{col 54}{space 4} .0142871{col 67}{space 3} .0320291
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0232409{col 26}{space 2} .0044783{col 37}{space 1}   -5.19{col 46}{space 3}0.000{col 54}{space 4}-.0320182{col 67}{space 3}-.0144637
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0298126{col 26}{space 2}  .055045{col 37}{space 1}   -0.54{col 46}{space 3}0.588{col 54}{space 4}-.1376988{col 67}{space 3} .0780736
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lrpo         {txt}{c |}
{space 7}gprcn {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .0054426{col 26}{space 2} .0299781{col 37}{space 1}    0.18{col 46}{space 3}0.856{col 54}{space 4}-.0533135{col 67}{space 3} .0641986
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0190787{col 26}{space 2} .0299719{col 37}{space 1}   -0.64{col 46}{space 3}0.524{col 54}{space 4}-.0778225{col 67}{space 3} .0396651
{txt}{space 12} {c |}
{space 8}lpro {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.6051497{col 26}{space 2} .6628032{col 37}{space 1}   -0.91{col 46}{space 3}0.361{col 54}{space 4} -1.90422{col 67}{space 3} .6939207
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0453315{col 26}{space 2} .6645601{col 37}{space 1}    0.07{col 46}{space 3}0.946{col 54}{space 4}-1.257182{col 67}{space 3} 1.347845
{txt}{space 12} {c |}
{space 8}ldem {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} 2.463921{col 26}{space 2} .8803188{col 37}{space 1}    2.80{col 46}{space 3}0.005{col 54}{space 4} .7385276{col 67}{space 3} 4.189314
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} -2.17557{col 26}{space 2}  .869624{col 37}{space 1}   -2.50{col 46}{space 3}0.012{col 54}{space 4}-3.880002{col 67}{space 3}-.4711387
{txt}{space 12} {c |}
{space 8}lrpo {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} 1.177965{col 26}{space 2} .0642548{col 37}{space 1}   18.33{col 46}{space 3}0.000{col 54}{space 4} 1.052028{col 67}{space 3} 1.303902
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.2313584{col 26}{space 2} .0635759{col 37}{space 1}   -3.64{col 46}{space 3}0.000{col 54}{space 4}-.3559649{col 67}{space 3}-.1067519
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.239634{col 26}{space 2} .7814471{col 37}{space 1}    1.59{col 46}{space 3}0.113{col 54}{space 4} -.291974{col 67}{space 3} 2.771243
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. capture drop epsilon_*
{txt}
{com}. predict double epsilon_1 if Period>tm(2000m1),residual eq(#1)
{txt}(481 missing values generated)

{com}. predict double epsilon_2 if Period>tm(2000m1),residual eq(#2)
{txt}(481 missing values generated)

{com}. predict double epsilon_3 if Period>tm(2000m1),residual eq(#3)
{txt}(481 missing values generated)

{com}. predict double epsilon_4 if Period>tm(2000m1),residual eq(#4)
{txt}(481 missing values generated)

{com}. /* store the epsilon* variables in the epsilon matrix */
. mkmat epsilon_*, matrix(epsilon_) 
{res}{txt}
{com}. /* compute e_t matrix of structural shocks */
. matrix e_ = (BA*epsilon_')'
{txt}
{com}. /* store columns of e as variables e1, e2, and e3 */  
. svmat double e_
{txt}
{com}. 
. label variable epsilon_1 "Reduced-form shocks - GPR"
{txt}
{com}. label variable e_1 "Structural shocks - GPR"
{txt}
{com}. 
. twoway (tsline e_1 if Period>tm(2000m1)) (tsline epsilon_1 ///
> if Period>tm(2000m1), yaxis(1)), ///
>  name(G3, replace) legend(position(6)) graphregion(margin(r+5))
{res}{txt}
{com}. 
. graph export "G3.svg", as(svg) replace
{txt}{p 0 4 2}
file {bf}
G3.svg{rm}
saved as
SVG
format
{p_end}

{com}. graph export "G3.png", as(png) width(4000) replace
{txt}{p 0 4 2}
file {bf}
G3.png{rm}
saved as
PNG
format
{p_end}

{com}. graph export "G3.pdf", as(pdf) replace
{txt}{p 0 4 2}
file {bf}
G3.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
. irf set comparemodels1.irf, replace
{txt}(file {bf:comparemodels1.irf} created)
(file {bf:comparemodels1.irf} now active)

{com}. quietly lpirf lpro ldem lrpo, step(48) lags(1/24) ///
>   exog(L(0/24).e_1) vce(robust)
{txt}
{com}. irf create lpmodel1
{res}{txt}(file {bf:comparemodels1.irf} updated)

{com}. 
. quietly var lpro ldem lrpo, lags(1/24)            ///
>   exog(L(0/24).e_1)
{txt}
{com}. irf create varmodel1, step(48)
{res}{txt}(file {bf:comparemodels1.irf} updated)

{com}. 
. irf graph dm, impulse(e_1) response(lrpo)   ///
>   irf(lpmodel1 varmodel1) level(95) name(G4, replace) ///
>     xline(0 10 20 30 40 50, lcolor(blue)) yline(-.05 0 .05 .1, lcolor(blue))
{res}{txt}
{com}. 
. graph export "G4.svg", replace
{txt}{p 0 4 2}
file {bf}
G4.svg{rm}
saved as
SVG
format
{p_end}

{com}. graph export "G4.png", as(png) width(4000) replace
{txt}{p 0 4 2}
file {bf}
G4.png{rm}
saved as
PNG
format
{p_end}

{com}. graph export "G4.pdf", as(pdf) replace
{txt}{p 0 4 2}
file {bf}
G4.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
. twoway (tsline e1 if Period>tm(2000m1)) (tsline e_1 ///
> if Period>tm(2000m1), yaxis(1)), ///
>  name(G5, replace) legend(position(6)) graphregion(margin(r+5))
{res}{txt}
{com}. 
. graph export "G5.svg", replace
{txt}{p 0 4 2}
file {bf}
G5.svg{rm}
saved as
SVG
format
{p_end}

{com}. graph export "G5.png", as(png) width(4000) replace
{txt}{p 0 4 2}
file {bf}
G5.png{rm}
saved as
PNG
format
{p_end}

{com}. graph export "G5.pdf", as(pdf) replace
{txt}{p 0 4 2}
file {bf}
G5.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
. pwcorr lrpo e1 e_1, obs sig listwise star(5) sidak

             {txt}{c |}     lrpo       e1      e_1
{hline 13}{c +}{hline 27}
        lrpo {c |} {res}  1.0000 
             {txt}{c |}
             {c |}{res}      239
             {txt}{c |}
          e1 {c |} {res} -0.0304   1.0000 
             {txt}{c |}{res}   0.9536
             {txt}{c |}{res}      239      239
             {txt}{c |}
         e_1 {c |} {res} -0.0073   0.0693   1.0000 
             {txt}{c |}{res}   0.9993   0.6364
             {txt}{c |}{res}      239      239      239
             {txt}{c |}

{com}. 
. twoway (scatter lrpo e1) (lfit lrpo e1), name(G6, replace)
{res}{txt}
{com}. graph export "G6.svg", replace
{txt}{p 0 4 2}
file {bf}
G6.svg{rm}
saved as
SVG
format
{p_end}

{com}. graph export "G6.png", as(png) width(4000) replace
{txt}{p 0 4 2}
file {bf}
G6.png{rm}
saved as
PNG
format
{p_end}

{com}. graph export "G6.pdf", as(pdf) replace
{txt}{p 0 4 2}
file {bf}
G6.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
. twoway (scatter lrpo e_1) (lfit lrpo e_1), name(G7, replace)
{res}{txt}
{com}. graph export "G7.svg", replace
{txt}{p 0 4 2}
file {bf}
G7.svg{rm}
saved as
SVG
format
{p_end}

{com}. graph export "G7.png", as(png) width(4000) replace
{txt}{p 0 4 2}
file {bf}
G7.png{rm}
saved as
PNG
format
{p_end}

{com}. graph export "G7.pdf", as(pdf) replace
{txt}{p 0 4 2}
file {bf}
G7.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
. save lpirf_PRI_GPR, replace
{txt}{p 0 4 2}
file {bf}
lpirf_PRI_GPR.dta{rm}
saved
{p_end}

{com}. 
. ****************************************************************
. **# Robustness with IGREA **************************************
. ****************************************************************
. 
. matrix A = (1,0,0,0\.,1,0,0\.,.,1,0\.,.,.,1)
{txt}
{com}. matlist A
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:c1}{space 1}{space 1}{ralign 9:c2}{space 1}{space 1}{ralign 9:c3}{space 1}{space 1}{ralign 9:c4}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:r1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:r2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:r3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:r4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}

{com}. 
. matrix B = (.,0,0,0\0,.,0,0\0,0,.,0\0,0,0,.) 
{txt}
{com}. matlist B
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:c1}{space 1}{space 1}{ralign 9:c2}{space 1}{space 1}{ralign 9:c3}{space 1}{space 1}{ralign 9:c4}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:r1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:{space 9}}}}{space 1}{space 1}{ralign 9:{res:{sf:{space 9}}}}{space 1}{space 1}{ralign 9:{res:{sf:{space 9}}}}{space 1}
{space 0}{space 0}{ralign 12:r2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:{space 9}}}}{space 1}{space 1}{ralign 9:{res:{sf:{space 9}}}}{space 1}
{space 0}{space 0}{ralign 12:r3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:{space 9}}}}{space 1}
{space 0}{space 0}{ralign 12:r4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}

{com}. 
. svar lpri lpro ligrea lrpo if Period>tm(2000m1), aeq(A) beq(B) ///
> lags(1/24) 
{res}{txt}Estimating short-run parameters
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-1291.7798}  
Iteration 1:{space 2}Log likelihood = {res:-161.03225}  
Iteration 2:{space 2}Log likelihood = {res: 92.968259}  
Iteration 3:{space 2}Log likelihood = {res: 659.74678}  
Iteration 4:{space 2}Log likelihood = {res: 724.00374}  
Iteration 5:{space 2}Log likelihood = {res: 903.35393}  
Iteration 6:{space 2}Log likelihood = {res:   1123.45}  
Iteration 7:{space 2}Log likelihood = {res: 1140.2874}  
Iteration 8:{space 2}Log likelihood = {res: 1141.2526}  
Iteration 9:{space 2}Log likelihood = {res: 1141.2566}  
Iteration 10:{space 1}Log likelihood = {res: 1141.2566}  
{res}
{txt}Structural vector autoregression

{p 0 7}{space 1}{text:( 1)}{space 1} {res}[/A]1_1 = 1{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} [/A]1_2 = 0{p_end}
{p 0 7}{space 1}{text:( 3)}{space 1} [/A]1_3 = 0{p_end}
{p 0 7}{space 1}{text:( 4)}{space 1} [/A]1_4 = 0{p_end}
{p 0 7}{space 1}{text:( 5)}{space 1} [/A]2_2 = 1{p_end}
{p 0 7}{space 1}{text:( 6)}{space 1} [/A]2_3 = 0{p_end}
{p 0 7}{space 1}{text:( 7)}{space 1} [/A]2_4 = 0{p_end}
{p 0 7}{space 1}{text:( 8)}{space 1} [/A]3_3 = 1{p_end}
{p 0 7}{space 1}{text:( 9)}{space 1} [/A]3_4 = 0{p_end}
{p 0 7}{space 1}{text:(10)}{space 1} [/A]4_4 = 1{p_end}
{p 0 7}{space 1}{text:(11)}{space 1} [/B]1_2 = 0{p_end}
{p 0 7}{space 1}{text:(12)}{space 1} [/B]1_3 = 0{p_end}
{p 0 7}{space 1}{text:(13)}{space 1} [/B]1_4 = 0{p_end}
{p 0 7}{space 1}{text:(14)}{space 1} [/B]2_1 = 0{p_end}
{p 0 7}{space 1}{text:(15)}{space 1} [/B]2_3 = 0{p_end}
{p 0 7}{space 1}{text:(16)}{space 1} [/B]2_4 = 0{p_end}
{p 0 7}{space 1}{text:(17)}{space 1} [/B]3_1 = 0{p_end}
{p 0 7}{space 1}{text:(18)}{space 1} [/B]3_2 = 0{p_end}
{p 0 7}{space 1}{text:(19)}{space 1} [/B]3_4 = 0{p_end}
{p 0 7}{space 1}{text:(20)}{space 1} [/B]4_1 = 0{p_end}
{p 0 7}{space 1}{text:(21)}{space 1} [/B]4_2 = 0{p_end}
{p 0 7}{space 1}{text:(22)}{space 1} [/B]4_3 = 0{p_end}

{col 1}{txt}Sample: {res}2000m2 {txt}thru{res} 2019m12 {txt}{col 49}Number of obs{col 67}= {res}       239
{txt}Exactly identified model{col 49}Log likelihood{col 67}=  {res} 1141.257

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/A           {txt}{c |}
{space 9}1_1 {c |}{col 14}{res}{space 2}        1{col 26}{txt}  (constrained)
{space 9}2_1 {c |}{col 14}{res}{space 2}-.0118214{col 26}{space 2} .0040088{col 37}{space 1}   -2.95{col 46}{space 3}0.003{col 54}{space 4}-.0196785{col 67}{space 3}-.0039643
{txt}{space 9}3_1 {c |}{col 14}{res}{space 2}-.3751618{col 26}{space 2} .8868091{col 37}{space 1}   -0.42{col 46}{space 3}0.672{col 54}{space 4}-2.113276{col 67}{space 3} 1.362952
{txt}{space 9}4_1 {c |}{col 14}{res}{space 2}  .097546{col 26}{space 2} .0481201{col 37}{space 1}    2.03{col 46}{space 3}0.043{col 54}{space 4} .0032322{col 67}{space 3} .1918597
{txt}{space 9}1_2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_2 {c |}{col 14}{res}{space 2}        1{col 26}{txt}  (constrained)
{space 9}3_2 {c |}{col 14}{res}{space 2} 14.41956{col 26}{space 2} 14.05586{col 37}{space 1}    1.03{col 46}{space 3}0.305{col 54}{space 4}-13.12942{col 67}{space 3} 41.96853
{txt}{space 9}4_2 {c |}{col 14}{res}{space 2} 1.104209{col 26}{space 2} .7640921{col 37}{space 1}    1.45{col 46}{space 3}0.148{col 54}{space 4}-.3933836{col 67}{space 3} 2.601802
{txt}{space 9}1_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_3 {c |}{col 14}{res}{space 2}        1{col 26}{txt}  (constrained)
{space 9}4_3 {c |}{col 14}{res}{space 2}-.0052758{col 26}{space 2} .0035086{col 37}{space 1}   -1.50{col 46}{space 3}0.133{col 54}{space 4}-.0121525{col 67}{space 3}  .001601
{txt}{space 9}1_4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}4_4 {c |}{col 14}{res}{space 2}        1{col 26}{txt}  (constrained)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/B           {txt}{c |}
{space 9}1_1 {c |}{col 14}{res}{space 2} .0829924{col 26}{space 2}  .003796{col 37}{space 1}   21.86{col 46}{space 3}0.000{col 54}{space 4} .0755524{col 67}{space 3} .0904324
{txt}{space 9}2_1 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_1 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}4_1 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}1_2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_2 {c |}{col 14}{res}{space 2} .0051434{col 26}{space 2} .0002353{col 37}{space 1}   21.86{col 46}{space 3}0.000{col 54}{space 4} .0046823{col 67}{space 3} .0056045
{txt}{space 9}3_2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}4_2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}1_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_3 {c |}{col 14}{res}{space 2} 1.117653{col 26}{space 2} .0511203{col 37}{space 1}   21.86{col 46}{space 3}0.000{col 54}{space 4} 1.017459{col 67}{space 3} 1.217847
{txt}{space 9}4_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}1_4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}4_4 {c |}{col 14}{res}{space 2} .0606235{col 26}{space 2} .0027729{col 37}{space 1}   21.86{col 46}{space 3}0.000{col 54}{space 4} .0551888{col 67}{space 3} .0660582
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. /* compute the inv(B)*A matrix */
. matrix A=e(A)
{txt}
{com}. matrix B=e(B)
{txt}
{com}. matrix BA = inv(B)*A
{txt}
{com}. /* compute reduced form epsilon_t residuals */
. var lpri lpro ligrea lrpo if Period>tm(2000m1)
{res}
{txt}Vector autoregression

{col 1}Sample: {res}2000m2 {txt}thru{res} 2019m12 {txt}{col 49}Number of obs{col 67}= {res}       239
{txt}Log likelihood =  {res} 848.3584{txt}{col 38}{col 49}AIC{col 67}=  {res}-6.797979
{txt}FPE{col 16}=  {res} 1.31e-08{txt}{col 49}HQIC{col 67}=  {res}-6.586961
{txt}Det(Sigma_ml){col 16}=  {res} 9.70e-09{txt}{col 49}SBIC{col 67}=  {res}-6.274327

{col 1}{text}Equation        {col 18}  Parms{col 26}     RMSE {col 37}   R-sq  {col 47}   chi2   {col 58} P>chi2
{res}{col 1}{text}{hline 17}{hline 8}{hline 11}{hline 10}{hline 11}{hline 7}
{col 1}{text}lpri            {col 18}{result}     9{col 26}{space 2} .114594{col 37}{space 1} 0.9830{col 47} 13804.51{col 58} 0.0000
{col 1}{text}lpro            {col 18}{result}     9{col 26}{space 2} .008001{col 37}{space 1} 0.9841{col 47} 14825.52{col 58} 0.0000
{col 1}{text}ligrea          {col 18}{result}     9{col 26}{space 2} 1.47542{col 37}{space 1} 0.8577{col 47} 1440.013{col 58} 0.0000
{col 1}{text}lrpo            {col 18}{result}     9{col 26}{space 2} .081359{col 37}{space 1} 0.9585{col 47} 5525.825{col 58} 0.0000
{col 1}{text}{hline 17}{hline 8}{hline 11}{hline 10}{hline 11}{hline 7}
{res}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lpri         {txt}{c |}
{space 8}lpri {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} 1.031543{col 26}{space 2}  .065542{col 37}{space 1}   15.74{col 46}{space 3}0.000{col 54}{space 4} .9030827{col 67}{space 3} 1.160003
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0488196{col 26}{space 2} .0655629{col 37}{space 1}   -0.74{col 46}{space 3}0.456{col 54}{space 4}-.1773204{col 67}{space 3} .0796813
{txt}{space 12} {c |}
{space 8}lpro {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} -.543099{col 26}{space 2} .9221104{col 37}{space 1}   -0.59{col 46}{space 3}0.556{col 54}{space 4}-2.350402{col 67}{space 3} 1.264204
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0585194{col 26}{space 2} .9262575{col 37}{space 1}    0.06{col 46}{space 3}0.950{col 54}{space 4}-1.756912{col 67}{space 3} 1.873951
{txt}{space 12} {c |}
{space 6}ligrea {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} -.001409{col 26}{space 2} .0050594{col 37}{space 1}   -0.28{col 46}{space 3}0.781{col 54}{space 4}-.0113253{col 67}{space 3} .0085073
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}  .001189{col 26}{space 2} .0050561{col 37}{space 1}    0.24{col 46}{space 3}0.814{col 54}{space 4}-.0087207{col 67}{space 3} .0110988
{txt}{space 12} {c |}
{space 8}lrpo {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .0609772{col 26}{space 2} .0891623{col 37}{space 1}    0.68{col 46}{space 3}0.494{col 54}{space 4}-.1137777{col 67}{space 3} .2357321
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0005068{col 26}{space 2} .0894578{col 37}{space 1}   -0.01{col 46}{space 3}0.995{col 54}{space 4}-.1758408{col 67}{space 3} .1748272
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.890857{col 26}{space 2} .6390209{col 37}{space 1}    2.96{col 46}{space 3}0.003{col 54}{space 4} .6383992{col 67}{space 3} 3.143315
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lpro         {txt}{c |}
{space 8}lpri {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}  .004347{col 26}{space 2} .0045763{col 37}{space 1}    0.95{col 46}{space 3}0.342{col 54}{space 4}-.0046224{col 67}{space 3} .0133163
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0048775{col 26}{space 2} .0045777{col 37}{space 1}   -1.07{col 46}{space 3}0.287{col 54}{space 4}-.0138496{col 67}{space 3} .0040947
{txt}{space 12} {c |}
{space 8}lpro {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .9592392{col 26}{space 2} .0643836{col 37}{space 1}   14.90{col 46}{space 3}0.000{col 54}{space 4} .8330497{col 67}{space 3} 1.085429
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0331146{col 26}{space 2} .0646732{col 37}{space 1}    0.51{col 46}{space 3}0.609{col 54}{space 4}-.0936425{col 67}{space 3} .1598716
{txt}{space 12} {c |}
{space 6}ligrea {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .0005136{col 26}{space 2} .0003533{col 37}{space 1}    1.45{col 46}{space 3}0.146{col 54}{space 4}-.0001788{col 67}{space 3} .0012059
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0003914{col 26}{space 2}  .000353{col 37}{space 1}   -1.11{col 46}{space 3}0.268{col 54}{space 4}-.0010834{col 67}{space 3} .0003005
{txt}{space 12} {c |}
{space 8}lrpo {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .0126148{col 26}{space 2} .0062255{col 37}{space 1}    2.03{col 46}{space 3}0.043{col 54}{space 4}  .000413{col 67}{space 3} .0248165
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0116823{col 26}{space 2} .0062461{col 37}{space 1}   -1.87{col 46}{space 3}0.061{col 54}{space 4}-.0239245{col 67}{space 3} .0005599
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0311188{col 26}{space 2} .0446177{col 37}{space 1}    0.70{col 46}{space 3}0.486{col 54}{space 4}-.0563304{col 67}{space 3} .1185679
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ligrea       {txt}{c |}
{space 8}lpri {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} 1.191882{col 26}{space 2} .8438633{col 37}{space 1}    1.41{col 46}{space 3}0.158{col 54}{space 4}-.4620597{col 67}{space 3} 2.845824
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-1.205254{col 26}{space 2} .8441316{col 37}{space 1}   -1.43{col 46}{space 3}0.153{col 54}{space 4}-2.859722{col 67}{space 3} .4492131
{txt}{space 12} {c |}
{space 8}lpro {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-9.122932{col 26}{space 2} 11.87231{col 37}{space 1}   -0.77{col 46}{space 3}0.442{col 54}{space 4}-32.39223{col 67}{space 3} 14.14637
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} 6.247787{col 26}{space 2}  11.9257{col 37}{space 1}    0.52{col 46}{space 3}0.600{col 54}{space 4}-17.12616{col 67}{space 3} 29.62174
{txt}{space 12} {c |}
{space 6}ligrea {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .8977231{col 26}{space 2} .0651407{col 37}{space 1}   13.78{col 46}{space 3}0.000{col 54}{space 4} .7700496{col 67}{space 3} 1.025396
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0026164{col 26}{space 2}  .065098{col 37}{space 1}    0.04{col 46}{space 3}0.968{col 54}{space 4}-.1249734{col 67}{space 3} .1302061
{txt}{space 12} {c |}
{space 8}lrpo {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} 1.486564{col 26}{space 2} 1.147978{col 37}{space 1}    1.29{col 46}{space 3}0.195{col 54}{space 4}-.7634315{col 67}{space 3}  3.73656
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-1.511413{col 26}{space 2} 1.151782{col 37}{space 1}   -1.31{col 46}{space 3}0.189{col 54}{space 4}-3.768865{col 67}{space 3} .7460383
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 12.52106{col 26}{space 2} 8.227491{col 37}{space 1}    1.52{col 46}{space 3}0.128{col 54}{space 4}-3.604523{col 67}{space 3} 28.64665
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lrpo         {txt}{c |}
{space 8}lpri {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} -.035083{col 26}{space 2} .0465331{col 37}{space 1}   -0.75{col 46}{space 3}0.451{col 54}{space 4}-.1262861{col 67}{space 3} .0561202
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0464267{col 26}{space 2} .0465479{col 37}{space 1}    1.00{col 46}{space 3}0.319{col 54}{space 4}-.0448055{col 67}{space 3} .1376588
{txt}{space 12} {c |}
{space 8}lpro {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.0006364{col 26}{space 2} .6546737{col 37}{space 1}   -0.00{col 46}{space 3}0.999{col 54}{space 4}-1.283773{col 67}{space 3}   1.2825
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .1314577{col 26}{space 2}  .657618{col 37}{space 1}    0.20{col 46}{space 3}0.842{col 54}{space 4} -1.15745{col 67}{space 3} 1.420365
{txt}{space 12} {c |}
{space 6}ligrea {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .0049832{col 26}{space 2}  .003592{col 37}{space 1}    1.39{col 46}{space 3}0.165{col 54}{space 4}-.0020571{col 67}{space 3} .0120235
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} -.001918{col 26}{space 2} .0035897{col 37}{space 1}   -0.53{col 46}{space 3}0.593{col 54}{space 4}-.0089536{col 67}{space 3} .0051177
{txt}{space 12} {c |}
{space 8}lrpo {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} 1.204628{col 26}{space 2} .0633029{col 37}{space 1}   19.03{col 46}{space 3}0.000{col 54}{space 4} 1.080557{col 67}{space 3} 1.328699
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.2588484{col 26}{space 2} .0635126{col 37}{space 1}   -4.08{col 46}{space 3}0.000{col 54}{space 4}-.3833308{col 67}{space 3}-.1343659
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.3904982{col 26}{space 2} .4536877{col 37}{space 1}   -0.86{col 46}{space 3}0.389{col 54}{space 4} -1.27971{col 67}{space 3} .4987134
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. capture drop upsilon*
{txt}
{com}. predict double upsilon1 if Period>tm(2000m1),residual eq(#1)
{txt}(481 missing values generated)

{com}. predict double upsilon2 if Period>tm(2000m1),residual eq(#2)
{txt}(481 missing values generated)

{com}. predict double upsilon3 if Period>tm(2000m1),residual eq(#3)
{txt}(481 missing values generated)

{com}. predict double upsilon4 if Period>tm(2000m1),residual eq(#4)
{txt}(481 missing values generated)

{com}. /* store the epsilon* variables in the epsilon matrix */
. mkmat upsilon*, matrix(upsilon) 
{res}{txt}
{com}. /* compute e_t matrix of structural shocks */
. matrix u = (BA*upsilon')'
{txt}
{com}. /* store columns of e as variables e1, e2, and e3 */  
. svmat double u
{txt}
{com}. 
. label variable upsilon1 "Reduced-form shocks - PRI (Robustness)"
{txt}
{com}. label variable u1 "Structural shocks - PRI (Robustness)"
{txt}
{com}. 
. twoway (tsline u1 if Period>tm(2000m1)) (tsline upsilon1 ///
> if Period>tm(2000m1), yaxis(1)), ///
>  name(G1R, replace) legend(position(6)) graphregion(margin(r+5))
{res}{txt}
{com}.  
. graph export "G1R.svg", replace
{txt}{p 0 4 2}
file {bf}
G1R.svg{rm}
saved as
SVG
format
{p_end}

{com}. graph export "G1R.png", as(png) width(4000) replace
{txt}{p 0 4 2}
file {bf}
G1R.png{rm}
saved as
PNG
format
{p_end}

{com}. graph export "G1R.pdf", as(pdf) replace
{txt}{p 0 4 2}
file {bf}
G1R.pdf{rm}
saved as
PDF
format
{p_end}

{com}.  
. irf set comparemodels.irf, replace
{txt}(file {bf:comparemodels.irf} created)
(file {bf:comparemodels.irf} now active)

{com}. quietly lpirf lpro ligrea lrpo, step(48) lags(1/24) ///
>   exog(L(0/24).u1) vce(robust)
{txt}
{com}. irf create lpmodel 
{res}{txt}(file {bf:comparemodels.irf} updated)

{com}. 
. quietly var lpro ligrea lrpo, lags(1/24)            ///
>   exog(L(0/24).u1)
{txt}
{com}. irf create varmodel, step(48)
{res}{txt}(file {bf:comparemodels.irf} updated)

{com}. 
. irf graph dm, impulse(u1) response(lrpo)   ///
>   irf(lpmodel varmodel) level(95) name(G2R, replace) ///
>     xline(0 10 20 30 40 50, lcolor(blue)) yline(-.05 0 .05 .1, lcolor(blue))
{res}{txt}
{com}. 
. graph export "G2R.svg", replace
{txt}{p 0 4 2}
file {bf}
G2R.svg{rm}
saved as
SVG
format
{p_end}

{com}. graph export "G2R.png", as(png) width(4000) replace
{txt}{p 0 4 2}
file {bf}
G2R.png{rm}
saved as
PNG
format
{p_end}

{com}. graph export "G2R.pdf", as(pdf) replace
{txt}{p 0 4 2}
file {bf}
G2R.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
. /* GPR */
. 
. matrix A = (1,0,0,0\.,1,0,0\.,.,1,0\.,.,.,1)
{txt}
{com}. matlist A
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:c1}{space 1}{space 1}{ralign 9:c2}{space 1}{space 1}{ralign 9:c3}{space 1}{space 1}{ralign 9:c4}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:r1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:r2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:r3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:r4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}

{com}. 
. matrix B = (.,0,0,0\0,.,0,0\0,0,.,0\0,0,0,.) 
{txt}
{com}. matlist B
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:c1}{space 1}{space 1}{ralign 9:c2}{space 1}{space 1}{ralign 9:c3}{space 1}{space 1}{ralign 9:c4}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}{hline 10}
{space 0}{space 0}{ralign 12:r1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:{space 9}}}}{space 1}{space 1}{ralign 9:{res:{sf:{space 9}}}}{space 1}{space 1}{ralign 9:{res:{sf:{space 9}}}}{space 1}
{space 0}{space 0}{ralign 12:r2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:{space 9}}}}{space 1}{space 1}{ralign 9:{res:{sf:{space 9}}}}{space 1}
{space 0}{space 0}{ralign 12:r3}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}{space 1}{ralign 9:{res:{sf:{space 9}}}}{space 1}
{space 0}{space 0}{ralign 12:r4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        .}}}{space 1}

{com}. 
. svar gprcn lpro ligrea lrpo if Period>tm(2000m1), aeq(A) beq(B) ///
> lags(1/24) 
{res}{txt}Estimating short-run parameters
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-1294.2116}  
Iteration 1:{space 2}Log likelihood = {res:-484.18673}  
Iteration 2:{space 2}Log likelihood = {res:-404.56558}  
Iteration 3:{space 2}Log likelihood = {res:-194.34599}  
Iteration 4:{space 2}Log likelihood = {res: 187.25055}  
Iteration 5:{space 2}Log likelihood = {res:  588.0996}  
Iteration 6:{space 2}Log likelihood = {res: 855.64494}  
Iteration 7:{space 2}Log likelihood = {res: 987.12974}  
Iteration 8:{space 2}Log likelihood = {res: 1005.7811}  
Iteration 9:{space 2}Log likelihood = {res: 1006.5395}  
Iteration 10:{space 1}Log likelihood = {res: 1006.5401}  
Iteration 11:{space 1}Log likelihood = {res: 1006.5401}  
{res}
{txt}Structural vector autoregression

{p 0 7}{space 1}{text:( 1)}{space 1} {res}[/A]1_1 = 1{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} [/A]1_2 = 0{p_end}
{p 0 7}{space 1}{text:( 3)}{space 1} [/A]1_3 = 0{p_end}
{p 0 7}{space 1}{text:( 4)}{space 1} [/A]1_4 = 0{p_end}
{p 0 7}{space 1}{text:( 5)}{space 1} [/A]2_2 = 1{p_end}
{p 0 7}{space 1}{text:( 6)}{space 1} [/A]2_3 = 0{p_end}
{p 0 7}{space 1}{text:( 7)}{space 1} [/A]2_4 = 0{p_end}
{p 0 7}{space 1}{text:( 8)}{space 1} [/A]3_3 = 1{p_end}
{p 0 7}{space 1}{text:( 9)}{space 1} [/A]3_4 = 0{p_end}
{p 0 7}{space 1}{text:(10)}{space 1} [/A]4_4 = 1{p_end}
{p 0 7}{space 1}{text:(11)}{space 1} [/B]1_2 = 0{p_end}
{p 0 7}{space 1}{text:(12)}{space 1} [/B]1_3 = 0{p_end}
{p 0 7}{space 1}{text:(13)}{space 1} [/B]1_4 = 0{p_end}
{p 0 7}{space 1}{text:(14)}{space 1} [/B]2_1 = 0{p_end}
{p 0 7}{space 1}{text:(15)}{space 1} [/B]2_3 = 0{p_end}
{p 0 7}{space 1}{text:(16)}{space 1} [/B]2_4 = 0{p_end}
{p 0 7}{space 1}{text:(17)}{space 1} [/B]3_1 = 0{p_end}
{p 0 7}{space 1}{text:(18)}{space 1} [/B]3_2 = 0{p_end}
{p 0 7}{space 1}{text:(19)}{space 1} [/B]3_4 = 0{p_end}
{p 0 7}{space 1}{text:(20)}{space 1} [/B]4_1 = 0{p_end}
{p 0 7}{space 1}{text:(21)}{space 1} [/B]4_2 = 0{p_end}
{p 0 7}{space 1}{text:(22)}{space 1} [/B]4_3 = 0{p_end}

{col 1}{txt}Sample: {res}2000m2 {txt}thru{res} 2019m12 {txt}{col 49}Number of obs{col 67}= {res}       239
{txt}Exactly identified model{col 49}Log likelihood{col 67}=  {res}  1006.54

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/A           {txt}{c |}
{space 9}1_1 {c |}{col 14}{res}{space 2}        1{col 26}{txt}  (constrained)
{space 9}2_1 {c |}{col 14}{res}{space 2}-.0079562{col 26}{space 2} .0026317{col 37}{space 1}   -3.02{col 46}{space 3}0.003{col 54}{space 4}-.0131142{col 67}{space 3}-.0027981
{txt}{space 9}3_1 {c |}{col 14}{res}{space 2}-.3761626{col 26}{space 2} .5528259{col 37}{space 1}   -0.68{col 46}{space 3}0.496{col 54}{space 4}-1.459681{col 67}{space 3} .7073563
{txt}{space 9}4_1 {c |}{col 14}{res}{space 2} .0054321{col 26}{space 2} .0317605{col 37}{space 1}    0.17{col 46}{space 3}0.864{col 54}{space 4}-.0568173{col 67}{space 3} .0676815
{txt}{space 9}1_2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_2 {c |}{col 14}{res}{space 2}        1{col 26}{txt}  (constrained)
{space 9}3_2 {c |}{col 14}{res}{space 2} 9.810127{col 26}{space 2} 13.33532{col 37}{space 1}    0.74{col 46}{space 3}0.462{col 54}{space 4}-16.32662{col 67}{space 3} 35.94688
{txt}{space 9}4_2 {c |}{col 14}{res}{space 2} 1.196497{col 26}{space 2} .7662548{col 37}{space 1}    1.56{col 46}{space 3}0.118{col 54}{space 4}-.3053345{col 67}{space 3} 2.698329
{txt}{space 9}1_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_3 {c |}{col 14}{res}{space 2}        1{col 26}{txt}  (constrained)
{space 9}4_3 {c |}{col 14}{res}{space 2}-.0038824{col 26}{space 2} .0037126{col 37}{space 1}   -1.05{col 46}{space 3}0.296{col 54}{space 4} -.011159{col 67}{space 3} .0033942
{txt}{space 9}1_4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}4_4 {c |}{col 14}{res}{space 2}        1{col 26}{txt}  (constrained)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/B           {txt}{c |}
{space 9}1_1 {c |}{col 14}{res}{space 2} .1326207{col 26}{space 2} .0060659{col 37}{space 1}   21.86{col 46}{space 3}0.000{col 54}{space 4} .1207317{col 67}{space 3} .1445097
{txt}{space 9}2_1 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_1 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}4_1 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}1_2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_2 {c |}{col 14}{res}{space 2} .0053957{col 26}{space 2} .0002468{col 37}{space 1}   21.86{col 46}{space 3}0.000{col 54}{space 4}  .004912{col 67}{space 3} .0058794
{txt}{space 9}3_2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}4_2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}1_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_3 {c |}{col 14}{res}{space 2}  1.11237{col 26}{space 2} .0508786{col 37}{space 1}   21.86{col 46}{space 3}0.000{col 54}{space 4}  1.01265{col 67}{space 3}  1.21209
{txt}{space 9}4_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}1_4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}4_4 {c |}{col 14}{res}{space 2} .0638452{col 26}{space 2} .0029202{col 37}{space 1}   21.86{col 46}{space 3}0.000{col 54}{space 4} .0581216{col 67}{space 3} .0695687
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. /* compute the inv(B)*A matrix */
. matrix A=e(A)
{txt}
{com}. matrix B=e(B)
{txt}
{com}. matrix BA = inv(B)*A
{txt}
{com}. /* compute reduced form epsilon_t residuals */
. var gprcn lpro ligrea lrpo if Period>tm(2000m1)
{res}
{txt}Vector autoregression

{col 1}Sample: {res}2000m2 {txt}thru{res} 2019m12 {txt}{col 49}Number of obs{col 67}= {res}       239
{txt}Log likelihood =  {res} 752.5675{txt}{col 38}{col 49}AIC{col 67}=  {res}-5.996381
{txt}FPE{col 16}=  {res} 2.92e-08{txt}{col 49}HQIC{col 67}=  {res}-5.785364
{txt}Det(Sigma_ml){col 16}=  {res} 2.16e-08{txt}{col 49}SBIC{col 67}=  {res} -5.47273

{col 1}{text}Equation        {col 18}  Parms{col 26}     RMSE {col 37}   R-sq  {col 47}   chi2   {col 58} P>chi2
{res}{col 1}{text}{hline 17}{hline 8}{hline 11}{hline 10}{hline 11}{hline 7}
{col 1}{text}gprcn           {col 18}{result}     9{col 26}{space 2} .167708{col 37}{space 1} 0.5207{col 47} 259.6591{col 58} 0.0000
{col 1}{text}lpro            {col 18}{result}     9{col 26}{space 2} .008019{col 37}{space 1} 0.9841{col 47} 14758.78{col 58} 0.0000
{col 1}{text}ligrea          {col 18}{result}     9{col 26}{space 2} 1.47327{col 37}{space 1} 0.8581{col 47} 1444.922{col 58} 0.0000
{col 1}{text}lrpo            {col 18}{result}     9{col 26}{space 2}  .08174{col 37}{space 1} 0.9582{col 47}  5472.14{col 58} 0.0000
{col 1}{text}{hline 17}{hline 8}{hline 11}{hline 10}{hline 11}{hline 7}
{res}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}gprcn        {txt}{c |}
{space 7}gprcn {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .4443778{col 26}{space 2} .0622216{col 37}{space 1}    7.14{col 46}{space 3}0.000{col 54}{space 4} .3224256{col 67}{space 3}   .56633
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .1782056{col 26}{space 2} .0623994{col 37}{space 1}    2.86{col 46}{space 3}0.004{col 54}{space 4} .0559051{col 67}{space 3} .3005062
{txt}{space 12} {c |}
{space 8}lpro {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-3.018679{col 26}{space 2} 1.338652{col 37}{space 1}   -2.26{col 46}{space 3}0.024{col 54}{space 4}-5.642388{col 67}{space 3}-.3949694
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} 3.850703{col 26}{space 2} 1.339876{col 37}{space 1}    2.87{col 46}{space 3}0.004{col 54}{space 4} 1.224594{col 67}{space 3} 6.476811
{txt}{space 12} {c |}
{space 6}ligrea {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .0023119{col 26}{space 2} .0074545{col 37}{space 1}    0.31{col 46}{space 3}0.756{col 54}{space 4}-.0122986{col 67}{space 3} .0169225
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0005368{col 26}{space 2} .0073999{col 37}{space 1}   -0.07{col 46}{space 3}0.942{col 54}{space 4}-.0150402{col 67}{space 3} .0139667
{txt}{space 12} {c |}
{space 8}lrpo {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .1532182{col 26}{space 2} .1293141{col 37}{space 1}    1.18{col 46}{space 3}0.236{col 54}{space 4}-.1002328{col 67}{space 3} .4066692
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.2082281{col 26}{space 2} .1283588{col 37}{space 1}   -1.62{col 46}{space 3}0.105{col 54}{space 4}-.4598068{col 67}{space 3} .0433506
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-3.226462{col 26}{space 2} .9841889{col 37}{space 1}   -3.28{col 46}{space 3}0.001{col 54}{space 4}-5.155436{col 67}{space 3}-1.297487
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lpro         {txt}{c |}
{space 7}gprcn {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.0013264{col 26}{space 2} .0029751{col 37}{space 1}   -0.45{col 46}{space 3}0.656{col 54}{space 4}-.0071576{col 67}{space 3} .0045047
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0018845{col 26}{space 2} .0029836{col 37}{space 1}    0.63{col 46}{space 3}0.528{col 54}{space 4}-.0039633{col 67}{space 3} .0077323
{txt}{space 12} {c |}
{space 8}lpro {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .9722475{col 26}{space 2} .0640079{col 37}{space 1}   15.19{col 46}{space 3}0.000{col 54}{space 4} .8467943{col 67}{space 3} 1.097701
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0205195{col 26}{space 2} .0640664{col 37}{space 1}    0.32{col 46}{space 3}0.749{col 54}{space 4}-.1050484{col 67}{space 3} .1460874
{txt}{space 12} {c |}
{space 6}ligrea {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .0005198{col 26}{space 2} .0003564{col 37}{space 1}    1.46{col 46}{space 3}0.145{col 54}{space 4}-.0001788{col 67}{space 3} .0012184
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0003937{col 26}{space 2} .0003538{col 37}{space 1}   -1.11{col 46}{space 3}0.266{col 54}{space 4}-.0010872{col 67}{space 3} .0002998
{txt}{space 12} {c |}
{space 8}lrpo {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .0116968{col 26}{space 2} .0061832{col 37}{space 1}    1.89{col 46}{space 3}0.059{col 54}{space 4} -.000422{col 67}{space 3} .0238156
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0112313{col 26}{space 2} .0061375{col 37}{space 1}   -1.83{col 46}{space 3}0.067{col 54}{space 4}-.0232606{col 67}{space 3}  .000798
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0303798{col 26}{space 2} .0470592{col 37}{space 1}    0.65{col 46}{space 3}0.519{col 54}{space 4}-.0618545{col 67}{space 3} .1226141
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ligrea       {txt}{c |}
{space 7}gprcn {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}  .639055{col 26}{space 2} .5465994{col 37}{space 1}    1.17{col 46}{space 3}0.242{col 54}{space 4}-.4322601{col 67}{space 3}  1.71037
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .1964158{col 26}{space 2} .5481607{col 37}{space 1}    0.36{col 46}{space 3}0.720{col 54}{space 4}-.8779594{col 67}{space 3} 1.270791
{txt}{space 12} {c |}
{space 8}lpro {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-7.986964{col 26}{space 2} 11.75967{col 37}{space 1}   -0.68{col 46}{space 3}0.497{col 54}{space 4} -31.0355{col 67}{space 3} 15.06157
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} 2.842411{col 26}{space 2} 11.77043{col 37}{space 1}    0.24{col 46}{space 3}0.809{col 54}{space 4} -20.2272{col 67}{space 3} 25.91203
{txt}{space 12} {c |}
{space 6}ligrea {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .8883138{col 26}{space 2} .0654857{col 37}{space 1}   13.56{col 46}{space 3}0.000{col 54}{space 4} .7599641{col 67}{space 3} 1.016664
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0047228{col 26}{space 2} .0650056{col 37}{space 1}    0.07{col 46}{space 3}0.942{col 54}{space 4}-.1226859{col 67}{space 3} .1321315
{txt}{space 12} {c |}
{space 8}lrpo {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} 1.304938{col 26}{space 2} 1.135987{col 37}{space 1}    1.15{col 46}{space 3}0.251{col 54}{space 4}-.9215566{col 67}{space 3} 3.531432
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-1.189063{col 26}{space 2} 1.127596{col 37}{space 1}   -1.05{col 46}{space 3}0.292{col 54}{space 4} -3.39911{col 67}{space 3} 1.020984
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}   21.442{col 26}{space 2} 8.645818{col 37}{space 1}    2.48{col 46}{space 3}0.013{col 54}{space 4}  4.49651{col 67}{space 3} 38.38749
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lrpo         {txt}{c |}
{space 7}gprcn {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.0010515{col 26}{space 2} .0303266{col 37}{space 1}   -0.03{col 46}{space 3}0.972{col 54}{space 4}-.0604906{col 67}{space 3} .0583877
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0183931{col 26}{space 2} .0304133{col 37}{space 1}   -0.60{col 46}{space 3}0.545{col 54}{space 4} -.078002{col 67}{space 3} .0412158
{txt}{space 12} {c |}
{space 8}lpro {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.1172443{col 26}{space 2} .6524548{col 37}{space 1}   -0.18{col 46}{space 3}0.857{col 54}{space 4}-1.396032{col 67}{space 3} 1.161544
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .2327742{col 26}{space 2} .6530515{col 37}{space 1}    0.36{col 46}{space 3}0.722{col 54}{space 4}-1.047183{col 67}{space 3} 1.512732
{txt}{space 12} {c |}
{space 6}ligrea {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}  .005088{col 26}{space 2} .0036333{col 37}{space 1}    1.40{col 46}{space 3}0.161{col 54}{space 4}-.0020331{col 67}{space 3} .0122092
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.0020696{col 26}{space 2} .0036067{col 37}{space 1}   -0.57{col 46}{space 3}0.566{col 54}{space 4}-.0091385{col 67}{space 3} .0049993
{txt}{space 12} {c |}
{space 8}lrpo {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} 1.214098{col 26}{space 2} .0630273{col 37}{space 1}   19.26{col 46}{space 3}0.000{col 54}{space 4} 1.090566{col 67}{space 3} 1.337629
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}-.2573826{col 26}{space 2} .0625617{col 37}{space 1}   -4.11{col 46}{space 3}0.000{col 54}{space 4}-.3800013{col 67}{space 3} -.134764
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.3469605{col 26}{space 2} .4796906{col 37}{space 1}   -0.72{col 46}{space 3}0.469{col 54}{space 4}-1.287137{col 67}{space 3} .5932159
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. capture drop epsilon_*
{txt}
{com}. predict double upsilon_1 if Period>tm(2000m1),residual eq(#1)
{txt}(481 missing values generated)

{com}. predict double upsilon_2 if Period>tm(2000m1),residual eq(#2)
{txt}(481 missing values generated)

{com}. predict double upsilon_3 if Period>tm(2000m1),residual eq(#3)
{txt}(481 missing values generated)

{com}. predict double upsilon_4 if Period>tm(2000m1),residual eq(#4)
{txt}(481 missing values generated)

{com}. /* store the epsilon* variables in the epsilon matrix */
. mkmat upsilon_*, matrix(upsilon_) 
{res}{txt}
{com}. /* compute e_t matrix of structural shocks */
. matrix u_ = (BA*upsilon_')'
{txt}
{com}. /* store columns of e as variables e1, e2, and e3 */  
. svmat double u_
{txt}
{com}. 
. label variable upsilon_1 "Reduced-form shocks - GPR (Robustness)"
{txt}
{com}. label variable u_1 "Structural shocks - GPR (Robustness)"
{txt}
{com}. 
. twoway (tsline u_1 if Period>tm(2000m1)) (tsline upsilon_1 ///
> if Period>tm(2000m1), yaxis(1)), ///
>  name(G3R, replace) legend(position(6)) graphregion(margin(r+5))
{res}{txt}
{com}. 
. graph export "G3R.svg", as(svg) replace
{txt}{p 0 4 2}
file {bf}
G3R.svg{rm}
saved as
SVG
format
{p_end}

{com}. graph export "G3R.png", as(png) width(4000) replace
{txt}{p 0 4 2}
file {bf}
G3R.png{rm}
saved as
PNG
format
{p_end}

{com}. graph export "G3R.pdf", as(pdf) replace
{txt}{p 0 4 2}
file {bf}
G3R.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
. irf set comparemodels1.irf, replace
{txt}(file {bf:comparemodels1.irf} created)
(file {bf:comparemodels1.irf} now active)

{com}. quietly lpirf lpro ligrea lrpo, step(48) lags(1/24) ///
>   exog(L(0/24).u_1) vce(robust)
{txt}
{com}. irf create lpmodel1
{res}{txt}(file {bf:comparemodels1.irf} updated)

{com}. 
. quietly var lpro ligrea lrpo, lags(1/24)            ///
>   exog(L(0/24).u_1)
{txt}
{com}. irf create varmodel1, step(48)
{res}{txt}(file {bf:comparemodels1.irf} updated)

{com}. 
. irf graph dm, impulse(u_1) response(lrpo)   ///
>   irf(lpmodel1 varmodel1) level(95) name(G4R, replace) ///
>     xline(0 10 20 30 40 50, lcolor(blue)) yline(-.05 0 .05 .1, lcolor(blue))
{res}{txt}
{com}. 
. graph export "G4R.svg", replace
{txt}{p 0 4 2}
file {bf}
G4R.svg{rm}
saved as
SVG
format
{p_end}

{com}. graph export "G4R.png", as(png) width(4000) replace
{txt}{p 0 4 2}
file {bf}
G4R.png{rm}
saved as
PNG
format
{p_end}

{com}. graph export "G4R.pdf", as(pdf) replace
{txt}{p 0 4 2}
file {bf}
G4R.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
. twoway (tsline u1 if Period>tm(2000m1)) (tsline u_1 ///
> if Period>tm(2000m1), yaxis(1)), ///
>  name(G5R, replace) legend(position(6)) graphregion(margin(r+5))
{res}{txt}
{com}. 
. graph export "G5R.svg", replace
{txt}{p 0 4 2}
file {bf}
G5R.svg{rm}
saved as
SVG
format
{p_end}

{com}. graph export "G5R.png", as(png) width(4000) replace
{txt}{p 0 4 2}
file {bf}
G5R.png{rm}
saved as
PNG
format
{p_end}

{com}. graph export "G5R.pdf", as(pdf) replace
{txt}{p 0 4 2}
file {bf}
G5R.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
. pwcorr lrpo u1 u_1, obs sig listwise star(5) sidak

             {txt}{c |}     lrpo       u1      u_1
{hline 13}{c +}{hline 27}
        lrpo {c |} {res}  1.0000 
             {txt}{c |}
             {c |}{res}      239
             {txt}{c |}
          u1 {c |} {res} -0.0268   1.0000 
             {txt}{c |}{res}   0.9674
             {txt}{c |}{res}      239      239
             {txt}{c |}
         u_1 {c |} {res} -0.0059   0.0809   1.0000 
             {txt}{c |}{res}   0.9996   0.5123
             {txt}{c |}{res}      239      239      239
             {txt}{c |}

{com}. 
. twoway (scatter lrpo u1) (lfit lrpo u1), name(G6R, replace)
{res}{txt}
{com}. graph export "G6R.svg", replace
{txt}{p 0 4 2}
file {bf}
G6R.svg{rm}
saved as
SVG
format
{p_end}

{com}. graph export "G6R.png", as(png) width(4000) replace
{txt}{p 0 4 2}
file {bf}
G6R.png{rm}
saved as
PNG
format
{p_end}

{com}. graph export "G6R.pdf", as(pdf) replace
{txt}{p 0 4 2}
file {bf}
G6R.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
. twoway (scatter lrpo u_1) (lfit lrpo u_1), name(G7R, replace)
{res}{txt}
{com}. graph export "G7R.svg", replace
{txt}{p 0 4 2}
file {bf}
G7R.svg{rm}
saved as
SVG
format
{p_end}

{com}. graph export "G7R.png", as(png) width(4000) replace
{txt}{p 0 4 2}
file {bf}
G7R.png{rm}
saved as
PNG
format
{p_end}

{com}. graph export "G7R.pdf", as(pdf) replace
{txt}{p 0 4 2}
file {bf}
G7R.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
. **#************* Expectations **********************************
. 
. use database_pri_gpr.dta, clear
{txt}
{com}. 
. merge 1:1 Period using expectations
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}              55
{txt}{col 9}from master{col 30}{res}              12{txt}  (_merge==1)
{col 9}from using{col 30}{res}              43{txt}  (_merge==2)

{col 5}Matched{col 30}{res}             708{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. // PRI ----> Expectations
. 
. graph drop _all
{txt}
{com}. 
. sum BCI CLI CCI lpri 

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}BCI {c |}{res}        571    99.93125    1.065472   95.06452    101.863
{txt}{space 9}CLI {c |}{res}        751    100.2146    1.345907   89.72672    104.628
{txt}{space 9}CCI {c |}{res}        607    99.98832    1.177633   95.47003   101.9302
{txt}{space 8}lpri {c |}{res}        720    -.305086    1.281585  -2.174752   1.458615
{txt}
{com}. 
. tvgc CCI lpri, trend window(80) sizecontrol(60) p(2)     ///
>  d(1) seed(123) boot(499) robust prefix(CCI) graph pdf   ///
>  notitle
{res}
Time-varying LA-VAR Granger causality test including trend, 1973m1 - 2019m12

{txt}{p 0 0 2}TVGC robust test statistics for H0: CCI is GC{p_end}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 18:Max_Wald_forward}{space 1}{space 1}{ralign 18:Max_Wald_rolling}{space 1}{space 1}{ralign 18:Max_Wald_recursive}{space 1}
{space 0}{hline 13}{c   +}{hline 20}{hline 20}{hline 19}
{space 0}{space 0}{ralign 12:lpri}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            26.479}}}{space 1}{space 1}{ralign 18:{res:{sf:            54.477}}}{space 1}{space 1}{ralign 18:{res:{sf:            55.587}}}{space 1}
{res}
{txt}{p 0 0 2}90th percentile of test statistics [499 replications]{p_end}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 18:Max_Wald_forward}{space 1}{space 1}{ralign 18:Max_Wald_rolling}{space 1}{space 1}{ralign 18:Max_Wald_recursive}{space 1}
{space 0}{hline 13}{c   +}{hline 20}{hline 20}{hline 19}
{space 0}{space 0}{ralign 12:lpri}{space 1}{c |}{space 1}{ralign 18:{res:{sf:             5.993}}}{space 1}{space 1}{ralign 18:{res:{sf:             5.957}}}{space 1}{space 1}{ralign 18:{res:{sf:             6.646}}}{space 1}
{res}
{txt}{p 0 0 2}95th percentile of test statistics [499 replications]{p_end}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 18:Max_Wald_forward}{space 1}{space 1}{ralign 18:Max_Wald_rolling}{space 1}{space 1}{ralign 18:Max_Wald_recursive}{space 1}
{space 0}{hline 13}{c   +}{hline 20}{hline 20}{hline 19}
{space 0}{space 0}{ralign 12:lpri}{space 1}{c |}{space 1}{ralign 18:{res:{sf:             7.781}}}{space 1}{space 1}{ralign 18:{res:{sf:             7.628}}}{space 1}{space 1}{ralign 18:{res:{sf:             8.686}}}{space 1}
{res}
{txt}{p 0 0 2}99th percentile of test statistics [499 replications]{p_end}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 18:Max_Wald_forward}{space 1}{space 1}{ralign 18:Max_Wald_rolling}{space 1}{space 1}{ralign 18:Max_Wald_recursive}{space 1}
{space 0}{hline 13}{c   +}{hline 20}{hline 20}{hline 19}
{space 0}{space 0}{ralign 12:lpri}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            13.040}}}{space 1}{space 1}{ralign 18:{res:{sf:            12.582}}}{space 1}{space 1}{ralign 18:{res:{sf:            13.507}}}{space 1}

{com}.  
. tvgc BCI lpri, trend window(80) sizecontrol(60) p(2)      ///
>  d(1) seed(123) boot(499) robust prefix(BCI) graph pdf    ///
>  notitle
{res}
Time-varying LA-VAR Granger causality test including trend, 1975m12 - 2019m12

{txt}{p 0 0 2}TVGC robust test statistics for H0: BCI is GC{p_end}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 18:Max_Wald_forward}{space 1}{space 1}{ralign 18:Max_Wald_rolling}{space 1}{space 1}{ralign 18:Max_Wald_recursive}{space 1}
{space 0}{hline 13}{c   +}{hline 20}{hline 20}{hline 19}
{space 0}{space 0}{ralign 12:lpri}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            10.515}}}{space 1}{space 1}{ralign 18:{res:{sf:            11.731}}}{space 1}{space 1}{ralign 18:{res:{sf:            13.227}}}{space 1}
{res}
{txt}{p 0 0 2}90th percentile of test statistics [499 replications]{p_end}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 18:Max_Wald_forward}{space 1}{space 1}{ralign 18:Max_Wald_rolling}{space 1}{space 1}{ralign 18:Max_Wald_recursive}{space 1}
{space 0}{hline 13}{c   +}{hline 20}{hline 20}{hline 19}
{space 0}{space 0}{ralign 12:lpri}{space 1}{c |}{space 1}{ralign 18:{res:{sf:             4.837}}}{space 1}{space 1}{ralign 18:{res:{sf:             5.477}}}{space 1}{space 1}{ralign 18:{res:{sf:             6.138}}}{space 1}
{res}
{txt}{p 0 0 2}95th percentile of test statistics [499 replications]{p_end}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 18:Max_Wald_forward}{space 1}{space 1}{ralign 18:Max_Wald_rolling}{space 1}{space 1}{ralign 18:Max_Wald_recursive}{space 1}
{space 0}{hline 13}{c   +}{hline 20}{hline 20}{hline 19}
{space 0}{space 0}{ralign 12:lpri}{space 1}{c |}{space 1}{ralign 18:{res:{sf:             6.428}}}{space 1}{space 1}{ralign 18:{res:{sf:             7.335}}}{space 1}{space 1}{ralign 18:{res:{sf:             7.605}}}{space 1}
{res}
{txt}{p 0 0 2}99th percentile of test statistics [499 replications]{p_end}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 18:Max_Wald_forward}{space 1}{space 1}{ralign 18:Max_Wald_rolling}{space 1}{space 1}{ralign 18:Max_Wald_recursive}{space 1}
{space 0}{hline 13}{c   +}{hline 20}{hline 20}{hline 19}
{space 0}{space 0}{ralign 12:lpri}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            11.711}}}{space 1}{space 1}{ralign 18:{res:{sf:            12.380}}}{space 1}{space 1}{ralign 18:{res:{sf:            12.440}}}{space 1}

{com}.  
. tvgc CLI lpri, trend window(80) sizecontrol(60) p(2)      ///
>  d(1) seed(123) boot(499) robust prefix(CLI) graph pdf    ///
>  notitle
{res}
Time-varying LA-VAR Granger causality test including trend, 1961m1 - 2019m12

{txt}{p 0 0 2}TVGC robust test statistics for H0: CLI is GC{p_end}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 18:Max_Wald_forward}{space 1}{space 1}{ralign 18:Max_Wald_rolling}{space 1}{space 1}{ralign 18:Max_Wald_recursive}{space 1}
{space 0}{hline 13}{c   +}{hline 20}{hline 20}{hline 19}
{space 0}{space 0}{ralign 12:lpri}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            12.812}}}{space 1}{space 1}{ralign 18:{res:{sf:            33.829}}}{space 1}{space 1}{ralign 18:{res:{sf:            39.248}}}{space 1}
{res}
{txt}{p 0 0 2}90th percentile of test statistics [499 replications]{p_end}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 18:Max_Wald_forward}{space 1}{space 1}{ralign 18:Max_Wald_rolling}{space 1}{space 1}{ralign 18:Max_Wald_recursive}{space 1}
{space 0}{hline 13}{c   +}{hline 20}{hline 20}{hline 19}
{space 0}{space 0}{ralign 12:lpri}{space 1}{c |}{space 1}{ralign 18:{res:{sf:             6.016}}}{space 1}{space 1}{ralign 18:{res:{sf:             6.285}}}{space 1}{space 1}{ralign 18:{res:{sf:             6.863}}}{space 1}
{res}
{txt}{p 0 0 2}95th percentile of test statistics [499 replications]{p_end}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 18:Max_Wald_forward}{space 1}{space 1}{ralign 18:Max_Wald_rolling}{space 1}{space 1}{ralign 18:Max_Wald_recursive}{space 1}
{space 0}{hline 13}{c   +}{hline 20}{hline 20}{hline 19}
{space 0}{space 0}{ralign 12:lpri}{space 1}{c |}{space 1}{ralign 18:{res:{sf:             7.582}}}{space 1}{space 1}{ralign 18:{res:{sf:             8.352}}}{space 1}{space 1}{ralign 18:{res:{sf:             8.953}}}{space 1}
{res}
{txt}{p 0 0 2}99th percentile of test statistics [499 replications]{p_end}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 18:Max_Wald_forward}{space 1}{space 1}{ralign 18:Max_Wald_rolling}{space 1}{space 1}{ralign 18:Max_Wald_recursive}{space 1}
{space 0}{hline 13}{c   +}{hline 20}{hline 20}{hline 19}
{space 0}{space 0}{ralign 12:lpri}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            10.712}}}{space 1}{space 1}{ralign 18:{res:{sf:            11.926}}}{space 1}{space 1}{ralign 18:{res:{sf:            12.600}}}{space 1}

{com}. 
. // GPRCN ----> Expectations 
.  
. sum BCI CLI CCI gprcn 

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}BCI {c |}{res}        571    99.93125    1.065472   95.06452    101.863
{txt}{space 9}CLI {c |}{res}        751    100.2146    1.345907   89.72672    104.628
{txt}{space 9}CCI {c |}{res}        607    99.98832    1.177633   95.47003   101.9302
{txt}{space 7}gprcn {c |}{res}        420    .3757173    .2305926     .07034   1.521136
{txt}
{com}.  
. tvgc CCI gprcn, trend window(80) sizecontrol(40) p(2)     ///
>  d(1) seed(123) boot(499) robust prefix(CCI) graph pdf    ///
>  notitle
{res}
Time-varying LA-VAR Granger causality test including trend, 1985m1 - 2019m12

{txt}{p 0 0 2}TVGC robust test statistics for H0: CCI is GC{p_end}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 18:Max_Wald_forward}{space 1}{space 1}{ralign 18:Max_Wald_rolling}{space 1}{space 1}{ralign 18:Max_Wald_recursive}{space 1}
{space 0}{hline 13}{c   +}{hline 20}{hline 20}{hline 19}
{space 0}{space 0}{ralign 12:gprcn}{space 1}{c |}{space 1}{ralign 18:{res:{sf:             7.674}}}{space 1}{space 1}{ralign 18:{res:{sf:            10.965}}}{space 1}{space 1}{ralign 18:{res:{sf:            14.298}}}{space 1}
{res}
{txt}{p 0 0 2}90th percentile of test statistics [499 replications]{p_end}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 18:Max_Wald_forward}{space 1}{space 1}{ralign 18:Max_Wald_rolling}{space 1}{space 1}{ralign 18:Max_Wald_recursive}{space 1}
{space 0}{hline 13}{c   +}{hline 20}{hline 20}{hline 19}
{space 0}{space 0}{ralign 12:gprcn}{space 1}{c |}{space 1}{ralign 18:{res:{sf:             6.100}}}{space 1}{space 1}{ralign 18:{res:{sf:             6.586}}}{space 1}{space 1}{ralign 18:{res:{sf:             7.129}}}{space 1}
{res}
{txt}{p 0 0 2}95th percentile of test statistics [499 replications]{p_end}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 18:Max_Wald_forward}{space 1}{space 1}{ralign 18:Max_Wald_rolling}{space 1}{space 1}{ralign 18:Max_Wald_recursive}{space 1}
{space 0}{hline 13}{c   +}{hline 20}{hline 20}{hline 19}
{space 0}{space 0}{ralign 12:gprcn}{space 1}{c |}{space 1}{ralign 18:{res:{sf:             7.759}}}{space 1}{space 1}{ralign 18:{res:{sf:             8.104}}}{space 1}{space 1}{ralign 18:{res:{sf:             8.696}}}{space 1}
{res}
{txt}{p 0 0 2}99th percentile of test statistics [499 replications]{p_end}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 18:Max_Wald_forward}{space 1}{space 1}{ralign 18:Max_Wald_rolling}{space 1}{space 1}{ralign 18:Max_Wald_recursive}{space 1}
{space 0}{hline 13}{c   +}{hline 20}{hline 20}{hline 19}
{space 0}{space 0}{ralign 12:gprcn}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            11.653}}}{space 1}{space 1}{ralign 18:{res:{sf:            11.794}}}{space 1}{space 1}{ralign 18:{res:{sf:            12.486}}}{space 1}

{com}.  
. tvgc BCI gprcn, trend window(80) sizecontrol(40) p(2)     ///
>  d(1) seed(123) boot(499) robust prefix(BCI) graph pdf    ///
>  notitle
{res}
Time-varying LA-VAR Granger causality test including trend, 1985m1 - 2019m12

{txt}{p 0 0 2}TVGC robust test statistics for H0: BCI is GC{p_end}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 18:Max_Wald_forward}{space 1}{space 1}{ralign 18:Max_Wald_rolling}{space 1}{space 1}{ralign 18:Max_Wald_recursive}{space 1}
{space 0}{hline 13}{c   +}{hline 20}{hline 20}{hline 19}
{space 0}{space 0}{ralign 12:gprcn}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            10.214}}}{space 1}{space 1}{ralign 18:{res:{sf:             9.963}}}{space 1}{space 1}{ralign 18:{res:{sf:            13.562}}}{space 1}
{res}
{txt}{p 0 0 2}90th percentile of test statistics [499 replications]{p_end}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 18:Max_Wald_forward}{space 1}{space 1}{ralign 18:Max_Wald_rolling}{space 1}{space 1}{ralign 18:Max_Wald_recursive}{space 1}
{space 0}{hline 13}{c   +}{hline 20}{hline 20}{hline 19}
{space 0}{space 0}{ralign 12:gprcn}{space 1}{c |}{space 1}{ralign 18:{res:{sf:             5.907}}}{space 1}{space 1}{ralign 18:{res:{sf:             6.330}}}{space 1}{space 1}{ralign 18:{res:{sf:             6.566}}}{space 1}
{res}
{txt}{p 0 0 2}95th percentile of test statistics [499 replications]{p_end}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 18:Max_Wald_forward}{space 1}{space 1}{ralign 18:Max_Wald_rolling}{space 1}{space 1}{ralign 18:Max_Wald_recursive}{space 1}
{space 0}{hline 13}{c   +}{hline 20}{hline 20}{hline 19}
{space 0}{space 0}{ralign 12:gprcn}{space 1}{c |}{space 1}{ralign 18:{res:{sf:             7.163}}}{space 1}{space 1}{ralign 18:{res:{sf:             7.735}}}{space 1}{space 1}{ralign 18:{res:{sf:             8.200}}}{space 1}
{res}
{txt}{p 0 0 2}99th percentile of test statistics [499 replications]{p_end}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 18:Max_Wald_forward}{space 1}{space 1}{ralign 18:Max_Wald_rolling}{space 1}{space 1}{ralign 18:Max_Wald_recursive}{space 1}
{space 0}{hline 13}{c   +}{hline 20}{hline 20}{hline 19}
{space 0}{space 0}{ralign 12:gprcn}{space 1}{c |}{space 1}{ralign 18:{res:{sf:             9.336}}}{space 1}{space 1}{ralign 18:{res:{sf:             9.875}}}{space 1}{space 1}{ralign 18:{res:{sf:            10.775}}}{space 1}

{com}.  
. tvgc CLI gprcn, trend window(80) sizecontrol(40) p(2)     ///
>  d(1) seed(123) boot(499) robust prefix(CLI) graph pdf    ///
>  notitle
{res}
Time-varying LA-VAR Granger causality test including trend, 1985m1 - 2019m12

{txt}{p 0 0 2}TVGC robust test statistics for H0: CLI is GC{p_end}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 18:Max_Wald_forward}{space 1}{space 1}{ralign 18:Max_Wald_rolling}{space 1}{space 1}{ralign 18:Max_Wald_recursive}{space 1}
{space 0}{hline 13}{c   +}{hline 20}{hline 20}{hline 19}
{space 0}{space 0}{ralign 12:gprcn}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            19.021}}}{space 1}{space 1}{ralign 18:{res:{sf:            18.997}}}{space 1}{space 1}{ralign 18:{res:{sf:            30.649}}}{space 1}
{res}
{txt}{p 0 0 2}90th percentile of test statistics [499 replications]{p_end}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 18:Max_Wald_forward}{space 1}{space 1}{ralign 18:Max_Wald_rolling}{space 1}{space 1}{ralign 18:Max_Wald_recursive}{space 1}
{space 0}{hline 13}{c   +}{hline 20}{hline 20}{hline 19}
{space 0}{space 0}{ralign 12:gprcn}{space 1}{c |}{space 1}{ralign 18:{res:{sf:             6.155}}}{space 1}{space 1}{ralign 18:{res:{sf:             6.423}}}{space 1}{space 1}{ralign 18:{res:{sf:             6.630}}}{space 1}
{res}
{txt}{p 0 0 2}95th percentile of test statistics [499 replications]{p_end}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 18:Max_Wald_forward}{space 1}{space 1}{ralign 18:Max_Wald_rolling}{space 1}{space 1}{ralign 18:Max_Wald_recursive}{space 1}
{space 0}{hline 13}{c   +}{hline 20}{hline 20}{hline 19}
{space 0}{space 0}{ralign 12:gprcn}{space 1}{c |}{space 1}{ralign 18:{res:{sf:             7.574}}}{space 1}{space 1}{ralign 18:{res:{sf:             7.972}}}{space 1}{space 1}{ralign 18:{res:{sf:             8.116}}}{space 1}
{res}
{txt}{p 0 0 2}99th percentile of test statistics [499 replications]{p_end}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 18:Max_Wald_forward}{space 1}{space 1}{ralign 18:Max_Wald_rolling}{space 1}{space 1}{ralign 18:Max_Wald_recursive}{space 1}
{space 0}{hline 13}{c   +}{hline 20}{hline 20}{hline 19}
{space 0}{space 0}{ralign 12:gprcn}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            11.559}}}{space 1}{space 1}{ralign 18:{res:{sf:            11.553}}}{space 1}{space 1}{ralign 18:{res:{sf:            11.856}}}{space 1}

{com}.  
. save database_pri_gpr_final.dta, replace
{txt}{p 0 4 2}
file {bf}
database_pri_gpr_final.dta{rm}
saved
{p_end}

{com}. 
. log close _all
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\jamel\Dropbox\latex\PROJECTS\23-05-geopolitical-risk-pol-tension-oil-price\Data and command\Codes_EE\lpirf_PRI_GPR_EE.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}13 Jul 2025, 15:30:37
{txt}{.-}
{smcl}
{txt}{sf}{ul off}