--------------------------------------------------------------------------------------------------------------------
      name:  svarPt
       log:  C:\Users\jamel\Dropbox\Latex\PROJECTS\24-09-commo-geopolitical-risks\Data and command\GPR\Pt\svarPt.log
  log type:  text
 opened on:  23 Oct 2024, 09:19:21

. 
. **#  ***** Analysing geopolitical risks on commo price *********
. 
. set scheme Cleanplots

. graph set window fontface "Arial Narrow"

. 
. cls

. clear

. 
. version 18.5

. set more off

. 
. // Please change the path with your own folder
. 
. /*
> cd "C:\Users\jamel\Dropbox\latex\PROJECTS"
> cd "24-09-commo-geopolitical-risks"
> cd "Data and command"
> */
. 
. import excel data.xlsx,/*
> */ sheet("Feuil1") firstrow clear
(12 vars, 476 obs)

. 
. generate period = tm(1985m1) + _n-1

. format %tm period

. 
. tsset period

Time variable: period, 1985m1 to 2024m8
        Delta: 1 month

. 
. des

Contains data
 Observations:           476                  
    Variables:            13                  
--------------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
--------------------------------------------------------------------------------------------------------------------
GPR             double  %10.0g                GPR
GPRT            double  %10.0g                GPRT
GPRA            double  %10.0g                GPRA
GECON           double  %10.0g                GECON
GINF            double  %10.0g                GINF
GRATE           double  %10.0g                GRATE
Al              double  %10.0g                Al
Cu              double  %10.0g                Cu
Sn              double  %10.0g                Sn
Ni              double  %10.0g                Ni
Zn              double  %10.0g                Zn
Pt              double  %10.0g                Pt
period          float   %tm                   
--------------------------------------------------------------------------------------------------------------------
Sorted by: period
     Note: Dataset has changed since last saved.

. 
. *ssc install labvars
. 
. labvars GPR GPRT GPRA GECON GINF GRATE Al Cu Sn Ni Zn Pt ///
>  "Geopolitical Risks" "Geopolitical Threats" ///
>  "Geopolitical Acts" "Global Economic Conditions" ///
>  "Global Inflation" "Global Interest Rates" ///
>  "Aluminium Price" "Copper Price" ///
>  "Tin Price" "Nickel Price" ///
>  "Zinc Price" "Platinium Price"

.  
. tsline GPR GPRA GPRT, name(GPR, replace) 

. tsline GECON d.GINF, name(ECO, replace) 

. tsline Al Cu Sn Ni Zn Pt, name(CMO, replace) 

. 
. foreach i in GPR ECO CMO {
  2.  gr dis `i' 
  3.  gr export `i'.png, as(png) width(4000) replace
  4.  }
file GPR.png saved as PNG format
file ECO.png saved as PNG format
file CMO.png saved as PNG format

. 
. /* Source: 
>  GECON: Review of Economics and Statistics,Â 104(4), July 2022, 828-844.
>  GPR: American Economic Review, 112(4), 1194-1225.
>  CMO: World Bank Commodity Price Data (The Pink Sheet)
>  */
. 
. gen LGPR = log(GPR)

. gen LGPRA = log(GPRA)

. gen LGPRT = log(GPRT) 

. gen LGINF = log(GINF) 
(1 missing value generated)

. gen LPt = log(Pt)

.  
. order period, first

. 
. save dataset.dta, replace
file dataset.dta saved

.            
. matrix A = (1,0,0,0\.,1,0,0\.,.,1,0\.,.,.,1)

. matlist A

             |        c1         c2         c3         c4 
-------------+-------------------------------------------
          r1 |         1          0          0          0 
          r2 |         .          1          0          0 
          r3 |         .          .          1          0 
          r4 |         .          .          .          1 

. 
. matrix B = (.,0,0,0\0,.,0,0\0,0,.,0\0,0,0,.) 

. matlist B

             |        c1         c2         c3         c4 
-------------+-------------------------------------------
          r1 |         .                                  
          r2 |         0          .                       
          r3 |         0          0          .            
          r4 |         0          0          0          . 

. 
. varsoc LGPR GECON LGINF LPt, maxlag(12)

Lag-order selection criteria

   Sample: 1986m1 thru 2024m7                              Number of obs = 463
  +---------------------------------------------------------------------------+
  | Lag |    LL      LR      df    p     FPE       AIC      HQIC      SBIC    |
  |-----+---------------------------------------------------------------------|
  |   0 | -916.101                     .000625   3.97452   3.98859   4.01026  |
  |   1 |  2799.11  7430.4   16  0.000 7.2e-11  -12.0048  -11.9344  -11.8261  |
  |   2 |   2973.8  349.38   16  0.000 3.6e-11  -12.6903  -12.5636* -12.3685* |
  |   3 |   2991.2   34.81   16  0.004 3.6e-11* -12.6963* -12.5134  -12.2316  |
  |   4 |  3005.47  28.542   16  0.027 3.6e-11  -12.6889  -12.4496  -12.0812  |
  |   5 |  3018.19  25.442   16  0.062 3.7e-11  -12.6747  -12.3792   -11.924  |
  |   6 |  3034.87  33.352   16  0.007 3.7e-11  -12.6776  -12.3258  -11.7839  |
  |   7 |  3049.27  28.802   16  0.025 3.7e-11  -12.6707  -12.2626  -11.6341  |
  |   8 |  3064.44  30.335   16  0.016 3.7e-11  -12.6671  -12.2027  -11.4875  |
  |   9 |  3072.53  16.185   16  0.440 3.8e-11   -12.633  -12.1123  -11.3103  |
  |  10 |  3079.72  14.379   16  0.571 4.0e-11  -12.5949  -12.0179  -11.1293  |
  |  11 |  3099.94   40.44   16  0.001 3.9e-11  -12.6131  -11.9799  -11.0045  |
  |  12 |  3120.33   40.78*  16  0.001 3.8e-11  -12.6321  -11.9425  -10.8805  |
  +---------------------------------------------------------------------------+
   * optimal lag
   Endogenous: LGPR GECON LGINF LPt
    Exogenous: _cons

. 
. svar LGPR GECON LGINF LPt, aeq(A) beq(B) ///
> lags(1/12) 
Estimating short-run parameters

Iteration 0:  Log likelihood = -2170.6025  
Iteration 1:  Log likelihood = -608.14989  
Iteration 2:  Log likelihood =  150.98257  
Iteration 3:  Log likelihood =  808.63086  
Iteration 4:  Log likelihood =  2216.2025  
Iteration 5:  Log likelihood =  2784.1249  
Iteration 6:  Log likelihood =  3054.5673  
Iteration 7:  Log likelihood =  3117.0432  
Iteration 8:  Log likelihood =  3120.3243  
Iteration 9:  Log likelihood =  3120.3313  
Iteration 10: Log likelihood =  3120.3313  

Structural vector autoregression

 ( 1)  [/A]1_1 = 1
 ( 2)  [/A]1_2 = 0
 ( 3)  [/A]1_3 = 0
 ( 4)  [/A]1_4 = 0
 ( 5)  [/A]2_2 = 1
 ( 6)  [/A]2_3 = 0
 ( 7)  [/A]2_4 = 0
 ( 8)  [/A]3_3 = 1
 ( 9)  [/A]3_4 = 0
 (10)  [/A]4_4 = 1
 (11)  [/B]1_2 = 0
 (12)  [/B]1_3 = 0
 (13)  [/B]1_4 = 0
 (14)  [/B]2_1 = 0
 (15)  [/B]2_3 = 0
 (16)  [/B]2_4 = 0
 (17)  [/B]3_1 = 0
 (18)  [/B]3_2 = 0
 (19)  [/B]3_4 = 0
 (20)  [/B]4_1 = 0
 (21)  [/B]4_2 = 0
 (22)  [/B]4_3 = 0

Sample: 1986m1 thru 2024m7                      Number of obs     =        463
Exactly identified model                        Log likelihood    =   3120.331

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
/A           |
         1_1 |          1  (constrained)
         2_1 |    .195801   .0691647     2.83   0.005     .0602406    .3313613
         3_1 |  -.0006796     .00032    -2.12   0.034    -.0013068   -.0000524
         4_1 |  -.0073162   .0106344    -0.69   0.491    -.0281592    .0135268
         1_2 |          0  (constrained)
         2_2 |          1  (constrained)
         3_2 |  -.0009197   .0002132    -4.31   0.000    -.0013375   -.0005019
         4_2 |  -.0208019   .0071906    -2.89   0.004    -.0348952   -.0067087
         1_3 |          0  (constrained)
         2_3 |          0  (constrained)
         3_3 |          1  (constrained)
         4_3 |  -4.296232   1.536969    -2.80   0.005    -7.308635   -1.283829
         1_4 |          0  (constrained)
         2_4 |          0  (constrained)
         3_4 |          0  (constrained)
         4_4 |          1  (constrained)
-------------+----------------------------------------------------------------
/B           |
         1_1 |   .2050708    .006739    30.43   0.000     .1918625    .2182791
         2_1 |          0  (constrained)
         3_1 |          0  (constrained)
         4_1 |          0  (constrained)
         1_2 |          0  (constrained)
         2_2 |   .3051961   .0100294    30.43   0.000     .2855389    .3248533
         3_2 |          0  (constrained)
         4_2 |          0  (constrained)
         1_3 |          0  (constrained)
         2_3 |          0  (constrained)
         3_3 |      .0014    .000046    30.43   0.000     .0013098    .0014901
         4_3 |          0  (constrained)
         1_4 |          0  (constrained)
         2_4 |          0  (constrained)
         3_4 |          0  (constrained)
         4_4 |   .0462994   .0015215    30.43   0.000     .0433173    .0492814
------------------------------------------------------------------------------

. 
. /* compute the inv(B)*A matrix */
. matrix A=e(A)

. matrix B=e(B)

. matrix BA = inv(B)*A

. /* compute reduced form epsilon_t residuals */
. var LGPR GECON LGINF LPt

Vector autoregression

Sample: 1985m3 thru 2024m7                      Number of obs     =        473
Log likelihood =   3043.172                     AIC               =  -12.71531
FPE            =   3.53e-11                     HQIC              =  -12.59081
Det(Sigma_ml)  =   3.03e-11                     SBIC              =  -12.39877

Equation           Parms      RMSE     R-sq      chi2     P>chi2
----------------------------------------------------------------
LGPR                  9     .218378   0.5929   688.8119   0.0000
GECON                 9     .332967   0.4915   457.1855   0.0000
LGINF                 9     .001632   1.0000   3.76e+07   0.0000
LPt                   9     .051303   0.9904   48837.65   0.0000
----------------------------------------------------------------

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
LGPR         |
        LGPR |
         L1. |    .730266   .0464113    15.73   0.000     .6393016    .8212304
         L2. |   .0471903   .0462725     1.02   0.308    -.0435021    .1378827
             |
       GECON |
         L1. |    .004675   .0306469     0.15   0.879    -.0553918    .0647417
         L2. |  -.0189088   .0297406    -0.64   0.525    -.0771993    .0393817
             |
       LGINF |
         L1. |   .9158112   4.588351     0.20   0.842    -8.077191    9.908813
         L2. |  -.9178948   4.573383    -0.20   0.841    -9.881561    8.045771
             |
         LPt |
         L1. |   .1279256   .1950752     0.66   0.512    -.2544147    .5102659
         L2. |  -.1198318   .1952415    -0.61   0.539    -.5024981    .2628345
             |
       _cons |    .965348    .207374     4.66   0.000     .5589025    1.371793
-------------+----------------------------------------------------------------
GECON        |
        LGPR |
         L1. |   .0804409   .0707645     1.14   0.256    -.0582549    .2191366
         L2. |  -.0817681   .0705528    -1.16   0.246    -.2200491    .0565128
             |
       GECON |
         L1. |   .6552245   .0467281    14.02   0.000     .5636391    .7468098
         L2. |  -.0202727   .0453462    -0.45   0.655    -.1091497    .0686043
             |
       LGINF |
         L1. |  -18.34088   6.995975    -2.62   0.009    -32.05274    -4.62902
         L2. |   18.24453   6.973154     2.62   0.009     4.577398    31.91166
             |
         LPt |
         L1. |   1.117083   .2974361     3.76   0.000     .5341193    1.700047
         L2. |  -1.171327   .2976897    -3.93   0.000    -1.754788   -.5878658
             |
       _cons |   .8647515   .3161884     2.73   0.006     .2450337    1.484469
-------------+----------------------------------------------------------------
LGINF        |
        LGPR |
         L1. |  -.0000595   .0003468    -0.17   0.864    -.0007392    .0006202
         L2. |  -.0000781   .0003458    -0.23   0.821    -.0007558    .0005995
             |
       GECON |
         L1. |   .0005782    .000229     2.52   0.012     .0001293     .001027
         L2. |  -.0006926   .0002222    -3.12   0.002    -.0011282   -.0002571
             |
       LGINF |
         L1. |   1.667852    .034285    48.65   0.000     1.600655     1.73505
         L2. |  -.6689797   .0341732   -19.58   0.000     -.735958   -.6020015
             |
         LPt |
         L1. |   .0013831   .0014576     0.95   0.343    -.0014738      .00424
         L2. |    -.00147   .0014589    -1.01   0.314    -.0043293    .0013894
             |
       _cons |   .0074544   .0015495     4.81   0.000     .0044173    .0104914
-------------+----------------------------------------------------------------
LPt          |
        LGPR |
         L1. |  -.0101045   .0109033    -0.93   0.354    -.0314746    .0112657
         L2. |   .0110225   .0108707     1.01   0.311    -.0102837    .0323287
             |
       GECON |
         L1. |   .0149869   .0071998     2.08   0.037     .0008755    .0290983
         L2. |  -.0101216   .0069869    -1.45   0.147    -.0238157    .0035725
             |
       LGINF |
         L1. |  -2.931057   1.077935    -2.72   0.007     -5.04377   -.8183442
         L2. |   2.927765   1.074418     2.72   0.006     .8219439    5.033586
             |
         LPt |
         L1. |   1.208346   .0458287    26.37   0.000     1.118523    1.298168
         L2. |  -.2214092   .0458678    -4.83   0.000    -.3113084   -.1315099
             |
       _cons |   .1092807   .0487181     2.24   0.025     .0137951    .2047663
------------------------------------------------------------------------------

. capture drop epsilon*

. predict double epsilon1,residual eq(#1)
(2 missing values generated)

. predict double epsilon2,residual eq(#2)
(2 missing values generated)

. predict double epsilon3,residual eq(#3)
(3 missing values generated)

. predict double epsilon4,residual eq(#4)
(2 missing values generated)

. /* store the epsilon* variables in the epsilon matrix */
. mkmat epsilon*, matrix(epsilon) 

. /* compute e_t matrix of structural shocks */
. matrix e = (BA*epsilon')'

. /* store columns of e as variables e1, e2, and e3 */  
. svmat double e

. 
. label variable epsilon1 "Reduced-form shocks Pt - GPR"

. label variable e1 "Structural shocks Pt - GPR"

. 
. **# Plot the shocks
. twoway (tsline e1) ///
>  (tsline epsilon1, yaxis(1)), ///
>  name(G1Pt, replace) legend(position(6)) ///
>  graphregion(margin(r+5))

.  
. graph export "G1Pt.png", as(png) width(4000) replace
file G1Pt.png saved as PNG format

. 
. irf set comparemodels.irf, replace
(file comparemodels.irf created)
(file comparemodels.irf now active)

. quietly lpirf GECON LGINF LPt, step(50) lags(1/12) ///
>   exog(L(0/12).e1) vce(robust)

. irf create lpmodel 
(file comparemodels.irf updated)

. 
. /*
> quietly var GECON LGINF LPt, lags(1/12) ///
>   exog(L(0/12).e1)
> irf create varmodel, step(50)
> */
. 
. irf graph dm, impulse(e1) response(LPt) ///
>   irf(lpmodel) level(90) ///
>   xlabel(0(12)48,grid) name(G2Pt, replace) ///
>   xsize(4)

.         
. graph export "G2Pt.png", as(png) width(4000) replace
file G2Pt.png saved as PNG format

. 
. save datasetPt.dta, replace
file datasetPt.dta saved

. 
. ****************************************************************
. 
. log close _all
      name:  svarPt
       log:  C:\Users\jamel\Dropbox\Latex\PROJECTS\24-09-commo-geopolitical-risks\Data and command\GPR\Pt\svarPt.log
  log type:  text
 closed on:  23 Oct 2024, 09:19:39
--------------------------------------------------------------------------------------------------------------------
