---------------------------------------------------------------------------------------------------------
      name:  xrdynamics
       log:  C:\Users\jamel\Documents\GitHub\ResearchPapers\Saadaoui 2015\xrdynamics.log
  log type:  text
 opened on:  22 Aug 2024, 19:55:49

. 
. *Import the data from Excel
. 
. 
. import excel EXCEL_0215a.xlsx, /// 
> sheet("data_fin") firstrow clear // Note 1
(7 vars, 754 obs)

. 
. *Generate variable in logarithm
. 
. generate logreer = ln(reer)

. generate logfeer = ln(feer)

. generate logreer_cs = ln(reer_cs)

. generate logfeer_cs = ln(feer_cs)

. 
. *Panel setting (N=26; T=29; N*T=754)
. 
. gen datayear = yofd(period)

. encode country, generate(cn)

. order cn datayear, first

. 
. xtset cn datayear, yearly

Panel variable: cn (strongly balanced)
 Time variable: datayear, 1982 to 2010
         Delta: 1 year

. xtdescribe

      cn:  1, 2, ..., 26                                     n =         26
datayear:  1982, 1983, ..., 2010                             T =         29
           Delta(datayear) = 1 year
           Span(datayear)  = 29 periods
           (cn*datayear uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                        29      29      29        29        29      29      29

     Freq.  Percent    Cum. |  Pattern
 ---------------------------+-------------------------------
       26    100.00  100.00 |  11111111111111111111111111111
 ---------------------------+-------------------------------
       26    100.00         |  XXXXXXXXXXXXXXXXXXXXXXXXXXXXX

. 
. ****************************************************************
. 
. **#Install User-Written Stata Programs
. 
. /*
> capture ssc install pescadf // Note 2
> capture ssc install xtwest
> capture ssc install xtpmg
> capture ssc install xtmg
> capture ssc install ltimbimata
> capture ssc install xtdolshm
> capture ssc install outreg2
> capture net install xtdcce2 , ///
>  from("https://janditzen.github.io/xtdcce2/")
> */
. 
. **#UNIT ROOT TEST
. *CADF test (Pesaran, 2007)
. 
. pescadf  logfeer, lags(1) trend
command pescadf is unrecognized
r(199);

end of do-file

r(199);

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_000000.tmp"

. capture ssc install pescadf // Note 2

. capture ssc install xtwest

. capture ssc install xtpmg

. capture ssc install xtmg

. capture ssc install ltimbimata

. capture ssc install xtdolshm

. capture ssc install outreg2

. capture net install xtdcce2 , ///
>  from("https://janditzen.github.io/xtdcce2/")

. 
end of do-file

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_000001.tmp"

. capture ssc install pescadf // Note 2

. capture ssc install xtwest

. capture ssc install xtpmg

. capture ssc install xtmg

. capture ssc install ltimbimata

. capture ssc install xtdolshm

. capture ssc install outreg2

. capture net install xtdcce2 , ///
>  from("https://janditzen.github.io/xtdcce2/")

. 
end of do-file

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_000002.tmp"

. xtdcce2  logreer logfeer, crosssectional(_all, rcclassifier)
option rcclassifier not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_000003.tmp"

. xtdcce2  logreer logfeer, crosssectional(_all,rcclassifier)
option rcclassifier not allowed
r(198);

end of do-file

r(198);

. net install xtdcce2 , from("https://janditzen.github.io/xtdcce2/")
checking xtdcce2 consistency and verifying not already installed...

the following files already exist and are different:
    C:\Users\jamel\ado\plus\x\xtdcce2.ado
    C:\Users\jamel\ado\plus\x\xtdcce2_estat.ado
    C:\Users\jamel\ado\plus\x\xtdcce2_p.ado
    C:\Users\jamel\ado\plus\x\xtdcce2.sthlp
    C:\Users\jamel\ado\plus\x\xtset2.ado
    C:\Users\jamel\ado\plus\x\xtset2.sthlp
    C:\Users\jamel\ado\plus\x\xtcd2.ado
    C:\Users\jamel\ado\plus\x\xtcd2.sthlp
    C:\Users\jamel\ado\plus\x\xtcse2.ado
    C:\Users\jamel\ado\plus\x\xtcse2.sthlp
    C:\Users\jamel\ado\plus\x\xtdcce2_auxiliary.ado
    C:\Users\jamel\ado\plus\x\xtdcce2fast.ado
    C:\Users\jamel\ado\plus\x\xtdcce2fast.sthlp
    C:\Users\jamel\ado\plus\b\bootstrap_xtdcce2.ado

no files installed or copied
(no action taken)
r(602);

. net install xtdcce2 , from("https://janditzen.github.io/xtdcce2/") force
checking xtdcce2 consistency and verifying not already installed...

the following files will be replaced:
    C:\Users\jamel\ado\plus\x\xtdcce2.ado
    C:\Users\jamel\ado\plus\x\xtdcce2_estat.ado
    C:\Users\jamel\ado\plus\x\xtdcce2_p.ado
    C:\Users\jamel\ado\plus\x\xtdcce2.sthlp
    C:\Users\jamel\ado\plus\x\xtset2.ado
    C:\Users\jamel\ado\plus\x\xtset2.sthlp
    C:\Users\jamel\ado\plus\x\xtcd2.ado
    C:\Users\jamel\ado\plus\x\xtcd2.sthlp
    C:\Users\jamel\ado\plus\x\xtcse2.ado
    C:\Users\jamel\ado\plus\x\xtcse2.sthlp
    C:\Users\jamel\ado\plus\x\xtdcce2_auxiliary.ado
    C:\Users\jamel\ado\plus\x\xtdcce2fast.ado
    C:\Users\jamel\ado\plus\x\xtdcce2fast.sthlp
    C:\Users\jamel\ado\plus\b\bootstrap_xtdcce2.ado

installing into C:\Users\jamel\ado\plus\...
installation complete.

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_000004.tmp"

. xtdcce2  logreer logfeer, crosssectional(_all, rcclassifier)
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       4.80
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.57
 variables partialled out           = 78         R-squared (MG)    =       0.72
                                                 Root MSE          =       0.10
                                                 CD Statistic      =      -2.25
                                                    p-value        =     0.0246
-------------------------------------------------------------------------------
        logreer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logfeer|  .4276603   .0765973    5.58    0.000      .2775323   .5777882
-------------------------------------------------------------------------------
Mean Group Variables: logfeer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in th
> e data.

. 
end of do-file

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_000005.tmp"

. xtdcce2  logfeer logreer, crosssectional(_all, rcclassifier)
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       3.31
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.65
 variables partialled out           = 78         R-squared (MG)    =       0.64
                                                 Root MSE          =       0.12
                                                 CD Statistic      =      -2.63
                                                    p-value        =     0.0086
-------------------------------------------------------------------------------
        logfeer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logreer|  .5827229   .0951959    6.12    0.000      .3961424   .7693034
-------------------------------------------------------------------------------
Mean Group Variables: logreer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in th
> e data.

. 
end of do-file

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_000006.tmp"

. estat ic, model(logreer logfeer)
command tuples is unrecognized
r(199);

end of do-file

r(199);

. search tuples

. ssc install tuples
checking tuples consistency and verifying not already installed...
installing into C:\Users\jamel\ado\plus\...
installation complete.

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_000007.tmp"

. estat ic, model(logreer logfeer)
Running 3 combinations of cross-section averages:
. . . 
IC from Margaritella & Westerlund (2023)
---------------------------------------------------------------------------------
  Model   |    IC1             IC2           PC1            PC2
----------+----------------------------------------------------------------------
   1      |       -4          -3.95*         .0181*       .0181*
   2      |    -3.79          -3.75          .0215        .0215
   3      |    -4.02*         -3.93          .0193        .0193
---------------------------------------------------------------------------------
 * indicates minimum.

 Cross Section Averages:
  Model 1: logfeer 
  Model 2: logreer 
  Model 3: logreer logfeer (Main Model)
 Click on Model to run in xtdcce2.

. 
end of do-file

. xtdcce2 logfeer logreer  , cr(logreer logfeer ,rcclassifier) 
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       3.31
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.65
 variables partialled out           = 78         R-squared (MG)    =       0.64
                                                 Root MSE          =       0.12
                                                 CD Statistic      =      -2.63
                                                    p-value        =     0.0086
-------------------------------------------------------------------------------
        logfeer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logreer|  .5827229   .0951959    6.12    0.000      .3961424   .7693034
-------------------------------------------------------------------------------
Mean Group Variables: logreer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in th
> e data.

. xtdcce2 logfeer logreer  , cr(logreer ,rcclassifier) 
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 26
Number of                                        F(78, 676)        =       3.71
 cross-sectional lags               =  0         Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.70
 variables partialled out           = 52         R-squared (MG)    =       0.48
                                                 Root MSE          =       0.14
                                                 CD Statistic      =       2.51
                                                    p-value        =     0.0120
-------------------------------------------------------------------------------
        logfeer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logreer|  .4418458   .1240034    3.56    0.000      .1988037   .6848879
-------------------------------------------------------------------------------
Mean Group Variables: logreer
Cross Sectional Averaged Variables: logreer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in th
> e data.

. xtdcce2 logfeer logreer  , cr(logfeer ,rcclassifier) 
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 26
Number of                                        F(78, 676)        =       3.81
 cross-sectional lags               =  0         Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.69
 variables partialled out           = 52         R-squared (MG)    =       0.57
                                                 Root MSE          =       0.13
                                                 CD Statistic      =      -1.36
                                                    p-value        =     0.1724
-------------------------------------------------------------------------------
        logfeer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logreer|   .472225   .1035908    4.56    0.000      .2691908   .6752593
-------------------------------------------------------------------------------
Mean Group Variables: logreer
Cross Sectional Averaged Variables: logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in th
> e data.

. xtdcce2 logfeer logreer  , cr(logreer ,rcclassifier) 
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 26
Number of                                        F(78, 676)        =       3.71
 cross-sectional lags               =  0         Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.70
 variables partialled out           = 52         R-squared (MG)    =       0.48
                                                 Root MSE          =       0.14
                                                 CD Statistic      =       2.51
                                                    p-value        =     0.0120
-------------------------------------------------------------------------------
        logfeer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logreer|  .4418458   .1240034    3.56    0.000      .1988037   .6848879
-------------------------------------------------------------------------------
Mean Group Variables: logreer
Cross Sectional Averaged Variables: logreer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in th
> e data.

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_000008.tmp"

. xtdcce2  logreer logfeer, crosssectional(_all, rcclassifier)
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       4.80
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.57
 variables partialled out           = 78         R-squared (MG)    =       0.72
                                                 Root MSE          =       0.10
                                                 CD Statistic      =      -2.25
                                                    p-value        =     0.0246
-------------------------------------------------------------------------------
        logreer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logfeer|  .4276603   .0765973    5.58    0.000      .2775323   .5777882
-------------------------------------------------------------------------------
Mean Group Variables: logfeer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in th
> e data.

. 
end of do-file

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_000009.tmp"

. estat ic, model(logreer logfeer)
Running 3 combinations of cross-section averages:
. . . 
IC from Margaritella & Westerlund (2023)
---------------------------------------------------------------------------------
  Model   |    IC1             IC2           PC1            PC2
----------+----------------------------------------------------------------------
   1      |    -4.23          -4.18          .0143        .0143
   2      |    -4.26          -4.21           .014         .014
   3      |    -4.41*         -4.32*         .0128*       .0128*
---------------------------------------------------------------------------------
 * indicates minimum.

 Cross Section Averages:
  Model 1: logfeer 
  Model 2: logreer 
  Model 3: logreer logfeer (Main Model)
 Click on Model to run in xtdcce2.

. 
end of do-file

. xtdcce2 logreer logfeer  , cr(logreer logfeer ,rcclassifier) 
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       4.80
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.57
 variables partialled out           = 78         R-squared (MG)    =       0.72
                                                 Root MSE          =       0.10
                                                 CD Statistic      =      -2.25
                                                    p-value        =     0.0246
-------------------------------------------------------------------------------
        logreer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logfeer|  .4276603   .0765973    5.58    0.000      .2775323   .5777882
-------------------------------------------------------------------------------
Mean Group Variables: logfeer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in th
> e data.

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_00000a.tmp"

. xtdcce2  logfeer logreer, crosssectional(_all, rcclassifier)
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       3.31
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.65
 variables partialled out           = 78         R-squared (MG)    =       0.64
                                                 Root MSE          =       0.12
                                                 CD Statistic      =      -2.63
                                                    p-value        =     0.0086
-------------------------------------------------------------------------------
        logfeer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logreer|  .5827229   .0951959    6.12    0.000      .3961424   .7693034
-------------------------------------------------------------------------------
Mean Group Variables: logreer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in th
> e data.

. 
. estat ic, model(logfeer logreer)
Running 3 combinations of cross-section averages:
. . . 
IC from Margaritella & Westerlund (2023)
---------------------------------------------------------------------------------
  Model   |    IC1             IC2           PC1            PC2
----------+----------------------------------------------------------------------
   1      |    -3.79          -3.75          .0222        .0222
   2      |       -4          -3.95*         .0188        .0188
   3      |    -4.02*         -3.93           .018*        .018*
---------------------------------------------------------------------------------
 * indicates minimum.

 Cross Section Averages:
  Model 1: logreer 
  Model 2: logfeer 
  Model 3: logfeer logreer (Main Model)
 Click on Model to run in xtdcce2.

. 
end of do-file

. xtdcce2 logfeer logreer  , cr(logfeer logreer ,rcclassifier) 
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       3.31
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.65
 variables partialled out           = 78         R-squared (MG)    =       0.64
                                                 Root MSE          =       0.12
                                                 CD Statistic      =      -2.63
                                                    p-value        =     0.0086
-------------------------------------------------------------------------------
        logfeer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logreer|  .5827229   .0951959    6.12    0.000      .3961424   .7693034
-------------------------------------------------------------------------------
Mean Group Variables: logreer
Cross Sectional Averaged Variables: logfeer logreer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in th
> e data.

. xtdcce2 logfeer logreer  , cr(logfeer ,rcclassifier) 
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 26
Number of                                        F(78, 676)        =       3.81
 cross-sectional lags               =  0         Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.69
 variables partialled out           = 52         R-squared (MG)    =       0.57
                                                 Root MSE          =       0.13
                                                 CD Statistic      =      -1.36
                                                    p-value        =     0.1724
-------------------------------------------------------------------------------
        logfeer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logreer|   .472225   .1035908    4.56    0.000      .2691908   .6752593
-------------------------------------------------------------------------------
Mean Group Variables: logreer
Cross Sectional Averaged Variables: logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in th
> e data.

. xtdcce2 logfeer logreer  , cr(logreer ,rcclassifier) 
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 26
Number of                                        F(78, 676)        =       3.71
 cross-sectional lags               =  0         Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.70
 variables partialled out           = 52         R-squared (MG)    =       0.48
                                                 Root MSE          =       0.14
                                                 CD Statistic      =       2.51
                                                    p-value        =     0.0120
-------------------------------------------------------------------------------
        logfeer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logreer|  .4418458   .1240034    3.56    0.000      .1988037   .6848879
-------------------------------------------------------------------------------
Mean Group Variables: logreer
Cross Sectional Averaged Variables: logreer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in th
> e data.

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_00000b.tmp"

. **# ** Testing the rank condition
. 
. xtdcce2  logreer logfeer, crosssectional(_all, rcclassifier)
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       4.80
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.57
 variables partialled out           = 78         R-squared (MG)    =       0.72
                                                 Root MSE          =       0.10
                                                 CD Statistic      =      -2.25
                                                    p-value        =     0.0246
-------------------------------------------------------------------------------
        logreer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logfeer|  .4276603   .0765973    5.58    0.000      .2775323   .5777882
-------------------------------------------------------------------------------
Mean Group Variables: logfeer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in th
> e data.

. 
end of do-file

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_00000c.tmp"

. **# ** Testing the rank condition
. 
. xtdcce2  logreer logfeer, crosssectional(_all, rcclassifier)
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       4.80
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.57
 variables partialled out           = 78         R-squared (MG)    =       0.72
                                                 Root MSE          =       0.10
                                                 CD Statistic      =      -2.25
                                                    p-value        =     0.0246
-------------------------------------------------------------------------------
        logreer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logfeer|  .4276603   .0765973    5.58    0.000      .2775323   .5777882
-------------------------------------------------------------------------------
Mean Group Variables: logfeer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in the data.

. 
end of do-file

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_00000d.tmp"

. estat ic, model(logreer logfeer)
Running 3 combinations of cross-section averages:
. . . 
IC from Margaritella & Westerlund (2023)
---------------------------------------------------------------------------------
  Model   |    IC1             IC2           PC1            PC2
----------+----------------------------------------------------------------------
   1      |    -4.23          -4.18          .0143        .0143
   2      |    -4.26          -4.21           .014         .014
   3      |    -4.41*         -4.32*         .0128*       .0128*
---------------------------------------------------------------------------------
 * indicates minimum.

 Cross Section Averages:
  Model 1: logfeer 
  Model 2: logreer 
  Model 3: logreer logfeer (Main Model)
 Click on Model to run in xtdcce2.

. 
end of do-file

. xtdcce2 logreer logfeer  , cr(logfeer ,rcclassifier) 
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 26
Number of                                        F(78, 676)        =       5.03
 cross-sectional lags               =  0         Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.63
 variables partialled out           = 52         R-squared (MG)    =       0.61
                                                 Root MSE          =       0.12
                                                 CD Statistic      =       1.22
                                                    p-value        =     0.2240
-------------------------------------------------------------------------------
        logreer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logfeer|  .4063861   .0806099    5.04    0.000      .2483935   .5643786
-------------------------------------------------------------------------------
Mean Group Variables: logfeer
Cross Sectional Averaged Variables: logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in the data.

. xtdcce2 logreer logfeer  , cr(logreer ,rcclassifier) 
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 26
Number of                                        F(78, 676)        =       6.41
 cross-sectional lags               =  0         Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.57
 variables partialled out           = 52         R-squared (MG)    =       0.62
                                                 Root MSE          =       0.11
                                                 CD Statistic      =      -2.06
                                                    p-value        =     0.0395
-------------------------------------------------------------------------------
        logreer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logfeer|  .4196793   .0893793    4.70    0.000      .2444992   .5948594
-------------------------------------------------------------------------------
Mean Group Variables: logfeer
Cross Sectional Averaged Variables: logreer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in the data.

. xtdcce2 logreer logfeer  , cr(logreer logfeer ,rcclassifier) 
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       4.80
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.57
 variables partialled out           = 78         R-squared (MG)    =       0.72
                                                 Root MSE          =       0.10
                                                 CD Statistic      =      -2.25
                                                    p-value        =     0.0246
-------------------------------------------------------------------------------
        logreer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logfeer|  .4276603   .0765973    5.58    0.000      .2775323   .5777882
-------------------------------------------------------------------------------
Mean Group Variables: logfeer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in the data.

. xtdcce2 logreer logfeer  , cr(logfeer ,rcclassifier) 
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 26
Number of                                        F(78, 676)        =       5.03
 cross-sectional lags               =  0         Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.63
 variables partialled out           = 52         R-squared (MG)    =       0.61
                                                 Root MSE          =       0.12
                                                 CD Statistic      =       1.22
                                                    p-value        =     0.2240
-------------------------------------------------------------------------------
        logreer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logfeer|  .4063861   .0806099    5.04    0.000      .2483935   .5643786
-------------------------------------------------------------------------------
Mean Group Variables: logfeer
Cross Sectional Averaged Variables: logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in the data.

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_00000e.tmp"

. **# ** Testing the rank condition
. 
. xtdcce2  logreer logfeer, crosssectional(_all, rcclassifier)
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       4.80
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.57
 variables partialled out           = 78         R-squared (MG)    =       0.72
                                                 Root MSE          =       0.10
                                                 CD Statistic      =      -2.25
                                                    p-value        =     0.0246
-------------------------------------------------------------------------------
        logreer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logfeer|  .4276603   .0765973    5.58    0.000      .2775323   .5777882
-------------------------------------------------------------------------------
Mean Group Variables: logfeer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in the data.

. 
. estat ic, model(logreer logfeer)
Running 3 combinations of cross-section averages:
. . . 
IC from Margaritella & Westerlund (2023)
---------------------------------------------------------------------------------
  Model   |    IC1             IC2           PC1            PC2
----------+----------------------------------------------------------------------
   1      |    -4.23          -4.18          .0143        .0143
   2      |    -4.26          -4.21           .014         .014
   3      |    -4.41*         -4.32*         .0128*       .0128*
---------------------------------------------------------------------------------
 * indicates minimum.

 Cross Section Averages:
  Model 1: logfeer 
  Model 2: logreer 
  Model 3: logreer logfeer (Main Model)
 Click on Model to run in xtdcce2.

. 
end of do-file

. xtdcce2 logreer logfeer  , cr(logfeer ,rcclassifier) 
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 26
Number of                                        F(78, 676)        =       5.03
 cross-sectional lags               =  0         Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.63
 variables partialled out           = 52         R-squared (MG)    =       0.61
                                                 Root MSE          =       0.12
                                                 CD Statistic      =       1.22
                                                    p-value        =     0.2240
-------------------------------------------------------------------------------
        logreer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logfeer|  .4063861   .0806099    5.04    0.000      .2483935   .5643786
-------------------------------------------------------------------------------
Mean Group Variables: logfeer
Cross Sectional Averaged Variables: logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in the data.

. xtdcce2 logreer logfeer  , cr(logreer ,rcclassifier) 
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 26
Number of                                        F(78, 676)        =       6.41
 cross-sectional lags               =  0         Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.57
 variables partialled out           = 52         R-squared (MG)    =       0.62
                                                 Root MSE          =       0.11
                                                 CD Statistic      =      -2.06
                                                    p-value        =     0.0395
-------------------------------------------------------------------------------
        logreer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logfeer|  .4196793   .0893793    4.70    0.000      .2444992   .5948594
-------------------------------------------------------------------------------
Mean Group Variables: logfeer
Cross Sectional Averaged Variables: logreer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in the data.

. xtdcce2 logreer logfeer  , cr(logreer logfeer ,rcclassifier) 
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       4.80
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.57
 variables partialled out           = 78         R-squared (MG)    =       0.72
                                                 Root MSE          =       0.10
                                                 CD Statistic      =      -2.25
                                                    p-value        =     0.0246
-------------------------------------------------------------------------------
        logreer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logfeer|  .4276603   .0765973    5.58    0.000      .2775323   .5777882
-------------------------------------------------------------------------------
Mean Group Variables: logfeer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in the data.

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_00000f.tmp"

. xtline logfeer, overlay
(note:  named style i not found in class symbol, default attributes used)

. 
end of do-file

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_00000g.tmp"

. xtline logfeer_cs, overlay

. 
end of do-file

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_00000h.tmp"

. xtline logreer_cs, overlay

. 
end of do-file

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_00000i.tmp"

. xtline logreer_cs logfeer_cs, overlay
option overlay may not be specified with multiple variables
r(198);

end of do-file

r(198);

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_00000j.tmp"

. xtline logreer_cs, overlay

. 
end of do-file

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_00000k.tmp"

. xtline logfeer_cs, overlay

. 
end of do-file

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_00000l.tmp"

. label var logreer_cs "CSA of Log FEER" 

. 
. label var logreer_cs "CSA of Log REER"

. 
. xtline logreer_cs, overlay

. 
end of do-file

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_00000m.tmp"

. xtline logfeer_cs, overlay xtitle("")

. 
end of do-file

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_00000n.tmp"

. xtline logreer_cs, overlay xtitle("") ///
>  name(logreer_cs, replace)

. 
. xtline logfeer_cs, overlay xtitle("") ///
>  name(logfeer_cs, replace)

. 
end of do-file

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_00000o.tmp"

. **# ** Testing the rank condition
. 
. *do xr-dynamics_residual_testing.do
. 
. xtdcce2  logreer logfeer, crosssectional(_all, rcclassifier)
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       4.80
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.57
 variables partialled out           = 78         R-squared (MG)    =       0.72
                                                 Root MSE          =       0.10
                                                 CD Statistic      =      -2.25
                                                    p-value        =     0.0246
-------------------------------------------------------------------------------
        logreer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logfeer|  .4276603   .0765973    5.58    0.000      .2775323   .5777882
-------------------------------------------------------------------------------
Mean Group Variables: logfeer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in the data.

. 
. estat ic, model(logreer logfeer)
Running 3 combinations of cross-section averages:
. . . 
IC from Margaritella & Westerlund (2023)
---------------------------------------------------------------------------------
  Model   |    IC1             IC2           PC1            PC2
----------+----------------------------------------------------------------------
   1      |    -4.23          -4.18          .0143        .0143
   2      |    -4.26          -4.21           .014         .014
   3      |    -4.41*         -4.32*         .0128*       .0128*
---------------------------------------------------------------------------------
 * indicates minimum.

 Cross Section Averages:
  Model 1: logfeer 
  Model 2: logreer 
  Model 3: logreer logfeer (Main Model)
 Click on Model to run in xtdcce2.

. 
. xtdcce2  logfeer logreer, crosssectional(_all, rcclassifier)
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       3.31
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.65
 variables partialled out           = 78         R-squared (MG)    =       0.64
                                                 Root MSE          =       0.12
                                                 CD Statistic      =      -2.63
                                                    p-value        =     0.0086
-------------------------------------------------------------------------------
        logfeer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logreer|  .5827229   .0951959    6.12    0.000      .3961424   .7693034
-------------------------------------------------------------------------------
Mean Group Variables: logreer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in the data.

. 
. estat ic, model(logfeer logreer)
Running 3 combinations of cross-section averages:
. . . 
IC from Margaritella & Westerlund (2023)
---------------------------------------------------------------------------------
  Model   |    IC1             IC2           PC1            PC2
----------+----------------------------------------------------------------------
   1      |    -3.79          -3.75          .0222        .0222
   2      |       -4          -3.95*         .0188        .0188
   3      |    -4.02*         -3.93           .018*        .018*
---------------------------------------------------------------------------------
 * indicates minimum.

 Cross Section Averages:
  Model 1: logreer 
  Model 2: logfeer 
  Model 3: logfeer logreer (Main Model)
 Click on Model to run in xtdcce2.

. 
. label var logreer_cs "CSA of Log FEER" 

. 
. label var logreer_cs "CSA of Log REER"

. 
. xtline logreer_cs, overlay xtitle("") ///
>  name(logreer_cs, replace)

. 
. xtline logfeer_cs, overlay xtitle("") ///
>  name(logfeer_cs, replace)

. 
end of do-file

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_00000p.tmp"

. label var logfeer_cs "CSA of Log REER"

. 
. xtline logreer_cs, overlay xtitle("") ///
>  name(logreer_cs, replace)

. 
. xtline logfeer_cs, overlay xtitle("") ///
>  name(logfeer_cs, replace)

. 
end of do-file

. 
(note:  named style i not found in class symbol, default attributes used)
do "C:\Users\jamel\AppData\Local\Temp\STD7334_00000q.tmp"

. **# ** Testing the rank condition
. 
. *do xr-dynamics_residual_testing.do
. 
. xtdcce2  logreer logfeer, crosssectional(_all, rcclassifier)
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       4.80
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.57
 variables partialled out           = 78         R-squared (MG)    =       0.72
                                                 Root MSE          =       0.10
                                                 CD Statistic      =      -2.25
                                                    p-value        =     0.0246
-------------------------------------------------------------------------------
        logreer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logfeer|  .4276603   .0765973    5.58    0.000      .2775323   .5777882
-------------------------------------------------------------------------------
Mean Group Variables: logfeer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in the data.

. 
. estat ic, model(logreer logfeer)
Running 3 combinations of cross-section averages:
. . . 
IC from Margaritella & Westerlund (2023)
---------------------------------------------------------------------------------
  Model   |    IC1             IC2           PC1            PC2
----------+----------------------------------------------------------------------
   1      |    -4.23          -4.18          .0143        .0143
   2      |    -4.26          -4.21           .014         .014
   3      |    -4.41*         -4.32*         .0128*       .0128*
---------------------------------------------------------------------------------
 * indicates minimum.

 Cross Section Averages:
  Model 1: logfeer 
  Model 2: logreer 
  Model 3: logreer logfeer (Main Model)
 Click on Model to run in xtdcce2.

. 
. xtdcce2  logfeer logreer, crosssectional(_all, rcclassifier)
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       3.31
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.65
 variables partialled out           = 78         R-squared (MG)    =       0.64
                                                 Root MSE          =       0.12
                                                 CD Statistic      =      -2.63
                                                    p-value        =     0.0086
-------------------------------------------------------------------------------
        logfeer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logreer|  .5827229   .0951959    6.12    0.000      .3961424   .7693034
-------------------------------------------------------------------------------
Mean Group Variables: logreer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in the data.

. 
. estat ic, model(logfeer logreer)
Running 3 combinations of cross-section averages:
. . . 
IC from Margaritella & Westerlund (2023)
---------------------------------------------------------------------------------
  Model   |    IC1             IC2           PC1            PC2
----------+----------------------------------------------------------------------
   1      |    -3.79          -3.75          .0222        .0222
   2      |       -4          -3.95*         .0188        .0188
   3      |    -4.02*         -3.93           .018*        .018*
---------------------------------------------------------------------------------
 * indicates minimum.

 Cross Section Averages:
  Model 1: logreer 
  Model 2: logfeer 
  Model 3: logfeer logreer (Main Model)
 Click on Model to run in xtdcce2.

. 
. label var logreer_cs "CSA of Log REER" 

. 
. label var logfeer_cs "CSA of Log FEER"

. 
. set scheme stcolor_alt

. 
. xtline logreer_cs, overlay xtitle("") ///
>  name(logreer_cs, replace)

. 
. xtline logfeer_cs, overlay xtitle("") ///
>  name(logfeer_cs, replace)

. 
end of do-file

. 
(note:  named style i not found in class symbol, default attributes used)
do "C:\Users\jamel\AppData\Local\Temp\STD7334_00000r.tmp"

. **# ** Testing the rank condition
. 
. *do xr-dynamics_residual_testing.do
. 
. xtdcce2  logreer logfeer, crosssectional(_all, rcclassifier)
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       4.80
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.57
 variables partialled out           = 78         R-squared (MG)    =       0.72
                                                 Root MSE          =       0.10
                                                 CD Statistic      =      -2.25
                                                    p-value        =     0.0246
-------------------------------------------------------------------------------
        logreer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logfeer|  .4276603   .0765973    5.58    0.000      .2775323   .5777882
-------------------------------------------------------------------------------
Mean Group Variables: logfeer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in the data.

. 
. estat ic, model(logreer logfeer)
Running 3 combinations of cross-section averages:
. . . 
IC from Margaritella & Westerlund (2023)
---------------------------------------------------------------------------------
  Model   |    IC1             IC2           PC1            PC2
----------+----------------------------------------------------------------------
   1      |    -4.23          -4.18          .0143        .0143
   2      |    -4.26          -4.21           .014         .014
   3      |    -4.41*         -4.32*         .0128*       .0128*
---------------------------------------------------------------------------------
 * indicates minimum.

 Cross Section Averages:
  Model 1: logfeer 
  Model 2: logreer 
  Model 3: logreer logfeer (Main Model)
 Click on Model to run in xtdcce2.

. 
. xtdcce2  logfeer logreer, crosssectional(_all, rcclassifier)
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       3.31
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.65
 variables partialled out           = 78         R-squared (MG)    =       0.64
                                                 Root MSE          =       0.12
                                                 CD Statistic      =      -2.63
                                                    p-value        =     0.0086
-------------------------------------------------------------------------------
        logfeer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logreer|  .5827229   .0951959    6.12    0.000      .3961424   .7693034
-------------------------------------------------------------------------------
Mean Group Variables: logreer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in the data.

. 
. estat ic, model(logfeer logreer)
Running 3 combinations of cross-section averages:
. . . 
IC from Margaritella & Westerlund (2023)
---------------------------------------------------------------------------------
  Model   |    IC1             IC2           PC1            PC2
----------+----------------------------------------------------------------------
   1      |    -3.79          -3.75          .0222        .0222
   2      |       -4          -3.95*         .0188        .0188
   3      |    -4.02*         -3.93           .018*        .018*
---------------------------------------------------------------------------------
 * indicates minimum.

 Cross Section Averages:
  Model 1: logreer 
  Model 2: logfeer 
  Model 3: logfeer logreer (Main Model)
 Click on Model to run in xtdcce2.

. 
. label var logreer_cs "CSA of Log REER" 

. 
. label var logfeer_cs "CSA of Log FEER"

. 
. set scheme stcolor_alt

. 
. xtline logreer_cs, overlay xtitle("") ///
>  name(logreer_cs, replace)

. 
. xtline logfeer_cs, overlay xtitle("") ///
>  name(logfeer_cs, replace)

. 
end of do-file

. do "C:\Users\jamel\Documents\GitHub\ResearchPapers\Saadaoui 2015\rank-condition.do"

. **# ** Testing the rank condition
. 
. *do xr-dynamics_residual_testing.do
. 
. xtdcce2  logreer logfeer, crosssectional(_all, rcclassifier)
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       4.80
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.57
 variables partialled out           = 78         R-squared (MG)    =       0.72
                                                 Root MSE          =       0.10
                                                 CD Statistic      =      -2.25
                                                    p-value        =     0.0246
-------------------------------------------------------------------------------
        logreer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logfeer|  .4276603   .0765973    5.58    0.000      .2775323   .5777882
-------------------------------------------------------------------------------
Mean Group Variables: logfeer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in the data.

. 
. estat ic, model(logreer logfeer)
Running 3 combinations of cross-section averages:
. . . 
IC from Margaritella & Westerlund (2023)
---------------------------------------------------------------------------------
  Model   |    IC1             IC2           PC1            PC2
----------+----------------------------------------------------------------------
   1      |    -4.23          -4.18          .0143        .0143
   2      |    -4.26          -4.21           .014         .014
   3      |    -4.41*         -4.32*         .0128*       .0128*
---------------------------------------------------------------------------------
 * indicates minimum.

 Cross Section Averages:
  Model 1: logfeer 
  Model 2: logreer 
  Model 3: logreer logfeer (Main Model)
 Click on Model to run in xtdcce2.

. 
. xtdcce2  logfeer logreer, crosssectional(_all, rcclassifier)
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       3.31
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.65
 variables partialled out           = 78         R-squared (MG)    =       0.64
                                                 Root MSE          =       0.12
                                                 CD Statistic      =      -2.63
                                                    p-value        =     0.0086
-------------------------------------------------------------------------------
        logfeer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logreer|  .5827229   .0951959    6.12    0.000      .3961424   .7693034
-------------------------------------------------------------------------------
Mean Group Variables: logreer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in the data.

. 
. estat ic, model(logfeer logreer)
Running 3 combinations of cross-section averages:
. . . 
IC from Margaritella & Westerlund (2023)
---------------------------------------------------------------------------------
  Model   |    IC1             IC2           PC1            PC2
----------+----------------------------------------------------------------------
   1      |    -3.79          -3.75          .0222        .0222
   2      |       -4          -3.95*         .0188        .0188
   3      |    -4.02*         -3.93           .018*        .018*
---------------------------------------------------------------------------------
 * indicates minimum.

 Cross Section Averages:
  Model 1: logreer 
  Model 2: logfeer 
  Model 3: logfeer logreer (Main Model)
 Click on Model to run in xtdcce2.

. 
. label var logreer_cs "CSA of Log REER" 

. 
. label var logfeer_cs "CSA of Log FEER"

. 
. set scheme stcolor

. 
. xtline logreer_cs, overlay xtitle("") ///
>  name(logreer_cs, replace)

. 
. xtline logfeer_cs, overlay xtitle("") ///
>  name(logfeer_cs, replace)

. 
end of do-file

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_00000s.tmp"

. **# ** Testing the rank condition
. 
. *do xr-dynamics_residual_testing.do
. 
. xtdcce2  logreer logfeer, crosssectional(_all, rcclassifier)
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       4.80
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.57
 variables partialled out           = 78         R-squared (MG)    =       0.72
                                                 Root MSE          =       0.10
                                                 CD Statistic      =      -2.25
                                                    p-value        =     0.0246
-------------------------------------------------------------------------------
        logreer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logfeer|  .4276603   .0765973    5.58    0.000      .2775323   .5777882
-------------------------------------------------------------------------------
Mean Group Variables: logfeer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in the data.

. 
. estat ic, model(logreer logfeer)
Running 3 combinations of cross-section averages:
. . . 
IC from Margaritella & Westerlund (2023)
---------------------------------------------------------------------------------
  Model   |    IC1             IC2           PC1            PC2
----------+----------------------------------------------------------------------
   1      |    -4.23          -4.18          .0143        .0143
   2      |    -4.26          -4.21           .014         .014
   3      |    -4.41*         -4.32*         .0128*       .0128*
---------------------------------------------------------------------------------
 * indicates minimum.

 Cross Section Averages:
  Model 1: logfeer 
  Model 2: logreer 
  Model 3: logreer logfeer (Main Model)
 Click on Model to run in xtdcce2.

. 
. xtdcce2  logfeer logreer, crosssectional(_all, rcclassifier)
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       3.31
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.65
 variables partialled out           = 78         R-squared (MG)    =       0.64
                                                 Root MSE          =       0.12
                                                 CD Statistic      =      -2.63
                                                    p-value        =     0.0086
-------------------------------------------------------------------------------
        logfeer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logreer|  .5827229   .0951959    6.12    0.000      .3961424   .7693034
-------------------------------------------------------------------------------
Mean Group Variables: logreer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in the data.

. 
. estat ic, model(logfeer logreer)
Running 3 combinations of cross-section averages:
. . . 
IC from Margaritella & Westerlund (2023)
---------------------------------------------------------------------------------
  Model   |    IC1             IC2           PC1            PC2
----------+----------------------------------------------------------------------
   1      |    -3.79          -3.75          .0222        .0222
   2      |       -4          -3.95*         .0188        .0188
   3      |    -4.02*         -3.93           .018*        .018*
---------------------------------------------------------------------------------
 * indicates minimum.

 Cross Section Averages:
  Model 1: logreer 
  Model 2: logfeer 
  Model 3: logfeer logreer (Main Model)
 Click on Model to run in xtdcce2.

. 
. label var logreer_cs ///
>  "CSA of Log Real Effective Exchange Rates" 

. 
. label var logfeer_cs ///
>  "CSA of Log Fundamental Equilibrium Exchange Rates"

. 
. set scheme stcolor

. 
. xtline logreer_cs, overlay xtitle("") ///
>  name(logreer_cs, replace)

. 
. xtline logfeer_cs, overlay xtitle("") ///
>  name(logfeer_cs, replace)

. 
end of do-file

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_00000t.tmp"

. xtline logreer_cs, overlay xtitle("") ///
>  name(logreer_cs, replace) ylog
option ylog not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_00000u.tmp"

. xtline logreer_cs, overlay xtitle("") ///
>  name(logreer_cs, replace) yscale(log)

. 
end of do-file

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_00000v.tmp"

. xtline logreer_cs, overlay xtitle("") ///
>  name(logreer_cs, replace) yscale(antilog)
option antilog not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_00000w.tmp"

. **# ** Testing the rank condition
. 
. *do xr-dynamics_residual_testing.do
. 
. xtdcce2  logreer logfeer, crosssectional(_all, rcclassifier)
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       4.80
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.57
 variables partialled out           = 78         R-squared (MG)    =       0.72
                                                 Root MSE          =       0.10
                                                 CD Statistic      =      -2.25
                                                    p-value        =     0.0246
-------------------------------------------------------------------------------
        logreer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logfeer|  .4276603   .0765973    5.58    0.000      .2775323   .5777882
-------------------------------------------------------------------------------
Mean Group Variables: logfeer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in the data.

. 
. estat ic, model(logreer logfeer)
Running 3 combinations of cross-section averages:
. . . 
IC from Margaritella & Westerlund (2023)
---------------------------------------------------------------------------------
  Model   |    IC1             IC2           PC1            PC2
----------+----------------------------------------------------------------------
   1      |    -4.23          -4.18          .0143        .0143
   2      |    -4.26          -4.21           .014         .014
   3      |    -4.41*         -4.32*         .0128*       .0128*
---------------------------------------------------------------------------------
 * indicates minimum.

 Cross Section Averages:
  Model 1: logfeer 
  Model 2: logreer 
  Model 3: logreer logfeer (Main Model)
 Click on Model to run in xtdcce2.

. 
. xtdcce2  logfeer logreer, crosssectional(_all, rcclassifier)
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       3.31
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.65
 variables partialled out           = 78         R-squared (MG)    =       0.64
                                                 Root MSE          =       0.12
                                                 CD Statistic      =      -2.63
                                                    p-value        =     0.0086
-------------------------------------------------------------------------------
        logfeer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logreer|  .5827229   .0951959    6.12    0.000      .3961424   .7693034
-------------------------------------------------------------------------------
Mean Group Variables: logreer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in the data.

. 
. estat ic, model(logfeer logreer)
Running 3 combinations of cross-section averages:
. . . 
IC from Margaritella & Westerlund (2023)
---------------------------------------------------------------------------------
  Model   |    IC1             IC2           PC1            PC2
----------+----------------------------------------------------------------------
   1      |    -3.79          -3.75          .0222        .0222
   2      |       -4          -3.95*         .0188        .0188
   3      |    -4.02*         -3.93           .018*        .018*
---------------------------------------------------------------------------------
 * indicates minimum.

 Cross Section Averages:
  Model 1: logreer 
  Model 2: logfeer 
  Model 3: logfeer logreer (Main Model)
 Click on Model to run in xtdcce2.

. 
. label var logreer_cs ///
>  "CSA of Log Real Effective Exchange Rates" 

. 
. label var logfeer_cs ///
>  "CSA of Log Fundamental Equilibrium Exchange Rates"

. 
. set scheme stcolor

. 
. xtline logreer_cs, overlay xtitle("") ///
>  name(logreer_cs, replace)

. 
. xtline logfeer_cs, overlay xtitle("") ///
>  name(logfeer_cs, replace)

. 
end of do-file

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_00000x.tmp"

. **# ** Testing the rank condition
. 
. *do xr-dynamics_residual_testing.do
. 
. xtdcce2  logreer logfeer, crosssectional(_all, rcclassifier)
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       4.80
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.57
 variables partialled out           = 78         R-squared (MG)    =       0.72
                                                 Root MSE          =       0.10
                                                 CD Statistic      =      -2.25
                                                    p-value        =     0.0246
-------------------------------------------------------------------------------
        logreer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logfeer|  .4276603   .0765973    5.58    0.000      .2775323   .5777882
-------------------------------------------------------------------------------
Mean Group Variables: logfeer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in the data.

. 
. estat ic, model(logreer logfeer)
Running 3 combinations of cross-section averages:
. . . 
IC from Margaritella & Westerlund (2023)
---------------------------------------------------------------------------------
  Model   |    IC1             IC2           PC1            PC2
----------+----------------------------------------------------------------------
   1      |    -4.23          -4.18          .0143        .0143
   2      |    -4.26          -4.21           .014         .014
   3      |    -4.41*         -4.32*         .0128*       .0128*
---------------------------------------------------------------------------------
 * indicates minimum.

 Cross Section Averages:
  Model 1: logfeer 
  Model 2: logreer 
  Model 3: logreer logfeer (Main Model)
 Click on Model to run in xtdcce2.

. 
. xtdcce2  logfeer logreer, crosssectional(_all, rcclassifier)
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       3.31
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.65
 variables partialled out           = 78         R-squared (MG)    =       0.64
                                                 Root MSE          =       0.12
                                                 CD Statistic      =      -2.63
                                                    p-value        =     0.0086
-------------------------------------------------------------------------------
        logfeer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logreer|  .5827229   .0951959    6.12    0.000      .3961424   .7693034
-------------------------------------------------------------------------------
Mean Group Variables: logreer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in the data.

. 
. estat ic, model(logfeer logreer)
Running 3 combinations of cross-section averages:
. . . 
IC from Margaritella & Westerlund (2023)
---------------------------------------------------------------------------------
  Model   |    IC1             IC2           PC1            PC2
----------+----------------------------------------------------------------------
   1      |    -3.79          -3.75          .0222        .0222
   2      |       -4          -3.95*         .0188        .0188
   3      |    -4.02*         -3.93           .018*        .018*
---------------------------------------------------------------------------------
 * indicates minimum.

 Cross Section Averages:
  Model 1: logreer 
  Model 2: logfeer 
  Model 3: logfeer logreer (Main Model)
 Click on Model to run in xtdcce2.

. 
. label var logreer_cs ///
>  "CSA of Log Real Effective Exchange Rates" 

. 
. label var logfeer_cs ///
>  "CSA of Log Fundamental Equilibrium Exchange Rates"

. 
. set scheme stgcolor_mv

. 
. xtline logreer_cs, overlay xtitle("") ///
>  name(logreer_cs, replace)

. 
. xtline logfeer_cs, overlay xtitle("") ///
>  name(logfeer_cs, replace)

. 
end of do-file

. do "C:\Users\jamel\AppData\Local\Temp\STD7334_000010.tmp"

. **# ** Testing the rank condition
. 
. *do xr-dynamics_residual_testing.do
. 
. xtdcce2  logreer logfeer, crosssectional(_all, rcclassifier)
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       4.80
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.57
 variables partialled out           = 78         R-squared (MG)    =       0.72
                                                 Root MSE          =       0.10
                                                 CD Statistic      =      -2.25
                                                    p-value        =     0.0246
-------------------------------------------------------------------------------
        logreer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logfeer|  .4276603   .0765973    5.58    0.000      .2775323   .5777882
-------------------------------------------------------------------------------
Mean Group Variables: logfeer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in the data.

. 
. estat ic, model(logreer logfeer)
Running 3 combinations of cross-section averages:
. . . 
IC from Margaritella & Westerlund (2023)
---------------------------------------------------------------------------------
  Model   |    IC1             IC2           PC1            PC2
----------+----------------------------------------------------------------------
   1      |    -4.23          -4.18          .0143        .0143
   2      |    -4.26          -4.21           .014         .014
   3      |    -4.41*         -4.32*         .0128*       .0128*
---------------------------------------------------------------------------------
 * indicates minimum.

 Cross Section Averages:
  Model 1: logfeer 
  Model 2: logreer 
  Model 3: logreer logfeer (Main Model)
 Click on Model to run in xtdcce2.

. 
. xtdcce2  logfeer logreer, crosssectional(_all, rcclassifier)
(Dynamic) Common Correlated Effects Estimator - Mean Group

Panel Variable (i): cn                           Number of obs     =        754
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         29
 without cross-sectional averages   = 27
 with cross-sectional averages      = 25
Number of                                        F(104, 650)       =       3.31
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 26         R-squared         =       0.65
 variables partialled out           = 78         R-squared (MG)    =       0.64
                                                 Root MSE          =       0.12
                                                 CD Statistic      =      -2.63
                                                    p-value        =     0.0086
-------------------------------------------------------------------------------
        logfeer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Mean Group:   |
        logreer|  .5827229   .0951959    6.12    0.000      .3961424   .7693034
-------------------------------------------------------------------------------
Mean Group Variables: logreer
Cross Sectional Averaged Variables: logreer logfeer 
Heterogenous constant partialled out. 
---------------------------------------------------------------------
Classifier for Rank Condition (De Vos, Everaert and Sarafidis, 2024)
---------------------------------------------------------------------
     RC       |    Estimated
 (1-I(g<m))*  |  Rank (g)    Number of Factors (m)
--------------+------------------------------------------------------
     1        |   1              1
---------------------------------------------------------------------
* RC=1 indicates rank condition holds. g is rank of matrix of cross-sectional averages, m is number of factors in the data.

. 
. estat ic, model(logfeer logreer)
Running 3 combinations of cross-section averages:
. . . 
IC from Margaritella & Westerlund (2023)
---------------------------------------------------------------------------------
  Model   |    IC1             IC2           PC1            PC2
----------+----------------------------------------------------------------------
   1      |    -3.79          -3.75          .0222        .0222
   2      |       -4          -3.95*         .0188        .0188
   3      |    -4.02*         -3.93           .018*        .018*
---------------------------------------------------------------------------------
 * indicates minimum.

 Cross Section Averages:
  Model 1: logreer 
  Model 2: logfeer 
  Model 3: logfeer logreer (Main Model)
 Click on Model to run in xtdcce2.

. 
. label var logreer_cs ///
>  "CSA of Log Real Effective Exchange Rates" 

. 
. label var logfeer_cs ///
>  "CSA of Log Fundamental Equilibrium Exchange Rates"

. 
. set scheme stcolor

. 
. xtline logreer_cs, overlay xtitle("") ///
>  name(logreer_cs, replace)

. 
. xtline logfeer_cs, overlay xtitle("") ///
>  name(logfeer_cs, replace)

. 
end of do-file

. exit, clear
