----------------------------------------------------------------------------------------------
      name:  xrdynamics
       log:  C:\Users\jamel\Documents\GitHub\ResearchPapers\Saadaoui 2015\xrdynamics.log
  log type:  text
 opened on:  16 Dec 2023, 07:57:07

. 
. *Import the data from Excel
. 
. 
. import excel EXCEL_0215a.xlsx, /// 
> sheet("data_fin") firstrow clear // Note 1
(7 vars, 754 obs)

. 
. *Install User-Written Stata Programs
. 
. capture ssc install pescadf // Note 2

. capture ssc install xtwest

. capture ssc install xtpmg

. capture ssc install xtmg

. capture ssc install ltimbimata

. capture ssc install xtdolshm

. capture ssc install outreg2

. capture net install xtdcce2 , ///
>  from("https://janditzen.github.io/xtdcce2/")

. 
. *Generate variable in logarithm
. 
. generate logreer = ln(reer)

. generate logfeer = ln(feer)

. generate logreer_cs = ln(reer_cs)

. generate logfeer_cs = ln(feer_cs)

. 
. *Panel setting (N=26; T=29; N*T=754)
. 
. gen datayear = yofd(period)

. encode country, generate(cn)

. order cn datayear, first

. 
. xtset cn datayear, yearly

Panel variable: cn (strongly balanced)
 Time variable: datayear, 1982 to 2010
         Delta: 1 year

. xtdescribe

      cn:  1, 2, ..., 26                                     n =         26
datayear:  1982, 1983, ..., 2010                             T =         29
           Delta(datayear) = 1 year
           Span(datayear)  = 29 periods
           (cn*datayear uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                        29      29      29        29        29      29      29

     Freq.  Percent    Cum. |  Pattern
 ---------------------------+-------------------------------
       26    100.00  100.00 |  11111111111111111111111111111
 ---------------------------+-------------------------------
       26    100.00         |  XXXXXXXXXXXXXXXXXXXXXXXXXXXXX

. 
. *UNIT ROOT TEST
. *CADF test (Pesaran, 2007)
. 
. pescadf  logfeer, lags(1) trend

Pesaran's CADF test for logfeer
Cross-sectional average in first period extracted and extreme t-values truncated
Deterministics chosen: constant & trend

t-bar test, N,T = (26,29)         Obs = 702    
Augmented by 1 lags (average) 

    t-bar     cv10      cv5       cv1   Z[t-bar]    P-value
   -2.542   -2.580    -2.660    -2.810   -1.274     0.101

. pescadf  logreer, lags(1) trend

Pesaran's CADF test for logreer
Cross-sectional average in first period extracted and extreme t-values truncated
Deterministics chosen: constant & trend

t-bar test, N,T = (26,29)         Obs = 702    
Augmented by 1 lags (average) 

    t-bar     cv10      cv5       cv1   Z[t-bar]    P-value
   -2.279   -2.580    -2.660    -2.810    0.169     0.567

. pescadf  d.logfeer, lags(1) trend

Pesaran's CADF test for D.logfeer
Cross-sectional average in first period extracted and extreme t-values truncated
Deterministics chosen: constant & trend

t-bar test, N,T = (26,28)         Obs = 676    
Augmented by 1 lags (average) 

    t-bar     cv10      cv5       cv1   Z[t-bar]    P-value
   -3.493   -2.580    -2.660    -2.810   -6.488     0.000

. pescadf  d.logreer, lags(1) trend

Pesaran's CADF test for D.logreer
Cross-sectional average in first period extracted and extreme t-values truncated
Deterministics chosen: constant & trend

t-bar test, N,T = (26,28)         Obs = 676    
Augmented by 1 lags (average) 

    t-bar     cv10      cv5       cv1   Z[t-bar]    P-value
   -3.283   -2.580    -2.660    -2.810   -5.336     0.000

. 
. *COINTEGRATION TESTS
. *Persyn & Westerlund (2008)
. 
. xtwest logreer logfeer, lags (0 2) 

Calculating Westerlund ECM panel cointegration tests..........

Results for H0: no cointegration
With 26 series and 1 covariate
Average AIC selected lag length: .62
Average AIC selected lead length: 0

-----------------------------------------------+
 Statistic |   Value   |  Z-value  |  P-value  |
-----------+-----------+-----------+-----------|
     Gt    |   -1.661  |   -3.355  |   0.000   |
     Ga    |   -4.714  |   -1.022  |   0.153   |
     Pt    |   -8.020  |   -4.641  |   0.000   |
     Pa    |   -3.495  |   -4.347  |   0.000   |
-----------------------------------------------+

. xtwest logfeer logreer, lags (0 2)

Calculating Westerlund ECM panel cointegration tests..........

Results for H0: no cointegration
With 26 series and 1 covariate
Average AIC selected lag length: .6900000000000001
Average AIC selected lead length: 0

-----------------------------------------------+
 Statistic |   Value   |  Z-value  |  P-value  |
-----------+-----------+-----------+-----------|
     Gt    |   -2.328  |   -6.627  |   0.000   |
     Ga    |   -7.455  |   -4.095  |   0.000   |
     Pt    |  -10.104  |   -6.427  |   0.000   |
     Pa    |   -5.323  |   -7.566  |   0.000   |
-----------------------------------------------+

. 
. *set matsize 800
. 
. *xtwest logreer logfeer, lags (0 2) bootstrap(100)
. *xtwest logfeer logreer, lags (0 2) bootstrap(100)
. 
. // ESTIMATION OF THE ERROR-CORRECTION MODEL THANKS TO
. // THE PMG (CPMG) ESTIMATOR
. // PESARAN et al. (1999)
. 
. xtpmg d.logreer d.logfeer, ///
> lr(l.logreer logfeer) ec(ec) replace pmg full

Iteration 0:  Log likelihood =  1163.0971  
Iteration 1:  Log likelihood =  1169.4094  
Iteration 2:  Log likelihood =  1169.8599  
Iteration 3:  Log likelihood =  1169.8599  

Pooled Mean Group Regression
(Estimate results saved as PMG)

Panel Variable (i): cn                          Number of obs      =       728
Time Variable (t): datayear                     Number of groups   =        26
                                                Obs per group: min =        28
                                                               avg =      28.0
                                                               max =        28

                                                Log Likelihood     =   1169.86
------------------------------------------------------------------------------
   D.logreer | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
ec           |
     logfeer |   .6430313   .0622934    10.32   0.000     .5209384    .7651242
-------------+----------------------------------------------------------------
cn_1         |
          ec |  -.2360765   .1256905    -1.88   0.060    -.4824253    .0102724
             |
     logfeer |
         D1. |   .2837422   .1530462     1.85   0.064     -.016223    .5837073
             |
       _cons |   .4211581   .2346993     1.79   0.073    -.0388441    .8811603
-------------+----------------------------------------------------------------
cn_2         |
          ec |  -.1191844   .0680656    -1.75   0.080    -.2525906    .0142217
             |
     logfeer |
         D1. |  -.0153552   .0596062    -0.26   0.797    -.1321811    .1014707
             |
       _cons |   .1921652   .1208895     1.59   0.112    -.0447739    .4291043
-------------+----------------------------------------------------------------
cn_3         |
          ec |  -.1979727   .0907916    -2.18   0.029     -.375921   -.0200245
             |
     logfeer |
         D1. |   .0567338   .1818382     0.31   0.755    -.2996625    .4131302
             |
       _cons |   .3288789   .1706062     1.93   0.054    -.0055031    .6632608
-------------+----------------------------------------------------------------
cn_4         |
          ec |  -.3145524   .0566905    -5.55   0.000    -.4256638    -.203441
             |
     logfeer |
         D1. |  -.0091134     .08086    -0.11   0.910    -.1675961    .1493692
             |
       _cons |    .533818   .1333882     4.00   0.000      .272382     .795254
-------------+----------------------------------------------------------------
cn_5         |
          ec |   -.513033   .0995045    -5.16   0.000    -.7080582   -.3180078
             |
     logfeer |
         D1. |  -.2949917   .1135371    -2.60   0.009    -.5175204   -.0724631
             |
       _cons |   .8703244   .1971559     4.41   0.000     .4839059    1.256743
-------------+----------------------------------------------------------------
cn_6         |
          ec |   .0525849   .0835738     0.63   0.529    -.1112168    .2163866
             |
     logfeer |
         D1. |  -.0130016   .0934529    -0.14   0.889    -.1961659    .1701627
             |
       _cons |  -.0678677   .1345755    -0.50   0.614    -.3316309    .1958956
-------------+----------------------------------------------------------------
cn_7         |
          ec |  -.1052722   .0598197    -1.76   0.078    -.2225166    .0119721
             |
     logfeer |
         D1. |   .0164521   .1439855     0.11   0.909    -.2657543    .2986585
             |
       _cons |   .1710435     .10105     1.69   0.091     -.027011    .3690979
-------------+----------------------------------------------------------------
cn_8         |
          ec |  -.0032133   .0671926    -0.05   0.962    -.1349084    .1284817
             |
     logfeer |
         D1. |   .0024626   .0834395     0.03   0.976    -.1610759    .1660011
             |
       _cons |   .0066175   .1074026     0.06   0.951    -.2038877    .2171226
-------------+----------------------------------------------------------------
cn_9         |
          ec |  -.0923703   .0887319    -1.04   0.298    -.2662816    .0815411
             |
     logfeer |
         D1. |    .318432   .1178131     2.70   0.007     .0875226    .5493414
             |
       _cons |   .1524593   .1490816     1.02   0.306    -.1397353    .4446539
-------------+----------------------------------------------------------------
cn_10        |
          ec |  -.0146074   .0440294    -0.33   0.740    -.1009033    .0716886
             |
     logfeer |
         D1. |    .051184   .0582314     0.88   0.379    -.0629475    .1653155
             |
       _cons |   .0176248   .0714408     0.25   0.805    -.1223966    .1576463
-------------+----------------------------------------------------------------
cn_11        |
          ec |  -.2046411   .0858242    -2.38   0.017    -.3728535   -.0364288
             |
     logfeer |
         D1. |   .0541601   .1030799     0.53   0.599    -.1478729     .256193
             |
       _cons |   .3312871   .1429321     2.32   0.020     .0511453     .611429
-------------+----------------------------------------------------------------
cn_12        |
          ec |  -.2574793   .0893237    -2.88   0.004    -.4325506   -.0824081
             |
     logfeer |
         D1. |   .5602566   .1418017     3.95   0.000     .2823304    .8381828
             |
       _cons |   .4039731   .1395593     2.89   0.004     .1304419    .6775043
-------------+----------------------------------------------------------------
cn_13        |
          ec |  -.1948842   .1234303    -1.58   0.114    -.4368031    .0470347
             |
     logfeer |
         D1. |   .4906867   .1499483     3.27   0.001     .1967936    .7845799
             |
       _cons |   .3111683   .2029033     1.53   0.125    -.0865149    .7088515
-------------+----------------------------------------------------------------
cn_14        |
          ec |   -.236722   .1307998    -1.81   0.070    -.4930849     .019641
             |
     logfeer |
         D1. |   .3728104   .1414064     2.64   0.008     .0956589     .649962
             |
       _cons |   .3797279   .2195656     1.73   0.084    -.0506128    .8100686
-------------+----------------------------------------------------------------
cn_15        |
          ec |  -.1163081   .1048748    -1.11   0.267    -.3218589    .0892427
             |
     logfeer |
         D1. |   .8996652    .146454     6.14   0.000     .6126207     1.18671
             |
       _cons |   .2006476   .1822086     1.10   0.271    -.1564747    .5577699
-------------+----------------------------------------------------------------
cn_16        |
          ec |  -.5017237   .1774268    -2.83   0.005    -.8494738   -.1539735
             |
     logfeer |
         D1. |   .3937592   .2768535     1.42   0.155    -.1488637     .936382
             |
       _cons |   .8162058   .3196179     2.55   0.011     .1897662    1.442645
-------------+----------------------------------------------------------------
cn_17        |
          ec |  -.2376875   .1104648    -2.15   0.031    -.4541945   -.0211804
             |
     logfeer |
         D1. |   .6258089   .1541457     4.06   0.000      .323689    .9279288
             |
       _cons |   .3970974     .20681     1.92   0.055    -.0082428    .8024375
-------------+----------------------------------------------------------------
cn_18        |
          ec |  -.1774995   .0537494    -3.30   0.001    -.2828463   -.0721526
             |
     logfeer |
         D1. |   .6212611   .0709335     8.76   0.000      .482234    .7602881
             |
       _cons |   .2892848   .0835627     3.46   0.001      .125505    .4530646
-------------+----------------------------------------------------------------
cn_19        |
          ec |  -.3694693   .1925893    -1.92   0.055    -.7469373    .0079987
             |
     logfeer |
         D1. |   .1974048   .1313046     1.50   0.133    -.0599474     .454757
             |
       _cons |   .5947906   .3356861     1.77   0.076     -.063142    1.252723
-------------+----------------------------------------------------------------
cn_20        |
          ec |  -.3694692   .1241473    -2.98   0.003    -.6127933    -.126145
             |
     logfeer |
         D1. |    .263648    .102102     2.58   0.010     .0635317    .4637642
             |
       _cons |    .614332   .2334219     2.63   0.008     .1568335    1.071831
-------------+----------------------------------------------------------------
cn_21        |
          ec |  -.0199662   .0205926    -0.97   0.332     -.060327    .0203945
             |
     logfeer |
         D1. |   .1022261   .0361437     2.83   0.005     .0313857    .1730665
             |
       _cons |   .0234627    .034934     0.67   0.502    -.0450066     .091932
-------------+----------------------------------------------------------------
cn_22        |
          ec |   .0301417   .0382111     0.79   0.430    -.0447506     .105034
             |
     logfeer |
         D1. |  -.1216504   .0832579    -1.46   0.144    -.2848329    .0415322
             |
       _cons |   -.050522   .0631094    -0.80   0.423    -.1742141    .0731701
-------------+----------------------------------------------------------------
cn_23        |
          ec |  -.2091442   .0912423    -2.29   0.022    -.3879758   -.0303126
             |
     logfeer |
         D1. |  -.0042693   .0892268    -0.05   0.962    -.1791506     .170612
             |
       _cons |   .3388096   .1492231     2.27   0.023     .0463377    .6312816
-------------+----------------------------------------------------------------
cn_24        |
          ec |  -.2422344   .1200855    -2.02   0.044    -.4775976   -.0068712
             |
     logfeer |
         D1. |   .4628208   .0910136     5.09   0.000     .2844374    .6412042
             |
       _cons |   .4033607   .2060189     1.96   0.050     -.000429    .8071504
-------------+----------------------------------------------------------------
cn_25        |
          ec |  -.4078112   .1267222    -3.22   0.001    -.6561821   -.1594403
             |
     logfeer |
         D1. |   .1487307   .1284598     1.16   0.247     -.103046    .4005073
             |
       _cons |   .7002477   .2437276     2.87   0.004     .2225504    1.177945
-------------+----------------------------------------------------------------
cn_26        |
          ec |  -.1143588    .072319    -1.58   0.114    -.2561014    .0273838
             |
     logfeer |
         D1. |   .2979958   .1304101     2.29   0.022     .0423966    .5535949
             |
       _cons |   .1882795   .1264749     1.49   0.137    -.0596068    .4361658
------------------------------------------------------------------------------

. 
. // Residual testing (start)
. 
. // https://www.statalist.org/forums/forum/general-stata-discussion/general/1333633-residual-
> testing-for-pooled-mean-group-estimator
. 
. capture drop yhat

. gen yhat = .
(754 missing values generated)

. forval cn = 1/26 {
  2. predict temp if cn ==`cn', eq(cn_`cn')
  3. replace yhat = temp if cn == `cn'
  4. drop temp
  5. }
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)

. 
. gen residuals = d.logreer - yhat
(26 missing values generated)

. 
. xtline d.logreer yhat

. 
. xtcdf residuals

xtcd test on variables residuals
Panelvar: cn
Timevar: datayear
------------------------------------------------------------------------------+
    Variable    |  CD-test   p-value   average joint T | mean ρ   mean abs(ρ) |
----------------+--------------------------------------+----------------------|
   residuals    +  1.256      0.209         28.00      +  0.01       0.22     | 
------------------------------------------------------------------------------+
 Notes: Under the null hypothesis of cross-section independence, CD ~ N(0,1)
        P-values close to zero indicate data are correlated across panel groups.

. 
. // Residual testing (end)
. 
. outreg2 using tables\results_pmg_1, ///
> excel pvalue replace ///
> cttop(D.logreer) addnote(Notes:) // Note 2
tables\results_pmg_1.xml
dir : seeout

. 
. xtpmg d.logfeer d.logreer, ///
> lr(l.logfeer logreer) ec(ec) replace pmg

Iteration 0:  Log likelihood =  875.85235  
Iteration 1:  Log likelihood =  884.09806  
Iteration 2:  Log likelihood =  884.58708  
Iteration 3:  Log likelihood =  884.58726  
Iteration 4:  Log likelihood =  884.58726  

Pooled Mean Group Regression
(Estimate results saved as pmg)

Panel Variable (i): cn                          Number of obs      =       728
Time Variable (t): datayear                     Number of groups   =        26
                                                Obs per group: min =        28
                                                               avg =      28.0
                                                               max =        28

                                                Log Likelihood     =  884.5873
------------------------------------------------------------------------------
   D.logfeer | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
ec           |
     logreer |   .7079455   .0424993    16.66   0.000     .6246485    .7912426
-------------+----------------------------------------------------------------
SR           |
          ec |  -.3271077   .0398113    -8.22   0.000    -.4051365    -.249079
             |
     logreer |
         D1. |   .3633986   .1166468     3.12   0.002     .1347752    .5920221
             |
       _cons |   .4442126   .0536836     8.27   0.000     .3389946    .5494306
------------------------------------------------------------------------------

. 
. outreg2 using tables\results_pmg_2, /// 
> excel pvalue replace ///
> cttop(D.logfeer) addnote(Notes:)
tables\results_pmg_2.xml
dir : seeout

. 
. xtpmg d.logreer d.logfeer d.logreer_cs d.logfeer_cs, /// 
> lr(l.logreer logfeer l.logreer_cs logfeer_cs) ///
> ec(ec) replace pmg full

Iteration 0:  Log likelihood =  1249.6661  (not concave)
Iteration 1:  Log likelihood =  1251.6306  
Iteration 2:  Log likelihood =  1251.9822  
Iteration 3:  Log likelihood =  1253.7247  
Iteration 4:  Log likelihood =  1253.7338  
Iteration 5:  Log likelihood =  1253.7338  

Pooled Mean Group Regression
(Estimate results saved as PMG)

Panel Variable (i): cn                          Number of obs      =       728
Time Variable (t): datayear                     Number of groups   =        26
                                                Obs per group: min =        28
                                                               avg =      28.0
                                                               max =        28

                                                Log Likelihood     =  1253.734
------------------------------------------------------------------------------
   D.logreer | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
ec           |
     logfeer |   .7377218   .0574136    12.85   0.000     .6251931    .8502505
             |
  logreer_cs |
         L1. |  -.0283034   .1605633    -0.18   0.860    -.3430017    .2863949
             |
  logfeer_cs |  -.1871242   .1168044    -1.60   0.109    -.4160566    .0418081
-------------+----------------------------------------------------------------
cn_1         |
          ec |  -.1894082   .1129031    -1.68   0.093    -.4106942    .0318777
             |
     logfeer |
         D1. |   .3506146   .1454585     2.41   0.016     .0655213    .6357079
             |
  logreer_cs |
         D1. |   3.829925     1.3544     2.83   0.005     1.175349      6.4845
             |
  logfeer_cs |
         D1. |  -2.945176     1.1452    -2.57   0.010    -5.189727    -.700624
             |
       _cons |   .4300237   .2834434     1.52   0.129    -.1255152    .9855625
-------------+----------------------------------------------------------------
cn_2         |
          ec |  -.1124979   .0567181    -1.98   0.047    -.2236634   -.0013324
             |
     logfeer |
         D1. |  -.0206766   .0570225    -0.36   0.717    -.1324387    .0910854
             |
  logreer_cs |
         D1. |  -.1390027   .1261584    -1.10   0.271    -.3862686    .1082631
             |
  logfeer_cs |
         D1. |  -.1361439   .1020813    -1.33   0.182    -.3362196    .0639319
             |
       _cons |   .2457494   .1441173     1.71   0.088    -.0367152    .5282141
-------------+----------------------------------------------------------------
cn_3         |
          ec |   -.169995   .0778678    -2.18   0.029    -.3226131   -.0173769
             |
     logfeer |
         D1. |   .2148019   .1731857     1.24   0.215    -.1246358    .5542396
             |
  logreer_cs |
         D1. |   2.472622   .9362568     2.64   0.008     .6375929    4.307652
             |
  logfeer_cs |
         D1. |  -.8921674   .7187324    -1.24   0.214    -2.300857    .5165222
             |
       _cons |   .3737349   .2087233     1.79   0.073    -.0353553    .7828251
-------------+----------------------------------------------------------------
cn_4         |
          ec |  -.2059717   .0617008    -3.34   0.001     -.326903   -.0850404
             |
     logfeer |
         D1. |     .04803   .0845013     0.57   0.570    -.1175895    .2136496
             |
  logreer_cs |
         D1. |   .9927471   .3981225     2.49   0.013     .2124414    1.773053
             |
  logfeer_cs |
         D1. |  -.2912807    .297638    -0.98   0.328    -.8746405    .2920791
             |
       _cons |   .4674705    .180339     2.59   0.010     .1140125    .8209285
-------------+----------------------------------------------------------------
cn_5         |
          ec |  -.6134603   .1110102    -5.53   0.000    -.8310362   -.3958843
             |
     logfeer |
         D1. |   -.363904   .1153014    -3.16   0.002    -.5898906   -.1379174
             |
  logreer_cs |
         D1. |  -.7516943    .649077    -1.16   0.247    -2.023862    .5204732
             |
  logfeer_cs |
         D1. |  -.3165882   .5117836    -0.62   0.536    -1.319666    .6864892
             |
       _cons |   1.392239   .4531849     3.07   0.002     .5040132    2.280466
-------------+----------------------------------------------------------------
cn_6         |
          ec |   .1579466   .0609549     2.59   0.010     .0384773    .2774159
             |
     logfeer |
         D1. |  -.0841473   .0753854    -1.12   0.264    -.2318999    .0636053
             |
  logreer_cs |
         D1. |   2.374019   .5609751     4.23   0.000     1.274528     3.47351
             |
  logfeer_cs |
         D1. |   .2397022   .4693981     0.51   0.610    -.6803013    1.159706
             |
       _cons |   -.332131   .1653812    -2.01   0.045    -.6562722   -.0079898
-------------+----------------------------------------------------------------
cn_7         |
          ec |   -.093963   .0502589    -1.87   0.062    -.1924687    .0045427
             |
     logfeer |
         D1. |   .0037357   .1345581     0.03   0.978    -.2599933    .2674647
             |
  logreer_cs |
         D1. |  -.5643007   .3483977    -1.62   0.105    -1.247148    .1185463
             |
  logfeer_cs |
         D1. |   .5446675   .2831406     1.92   0.054    -.0102779    1.099613
             |
       _cons |   .2071315   .1229832     1.68   0.092    -.0339111    .4481742
-------------+----------------------------------------------------------------
cn_8         |
          ec |   .0241152   .0577952     0.42   0.676    -.0891614    .1373918
             |
     logfeer |
         D1. |   .0306869   .0821944     0.37   0.709    -.1304112     .191785
             |
  logreer_cs |
         D1. |  -.0263702   .1764678    -0.15   0.881    -.3722408    .3195004
             |
  logfeer_cs |
         D1. |  -.2274016   .1502858    -1.51   0.130    -.5219562    .0671531
             |
       _cons |  -.0498416   .1258971    -0.40   0.692    -.2965953     .196912
-------------+----------------------------------------------------------------
cn_9         |
          ec |  -.0935918   .0738823    -1.27   0.205    -.2383985    .0512149
             |
     logfeer |
         D1. |    .284042   .1155247     2.46   0.014     .0576177    .5104664
             |
  logreer_cs |
         D1. |  -.0860538   .1867565    -0.46   0.645    -.4520898    .2799822
             |
  logfeer_cs |
         D1. |  -.2565344   .1477378    -1.74   0.082    -.5460953    .0330264
             |
       _cons |   .2086883   .1716745     1.22   0.224    -.1277875    .5451641
-------------+----------------------------------------------------------------
cn_10        |
          ec |  -.0096089   .0340995    -0.28   0.778    -.0764428     .057225
             |
     logfeer |
         D1. |   .0666507   .0469363     1.42   0.156    -.0253427    .1586441
             |
  logreer_cs |
         D1. |   .6417235   .1873199     3.43   0.001     .2745831    1.008864
             |
  logfeer_cs |
         D1. |   .1000678   .1502861     0.67   0.506    -.1944875    .3946231
             |
       _cons |   .0121983   .0745043     0.16   0.870    -.1338275    .1582242
-------------+----------------------------------------------------------------
cn_11        |
          ec |  -.2328565   .0880231    -2.65   0.008    -.4053787   -.0603343
             |
     logfeer |
         D1. |   .0125142   .1103004     0.11   0.910    -.2036706     .228699
             |
  logreer_cs |
         D1. |  -.0652017   .4172119    -0.16   0.876     -.882922    .7525187
             |
  logfeer_cs |
         D1. |   .2873279   .3585786     0.80   0.423    -.4154733     .990129
             |
       _cons |   .5076221   .2392558     2.12   0.034     .0386892    .9765549
-------------+----------------------------------------------------------------
cn_12        |
          ec |  -.2663371   .0949326    -2.81   0.005    -.4524016   -.0802726
             |
     logfeer |
         D1. |   .5509438   .1684647     3.27   0.001     .2207591    .8811284
             |
  logreer_cs |
         D1. |    .283073   .8669797     0.33   0.744    -1.416176    1.982322
             |
  logfeer_cs |
         D1. |  -.3293627   .6499746    -0.51   0.612     -1.60329    .9445641
             |
       _cons |   .5752471   .2517697     2.28   0.022     .0817876    1.068707
-------------+----------------------------------------------------------------
cn_13        |
          ec |  -.2047448    .124372    -1.65   0.100    -.4485095    .0390199
             |
     logfeer |
         D1. |   .5393073   .1556957     3.46   0.001     .2341493    .8444654
             |
  logreer_cs |
         D1. |   .0370013   .2647792     0.14   0.889    -.4819565    .5559591
             |
  logfeer_cs |
         D1. |  -.2701562   .2116295    -1.28   0.202    -.6849425    .1446301
             |
       _cons |   .4454229   .2945768     1.51   0.131     -.131937    1.022783
-------------+----------------------------------------------------------------
cn_14        |
          ec |  -.2259926   .1314643    -1.72   0.086    -.4836579    .0316727
             |
     logfeer |
         D1. |    .350778   .1467226     2.39   0.017      .063207     .638349
             |
  logreer_cs |
         D1. |  -.2666466   .2826945    -0.94   0.346    -.8207177    .2874245
             |
  logfeer_cs |
         D1. |   .2041824   .2223811     0.92   0.359    -.2316765    .6400414
             |
       _cons |   .4913251   .3259825     1.51   0.132    -.1475889    1.130239
-------------+----------------------------------------------------------------
cn_15        |
          ec |  -.1634506   .1145453    -1.43   0.154    -.3879552     .061054
             |
     logfeer |
         D1. |   .8540041   .1569577     5.44   0.000     .5463726    1.161636
             |
  logreer_cs |
         D1. |   .0828206   .3131086     0.26   0.791     -.530861    .6965022
             |
  logfeer_cs |
         D1. |  -.0584674   .2496783    -0.23   0.815    -.5478279    .4308931
             |
       _cons |   .3712416   .2770208     1.34   0.180    -.1717092    .9141925
-------------+----------------------------------------------------------------
cn_16        |
          ec |  -.5878042   .1396079    -4.21   0.000    -.8614306   -.3141778
             |
     logfeer |
         D1. |   .2137055   .2410574     0.89   0.375    -.2587582    .6861693
             |
  logreer_cs |
         D1. |   1.354403   .3916642     3.46   0.001     .5867555    2.122051
             |
  logfeer_cs |
         D1. |   .1424235    .338513     0.42   0.674    -.5210498    .8058969
             |
       _cons |   1.283743   .4608549     2.79   0.005     .3804844    2.187002
-------------+----------------------------------------------------------------
cn_17        |
          ec |   -.304749   .1029519    -2.96   0.003    -.5065309   -.1029671
             |
     logfeer |
         D1. |   .4742518   .1636979     2.90   0.004     .1534099    .7950938
             |
  logreer_cs |
         D1. |   1.736799   .6707233     2.59   0.010     .4222055    3.051392
             |
  logfeer_cs |
         D1. |  -.6272488   .5134104    -1.22   0.222    -1.633515    .3790171
             |
       _cons |   .6763389   .3107149     2.18   0.030     .0673489    1.285329
-------------+----------------------------------------------------------------
cn_18        |
          ec |  -.1383537   .0634557    -2.18   0.029    -.2627245   -.0139828
             |
     logfeer |
         D1. |   .5976286   .0718281     8.32   0.000     .4568481    .7384091
             |
  logreer_cs |
         D1. |   .2866742   .2386323     1.20   0.230    -.1810365     .754385
             |
  logfeer_cs |
         D1. |   .0475582   .1657291     0.29   0.774     -.277265    .3723813
             |
       _cons |   .3067872   .1531547     2.00   0.045     .0066095     .606965
-------------+----------------------------------------------------------------
cn_19        |
          ec |  -.5305184    .138051    -3.84   0.000    -.8010933   -.2599435
             |
     logfeer |
         D1. |   .2773174   .1185788     2.34   0.019     .0449072    .5097275
             |
  logreer_cs |
         D1. |  -.6037296   .1609997    -3.75   0.000    -.9192833   -.2881759
             |
  logfeer_cs |
         D1. |  -.2083184   .1178045    -1.77   0.077     -.439211    .0225743
             |
       _cons |   1.158405   .4782353     2.42   0.015     .2210815    2.095729
-------------+----------------------------------------------------------------
cn_20        |
          ec |   -.277002   .0918866    -3.01   0.003    -.4570965   -.0969076
             |
     logfeer |
         D1. |   .2056183   .0953591     2.16   0.031      .018718    .3925186
             |
  logreer_cs |
         D1. |   1.648532    .361904     4.56   0.000     .9392127     2.35785
             |
  logfeer_cs |
         D1. |  -.2380128   .3368647    -0.71   0.480    -.8982556      .42223
             |
       _cons |   .6167369   .2614999     2.36   0.018     .1042067    1.129267
-------------+----------------------------------------------------------------
cn_21        |
          ec |  -.0283947   .0181555    -1.56   0.118    -.0639787    .0071893
             |
     logfeer |
         D1. |   .0981107   .0357821     2.74   0.006      .027979    .1682424
             |
  logreer_cs |
         D1. |   .3880169   .1768361     2.19   0.028     .0414246    .7346093
             |
  logfeer_cs |
         D1. |   .0309937   .1543988     0.20   0.841    -.2716225    .3336098
             |
       _cons |   .0515268   .0441967     1.17   0.244    -.0350971    .1381507
-------------+----------------------------------------------------------------
cn_22        |
          ec |   .0457469   .0404461     1.13   0.258     -.033526    .1250198
             |
     logfeer |
         D1. |  -.1907169   .0889872    -2.14   0.032    -.3651287   -.0163051
             |
  logreer_cs |
         D1. |  -.3739197   .3609043    -1.04   0.300    -1.081279    .3334398
             |
  logfeer_cs |
         D1. |   .4593453   .2559446     1.79   0.073    -.0422968    .9609875
             |
       _cons |  -.1003245   .0930305    -1.08   0.281    -.2826608    .0820119
-------------+----------------------------------------------------------------
cn_23        |
          ec |   -.209998   .0833106    -2.52   0.012    -.3732838   -.0467123
             |
     logfeer |
         D1. |  -.0296053   .0843604    -0.35   0.726    -.1949487     .135738
             |
  logreer_cs |
         D1. |   .5708699   .3944653     1.45   0.148    -.2022678    1.344008
             |
  logfeer_cs |
         D1. |   .3047113   .3136149     0.97   0.331    -.3099626    .9193852
             |
       _cons |   .4580418   .2142813     2.14   0.033     .0380581    .8780254
-------------+----------------------------------------------------------------
cn_24        |
          ec |  -.3195684   .1337716    -2.39   0.017    -.5817559    -.057381
             |
     logfeer |
         D1. |   .4147443   .1016119     4.08   0.000     .2155886       .6139
             |
  logreer_cs |
         D1. |  -.2494996   .1771301    -1.41   0.159    -.5966682     .097669
             |
  logfeer_cs |
         D1. |    .053888   .1298519     0.41   0.678    -.2006171     .308393
             |
       _cons |   .7077993   .3743648     1.89   0.059    -.0259423    1.441541
-------------+----------------------------------------------------------------
cn_25        |
          ec |  -.1851053   .1076925    -1.72   0.086    -.3961787    .0259681
             |
     logfeer |
         D1. |    .341881   .1076957     3.17   0.002     .1308014    .5529606
             |
  logreer_cs |
         D1. |   2.649429   .5734962     4.62   0.000     1.525397    3.773461
             |
  logfeer_cs |
         D1. |  -1.423355   .4222446    -3.37   0.001     -2.25094   -.5957711
             |
       _cons |   .4159815    .263809     1.58   0.115    -.1010746    .9330375
-------------+----------------------------------------------------------------
cn_26        |
          ec |  -.1097776   .0721536    -1.52   0.128    -.2511962    .0316409
             |
     logfeer |
         D1. |   .3408228   .1531686     2.23   0.026     .0406179    .6410276
             |
  logreer_cs |
         D1. |  -.0663719   .3112214    -0.21   0.831    -.6763546    .5436108
             |
  logfeer_cs |
         D1. |  -.1263817   .2910124    -0.43   0.664    -.6967556    .4439922
             |
       _cons |   .2409821   .1762345     1.37   0.172    -.1044313    .5863954
------------------------------------------------------------------------------

. 
. // Residual testing (start)
. 
. capture drop yhat

. gen yhat = .
(754 missing values generated)

. forval cn = 1/26 {
  2. predict temp if cn ==`cn', eq(cn_`cn')
  3. replace yhat = temp if cn == `cn'
  4. drop temp
  5. }
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)
(726 missing values generated)
(28 real changes made)

. 
. capture drop residuals_cs

. gen residuals_cs = d.logreer - yhat
(26 missing values generated)

. 
. xtline d.logreer yhat

. 
. xtcdf residuals_cs

xtcd test on variables residuals_cs
Panelvar: cn
Timevar: datayear
------------------------------------------------------------------------------+
    Variable    |  CD-test   p-value   average joint T | mean ρ   mean abs(ρ) |
----------------+--------------------------------------+----------------------|
  residuals_cs  +  .162       0.871         28.00      +  0.00       0.21     | 
------------------------------------------------------------------------------+
 Notes: Under the null hypothesis of cross-section independence, CD ~ N(0,1)
        P-values close to zero indicate data are correlated across panel groups.

. 
. // Residual testing (end)
. 
. outreg2 using tables\results_cpmg_1, ///
> excel pvalue replace ///
> cttop(D.logreer) addnote(Notes:)
tables\results_cpmg_1.xml
dir : seeout

. 
. xtpmg d.logfeer d.logreer d.logfeer_cs d.logreer_cs, ///
> lr(l.logfeer logreer l.logfeer_cs logreer_cs) ///
> ec(ec) replace pmg

Iteration 0:  Log likelihood =  949.22015  
Iteration 1:  Log likelihood =  956.46127  
Iteration 2:  Log likelihood =  957.00233  
Iteration 3:  Log likelihood =    958.829  
Iteration 4:  Log likelihood =  958.92104  
Iteration 5:  Log likelihood =  958.92111  

Pooled Mean Group Regression
(Estimate results saved as pmg)

Panel Variable (i): cn                          Number of obs      =       728
Time Variable (t): datayear                     Number of groups   =        26
                                                Obs per group: min =        28
                                                               avg =      28.0
                                                               max =        28

                                                Log Likelihood     =  958.9211
------------------------------------------------------------------------------
   D.logfeer | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
ec           |
     logreer |   .6975357   .0427604    16.31   0.000      .613727    .7813445
             |
  logfeer_cs |
         L1. |   .4264695   .1251492     3.41   0.001     .1811815    .6717575
             |
  logreer_cs |  -.6492628   .1631979    -3.98   0.000    -.9691248   -.3294009
-------------+----------------------------------------------------------------
SR           |
          ec |  -.3178895   .0383565    -8.29   0.000    -.3930668   -.2427122
             |
     logreer |
         D1. |   .3986435   .1320794     3.02   0.003     .1397727    .6575144
             |
  logfeer_cs |
         D1. |   .8354263   .1705932     4.90   0.000     .5010698    1.169783
             |
  logreer_cs |
         D1. |    -.38766   .2112918    -1.83   0.067    -.8017843    .0264643
             |
       _cons |   .7717413   .0929793     8.30   0.000     .5895053    .9539773
------------------------------------------------------------------------------

. 
. outreg2 using tables\results_cpmg_2, ///
> excel pvalue replace ///
> cttop(D.logfeer) addnote(Notes:)
tables\results_cpmg_2.xml
dir : seeout

. 
. // STUDY SHORT RUN DYNAMICS
. 
. xtpmg d.logreer d.logfeer, ///
> lr(l.logreer logfeer) ec(ec) replace pmg full

Iteration 0:  Log likelihood =  1163.0971  
Iteration 1:  Log likelihood =  1169.4094  
Iteration 2:  Log likelihood =  1169.8599  
Iteration 3:  Log likelihood =  1169.8599  

Pooled Mean Group Regression
(Estimate results saved as PMG)

Panel Variable (i): cn                          Number of obs      =       728
Time Variable (t): datayear                     Number of groups   =        26
                                                Obs per group: min =        28
                                                               avg =      28.0
                                                               max =        28

                                                Log Likelihood     =   1169.86
------------------------------------------------------------------------------
   D.logreer | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
ec           |
     logfeer |   .6430313   .0622934    10.32   0.000     .5209384    .7651242
-------------+----------------------------------------------------------------
cn_1         |
          ec |  -.2360765   .1256905    -1.88   0.060    -.4824253    .0102724
             |
     logfeer |
         D1. |   .2837422   .1530462     1.85   0.064     -.016223    .5837073
             |
       _cons |   .4211581   .2346993     1.79   0.073    -.0388441    .8811603
-------------+----------------------------------------------------------------
cn_2         |
          ec |  -.1191844   .0680656    -1.75   0.080    -.2525906    .0142217
             |
     logfeer |
         D1. |  -.0153552   .0596062    -0.26   0.797    -.1321811    .1014707
             |
       _cons |   .1921652   .1208895     1.59   0.112    -.0447739    .4291043
-------------+----------------------------------------------------------------
cn_3         |
          ec |  -.1979727   .0907916    -2.18   0.029     -.375921   -.0200245
             |
     logfeer |
         D1. |   .0567338   .1818382     0.31   0.755    -.2996625    .4131302
             |
       _cons |   .3288789   .1706062     1.93   0.054    -.0055031    .6632608
-------------+----------------------------------------------------------------
cn_4         |
          ec |  -.3145524   .0566905    -5.55   0.000    -.4256638    -.203441
             |
     logfeer |
         D1. |  -.0091134     .08086    -0.11   0.910    -.1675961    .1493692
             |
       _cons |    .533818   .1333882     4.00   0.000      .272382     .795254
-------------+----------------------------------------------------------------
cn_5         |
          ec |   -.513033   .0995045    -5.16   0.000    -.7080582   -.3180078
             |
     logfeer |
         D1. |  -.2949917   .1135371    -2.60   0.009    -.5175204   -.0724631
             |
       _cons |   .8703244   .1971559     4.41   0.000     .4839059    1.256743
-------------+----------------------------------------------------------------
cn_6         |
          ec |   .0525849   .0835738     0.63   0.529    -.1112168    .2163866
             |
     logfeer |
         D1. |  -.0130016   .0934529    -0.14   0.889    -.1961659    .1701627
             |
       _cons |  -.0678677   .1345755    -0.50   0.614    -.3316309    .1958956
-------------+----------------------------------------------------------------
cn_7         |
          ec |  -.1052722   .0598197    -1.76   0.078    -.2225166    .0119721
             |
     logfeer |
         D1. |   .0164521   .1439855     0.11   0.909    -.2657543    .2986585
             |
       _cons |   .1710435     .10105     1.69   0.091     -.027011    .3690979
-------------+----------------------------------------------------------------
cn_8         |
          ec |  -.0032133   .0671926    -0.05   0.962    -.1349084    .1284817
             |
     logfeer |
         D1. |   .0024626   .0834395     0.03   0.976    -.1610759    .1660011
             |
       _cons |   .0066175   .1074026     0.06   0.951    -.2038877    .2171226
-------------+----------------------------------------------------------------
cn_9         |
          ec |  -.0923703   .0887319    -1.04   0.298    -.2662816    .0815411
             |
     logfeer |
         D1. |    .318432   .1178131     2.70   0.007     .0875226    .5493414
             |
       _cons |   .1524593   .1490816     1.02   0.306    -.1397353    .4446539
-------------+----------------------------------------------------------------
cn_10        |
          ec |  -.0146074   .0440294    -0.33   0.740    -.1009033    .0716886
             |
     logfeer |
         D1. |    .051184   .0582314     0.88   0.379    -.0629475    .1653155
             |
       _cons |   .0176248   .0714408     0.25   0.805    -.1223966    .1576463
-------------+----------------------------------------------------------------
cn_11        |
          ec |  -.2046411   .0858242    -2.38   0.017    -.3728535   -.0364288
             |
     logfeer |
         D1. |   .0541601   .1030799     0.53   0.599    -.1478729     .256193
             |
       _cons |   .3312871   .1429321     2.32   0.020     .0511453     .611429
-------------+----------------------------------------------------------------
cn_12        |
          ec |  -.2574793   .0893237    -2.88   0.004    -.4325506   -.0824081
             |
     logfeer |
         D1. |   .5602566   .1418017     3.95   0.000     .2823304    .8381828
             |
       _cons |   .4039731   .1395593     2.89   0.004     .1304419    .6775043
-------------+----------------------------------------------------------------
cn_13        |
          ec |  -.1948842   .1234303    -1.58   0.114    -.4368031    .0470347
             |
     logfeer |
         D1. |   .4906867   .1499483     3.27   0.001     .1967936    .7845799
             |
       _cons |   .3111683   .2029033     1.53   0.125    -.0865149    .7088515
-------------+----------------------------------------------------------------
cn_14        |
          ec |   -.236722   .1307998    -1.81   0.070    -.4930849     .019641
             |
     logfeer |
         D1. |   .3728104   .1414064     2.64   0.008     .0956589     .649962
             |
       _cons |   .3797279   .2195656     1.73   0.084    -.0506128    .8100686
-------------+----------------------------------------------------------------
cn_15        |
          ec |  -.1163081   .1048748    -1.11   0.267    -.3218589    .0892427
             |
     logfeer |
         D1. |   .8996652    .146454     6.14   0.000     .6126207     1.18671
             |
       _cons |   .2006476   .1822086     1.10   0.271    -.1564747    .5577699
-------------+----------------------------------------------------------------
cn_16        |
          ec |  -.5017237   .1774268    -2.83   0.005    -.8494738   -.1539735
             |
     logfeer |
         D1. |   .3937592   .2768535     1.42   0.155    -.1488637     .936382
             |
       _cons |   .8162058   .3196179     2.55   0.011     .1897662    1.442645
-------------+----------------------------------------------------------------
cn_17        |
          ec |  -.2376875   .1104648    -2.15   0.031    -.4541945   -.0211804
             |
     logfeer |
         D1. |   .6258089   .1541457     4.06   0.000      .323689    .9279288
             |
       _cons |   .3970974     .20681     1.92   0.055    -.0082428    .8024375
-------------+----------------------------------------------------------------
cn_18        |
          ec |  -.1774995   .0537494    -3.30   0.001    -.2828463   -.0721526
             |
     logfeer |
         D1. |   .6212611   .0709335     8.76   0.000      .482234    .7602881
             |
       _cons |   .2892848   .0835627     3.46   0.001      .125505    .4530646
-------------+----------------------------------------------------------------
cn_19        |
          ec |  -.3694693   .1925893    -1.92   0.055    -.7469373    .0079987
             |
     logfeer |
         D1. |   .1974048   .1313046     1.50   0.133    -.0599474     .454757
             |
       _cons |   .5947906   .3356861     1.77   0.076     -.063142    1.252723
-------------+----------------------------------------------------------------
cn_20        |
          ec |  -.3694692   .1241473    -2.98   0.003    -.6127933    -.126145
             |
     logfeer |
         D1. |    .263648    .102102     2.58   0.010     .0635317    .4637642
             |
       _cons |    .614332   .2334219     2.63   0.008     .1568335    1.071831
-------------+----------------------------------------------------------------
cn_21        |
          ec |  -.0199662   .0205926    -0.97   0.332     -.060327    .0203945
             |
     logfeer |
         D1. |   .1022261   .0361437     2.83   0.005     .0313857    .1730665
             |
       _cons |   .0234627    .034934     0.67   0.502    -.0450066     .091932
-------------+----------------------------------------------------------------
cn_22        |
          ec |   .0301417   .0382111     0.79   0.430    -.0447506     .105034
             |
     logfeer |
         D1. |  -.1216504   .0832579    -1.46   0.144    -.2848329    .0415322
             |
       _cons |   -.050522   .0631094    -0.80   0.423    -.1742141    .0731701
-------------+----------------------------------------------------------------
cn_23        |
          ec |  -.2091442   .0912423    -2.29   0.022    -.3879758   -.0303126
             |
     logfeer |
         D1. |  -.0042693   .0892268    -0.05   0.962    -.1791506     .170612
             |
       _cons |   .3388096   .1492231     2.27   0.023     .0463377    .6312816
-------------+----------------------------------------------------------------
cn_24        |
          ec |  -.2422344   .1200855    -2.02   0.044    -.4775976   -.0068712
             |
     logfeer |
         D1. |   .4628208   .0910136     5.09   0.000     .2844374    .6412042
             |
       _cons |   .4033607   .2060189     1.96   0.050     -.000429    .8071504
-------------+----------------------------------------------------------------
cn_25        |
          ec |  -.4078112   .1267222    -3.22   0.001    -.6561821   -.1594403
             |
     logfeer |
         D1. |   .1487307   .1284598     1.16   0.247     -.103046    .4005073
             |
       _cons |   .7002477   .2437276     2.87   0.004     .2225504    1.177945
-------------+----------------------------------------------------------------
cn_26        |
          ec |  -.1143588    .072319    -1.58   0.114    -.2561014    .0273838
             |
     logfeer |
         D1. |   .2979958   .1304101     2.29   0.022     .0423966    .5535949
             |
       _cons |   .1882795   .1264749     1.49   0.137    -.0596068    .4361658
------------------------------------------------------------------------------

. 
. outreg2 using tables\results_pmg_1_SR, ///
> excel pvalue replace ///
> cttop(D.logreer) addnote(Notes:)
tables\results_pmg_1_SR.xml
dir : seeout

. 
. xtpmg d.logfeer d.logreer, ///
> lr(l.logfeer logreer) ec(ec) replace pmg full

Iteration 0:  Log likelihood =  875.85235  
Iteration 1:  Log likelihood =  884.09806  
Iteration 2:  Log likelihood =  884.58708  
Iteration 3:  Log likelihood =  884.58726  
Iteration 4:  Log likelihood =  884.58726  

Pooled Mean Group Regression
(Estimate results saved as PMG)

Panel Variable (i): cn                          Number of obs      =       728
Time Variable (t): datayear                     Number of groups   =        26
                                                Obs per group: min =        28
                                                               avg =      28.0
                                                               max =        28

                                                Log Likelihood     =  884.5873
------------------------------------------------------------------------------
   D.logfeer | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
ec           |
     logreer |   .7079455   .0424993    16.66   0.000     .6246485    .7912426
-------------+----------------------------------------------------------------
cn_1         |
          ec |  -.5379788    .163553    -3.29   0.001    -.8585368   -.2174208
             |
     logreer |
         D1. |   .1803937   .1929994     0.93   0.350    -.1978782    .5586656
             |
       _cons |   .8571447   .3010869     2.85   0.004     .2670253    1.447264
-------------+----------------------------------------------------------------
cn_2         |
          ec |  -.3284128   .1237072    -2.65   0.008    -.5708744   -.0859513
             |
     logreer |
         D1. |   .0662597   .5213304     0.13   0.899    -.9555291    1.088049
             |
       _cons |   .4337012   .1752031     2.48   0.013     .0903096    .7770929
-------------+----------------------------------------------------------------
cn_3         |
          ec |  -.1042584   .1022636    -1.02   0.308    -.3046914    .0961747
             |
     logreer |
         D1. |   .2978633   .1904101     1.56   0.118    -.0753337    .6710602
             |
       _cons |   .1183279   .1364339     0.87   0.386    -.1490776    .3857334
-------------+----------------------------------------------------------------
cn_4         |
          ec |  -.5632987   .1621005    -3.47   0.001    -.8810099   -.2455874
             |
     logreer |
         D1. |   .8281052   .2597855     3.19   0.001      .318935    1.337275
             |
       _cons |   .7535482   .2507698     3.00   0.003     .2620484    1.245048
-------------+----------------------------------------------------------------
cn_5         |
          ec |  -.6094292   .1498895    -4.07   0.000    -.9032072   -.3156512
             |
     logreer |
         D1. |  -.0451106   .2254494    -0.20   0.841    -.4869832     .396762
             |
       _cons |   .7814376   .2028471     3.85   0.000     .3838646    1.179011
-------------+----------------------------------------------------------------
cn_6         |
          ec |  -.3496455   .1084784    -3.22   0.001    -.5622593   -.1370317
             |
     logreer |
         D1. |  -.7263894   .3865648    -1.88   0.060    -1.484042    .0312636
             |
       _cons |    .491564   .1673786     2.94   0.003     .1635079    .8196201
-------------+----------------------------------------------------------------
cn_7         |
          ec |  -.0609881   .0806449    -0.76   0.449    -.2190492     .097073
             |
     logreer |
         D1. |   .1773642   .2423271     0.73   0.464    -.2975882    .6523166
             |
       _cons |   .0773264   .1090705     0.71   0.478    -.1364477    .2911006
-------------+----------------------------------------------------------------
cn_8         |
          ec |  -.1756789   .0941492    -1.87   0.062     -.360208    .0088503
             |
     logreer |
         D1. |  -.1822481   .4192752    -0.43   0.664    -1.004012    .6395162
             |
       _cons |   .2381587   .1324753     1.80   0.072    -.0214881    .4978055
-------------+----------------------------------------------------------------
cn_9         |
          ec |  -.0536305   .0936857    -0.57   0.567    -.2372511    .1299901
             |
     logreer |
         D1. |   .8656401   .2381341     3.64   0.000     .3989058    1.332374
             |
       _cons |   .0647146   .1227321     0.53   0.598     -.175836    .3052652
-------------+----------------------------------------------------------------
cn_10        |
          ec |  -.2173026   .1166611    -1.86   0.063    -.4459541     .011349
             |
     logreer |
         D1. |    .521083   .5844434     0.89   0.373    -.6244049    1.666571
             |
       _cons |   .3077387   .1683301     1.83   0.068    -.0221823    .6376597
-------------+----------------------------------------------------------------
cn_11        |
          ec |  -.3459669   .1196487    -2.89   0.004    -.5804742   -.1114597
             |
     logreer |
         D1. |   .3908829   .2983757     1.31   0.190    -.1939227    .9756884
             |
       _cons |   .4812258   .1690495     2.85   0.004     .1498949    .8125567
-------------+----------------------------------------------------------------
cn_12        |
          ec |  -.7854106   .1964963    -4.00   0.000    -1.170536    -.400285
             |
     logreer |
         D1. |   .1786016    .171044     1.04   0.296    -.1566384    .5138416
             |
       _cons |    .983686   .2976623     3.30   0.001     .4002786    1.567093
-------------+----------------------------------------------------------------
cn_13        |
          ec |  -.3110158   .0958492    -3.24   0.001    -.4988768   -.1231548
             |
     logreer |
         D1. |   .1412853   .1891534     0.75   0.455    -.2294485    .5120192
             |
       _cons |    .401184   .1412377     2.84   0.005     .1243632    .6780049
-------------+----------------------------------------------------------------
cn_14        |
          ec |   -.500831   .1594061    -3.14   0.002    -.8132612   -.1884008
             |
     logreer |
         D1. |   .1701296   .2125453     0.80   0.423    -.2464516    .5867107
             |
       _cons |   .6593664   .2376977     2.77   0.006     .1934874    1.125245
-------------+----------------------------------------------------------------
cn_15        |
          ec |  -.3714703   .1342957    -2.77   0.006    -.6346851   -.1082556
             |
     logreer |
         D1. |   .5135542   .1158225     4.43   0.000     .2865463    .7405621
             |
       _cons |   .5071723   .1935114     2.62   0.009      .127897    .8864476
-------------+----------------------------------------------------------------
cn_16        |
          ec |  -.3303997   .1526452    -2.16   0.030    -.6295789   -.0312206
             |
     logreer |
         D1. |    .251141   .1142455     2.20   0.028      .027224    .4750581
             |
       _cons |   .4449706   .2126564     2.09   0.036     .0281717    .8617696
-------------+----------------------------------------------------------------
cn_17        |
          ec |  -.1898156   .0888076    -2.14   0.033    -.3638754   -.0157559
             |
     logreer |
         D1. |   .4766353   .1325532     3.60   0.000     .2168358    .7364349
             |
       _cons |   .2715452   .1281956     2.12   0.034     .0202864     .522804
-------------+----------------------------------------------------------------
cn_18        |
          ec |  -.2999877   .1692029    -1.77   0.076    -.6316194     .031644
             |
     logreer |
         D1. |   .6884973   .2346035     2.93   0.003     .2286829    1.148312
             |
       _cons |   .3866728   .2260286     1.71   0.087    -.0563352    .8296807
-------------+----------------------------------------------------------------
cn_19        |
          ec |  -.3092825   .1443252    -2.14   0.032    -.5921547   -.0264102
             |
     logreer |
         D1. |   .2178474   .2614075     0.83   0.405    -.2945018    .7301966
             |
       _cons |   .4087157   .1995467     2.05   0.041     .0176115      .79982
-------------+----------------------------------------------------------------
cn_20        |
          ec |  -.2327601   .1255767    -1.85   0.064     -.478886    .0133657
             |
     logreer |
         D1. |   .6432067   .2501495     2.57   0.010     .1529227    1.133491
             |
       _cons |   .2938965   .1678922     1.75   0.080    -.0351661    .6229591
-------------+----------------------------------------------------------------
cn_21        |
          ec |  -.1076223   .0755016    -1.43   0.154    -.2556026    .0403581
             |
     logreer |
         D1. |   2.393322   .7185677     3.33   0.001     .9849557    3.801689
             |
       _cons |   .1724856   .1095346     1.57   0.115    -.0421983    .3871695
-------------+----------------------------------------------------------------
cn_22        |
          ec |  -.1222575   .0526527    -2.32   0.020    -.2254549   -.0190601
             |
     logreer |
         D1. |  -.7077109   .3745993    -1.89   0.059    -1.441912    .0264902
             |
       _cons |   .1775647   .0748547     2.37   0.018     .0308522    .3242772
-------------+----------------------------------------------------------------
cn_23        |
          ec |  -.6614685   .1363712    -4.85   0.000    -.9287511   -.3941859
             |
     logreer |
         D1. |  -.0842541    .313332    -0.27   0.788    -.6983735    .5298653
             |
       _cons |   .8895144   .2106358     4.22   0.000     .4766758    1.302353
-------------+----------------------------------------------------------------
cn_24        |
          ec |  -.2160863   .1248448    -1.73   0.083    -.4607775     .028605
             |
     logreer |
         D1. |   1.134843   .1678733     6.76   0.000     .8058178    1.463869
             |
       _cons |   .3010839   .1769043     1.70   0.089    -.0456422    .6478101
-------------+----------------------------------------------------------------
cn_25        |
          ec |  -.6162742   .1878881    -3.28   0.001    -.9845281   -.2480204
             |
     logreer |
         D1. |   .3779864   .2052335     1.84   0.066     -.024264    .7802367
             |
       _cons |   .8889935   .3042142     2.92   0.003     .2927447    1.485242
-------------+----------------------------------------------------------------
cn_26        |
          ec |  -.1035287   .0711846    -1.45   0.146     -.243048    .0359906
             |
     logreer |
         D1. |   .6794351   .2072163     3.28   0.001     .2732987    1.085572
             |
       _cons |   .1577889   .1021268     1.55   0.122     -.042376    .3579539
------------------------------------------------------------------------------

. 
. outreg2 using tables\results_pmg_2_SR, ///
> excel pvalue replace ///
> cttop(D.logfeer) addnote(Notes:)
tables\results_pmg_2_SR.xml
dir : seeout

. 
. xtpmg d.logreer d.logfeer d.logreer_cs d.logfeer_cs, ///
> lr(l.logreer logfeer l.logreer_cs logfeer_cs) ///
> ec(ec) replace pmg full

Iteration 0:  Log likelihood =  1249.6661  (not concave)
Iteration 1:  Log likelihood =  1251.6306  
Iteration 2:  Log likelihood =  1251.9822  
Iteration 3:  Log likelihood =  1253.7247  
Iteration 4:  Log likelihood =  1253.7338  
Iteration 5:  Log likelihood =  1253.7338  

Pooled Mean Group Regression
(Estimate results saved as PMG)

Panel Variable (i): cn                          Number of obs      =       728
Time Variable (t): datayear                     Number of groups   =        26
                                                Obs per group: min =        28
                                                               avg =      28.0
                                                               max =        28

                                                Log Likelihood     =  1253.734
------------------------------------------------------------------------------
   D.logreer | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
ec           |
     logfeer |   .7377218   .0574136    12.85   0.000     .6251931    .8502505
             |
  logreer_cs |
         L1. |  -.0283034   .1605633    -0.18   0.860    -.3430017    .2863949
             |
  logfeer_cs |  -.1871242   .1168044    -1.60   0.109    -.4160566    .0418081
-------------+----------------------------------------------------------------
cn_1         |
          ec |  -.1894082   .1129031    -1.68   0.093    -.4106942    .0318777
             |
     logfeer |
         D1. |   .3506146   .1454585     2.41   0.016     .0655213    .6357079
             |
  logreer_cs |
         D1. |   3.829925     1.3544     2.83   0.005     1.175349      6.4845
             |
  logfeer_cs |
         D1. |  -2.945176     1.1452    -2.57   0.010    -5.189727    -.700624
             |
       _cons |   .4300237   .2834434     1.52   0.129    -.1255152    .9855625
-------------+----------------------------------------------------------------
cn_2         |
          ec |  -.1124979   .0567181    -1.98   0.047    -.2236634   -.0013324
             |
     logfeer |
         D1. |  -.0206766   .0570225    -0.36   0.717    -.1324387    .0910854
             |
  logreer_cs |
         D1. |  -.1390027   .1261584    -1.10   0.271    -.3862686    .1082631
             |
  logfeer_cs |
         D1. |  -.1361439   .1020813    -1.33   0.182    -.3362196    .0639319
             |
       _cons |   .2457494   .1441173     1.71   0.088    -.0367152    .5282141
-------------+----------------------------------------------------------------
cn_3         |
          ec |   -.169995   .0778678    -2.18   0.029    -.3226131   -.0173769
             |
     logfeer |
         D1. |   .2148019   .1731857     1.24   0.215    -.1246358    .5542396
             |
  logreer_cs |
         D1. |   2.472622   .9362568     2.64   0.008     .6375929    4.307652
             |
  logfeer_cs |
         D1. |  -.8921674   .7187324    -1.24   0.214    -2.300857    .5165222
             |
       _cons |   .3737349   .2087233     1.79   0.073    -.0353553    .7828251
-------------+----------------------------------------------------------------
cn_4         |
          ec |  -.2059717   .0617008    -3.34   0.001     -.326903   -.0850404
             |
     logfeer |
         D1. |     .04803   .0845013     0.57   0.570    -.1175895    .2136496
             |
  logreer_cs |
         D1. |   .9927471   .3981225     2.49   0.013     .2124414    1.773053
             |
  logfeer_cs |
         D1. |  -.2912807    .297638    -0.98   0.328    -.8746405    .2920791
             |
       _cons |   .4674705    .180339     2.59   0.010     .1140125    .8209285
-------------+----------------------------------------------------------------
cn_5         |
          ec |  -.6134603   .1110102    -5.53   0.000    -.8310362   -.3958843
             |
     logfeer |
         D1. |   -.363904   .1153014    -3.16   0.002    -.5898906   -.1379174
             |
  logreer_cs |
         D1. |  -.7516943    .649077    -1.16   0.247    -2.023862    .5204732
             |
  logfeer_cs |
         D1. |  -.3165882   .5117836    -0.62   0.536    -1.319666    .6864892
             |
       _cons |   1.392239   .4531849     3.07   0.002     .5040132    2.280466
-------------+----------------------------------------------------------------
cn_6         |
          ec |   .1579466   .0609549     2.59   0.010     .0384773    .2774159
             |
     logfeer |
         D1. |  -.0841473   .0753854    -1.12   0.264    -.2318999    .0636053
             |
  logreer_cs |
         D1. |   2.374019   .5609751     4.23   0.000     1.274528     3.47351
             |
  logfeer_cs |
         D1. |   .2397022   .4693981     0.51   0.610    -.6803013    1.159706
             |
       _cons |   -.332131   .1653812    -2.01   0.045    -.6562722   -.0079898
-------------+----------------------------------------------------------------
cn_7         |
          ec |   -.093963   .0502589    -1.87   0.062    -.1924687    .0045427
             |
     logfeer |
         D1. |   .0037357   .1345581     0.03   0.978    -.2599933    .2674647
             |
  logreer_cs |
         D1. |  -.5643007   .3483977    -1.62   0.105    -1.247148    .1185463
             |
  logfeer_cs |
         D1. |   .5446675   .2831406     1.92   0.054    -.0102779    1.099613
             |
       _cons |   .2071315   .1229832     1.68   0.092    -.0339111    .4481742
-------------+----------------------------------------------------------------
cn_8         |
          ec |   .0241152   .0577952     0.42   0.676    -.0891614    .1373918
             |
     logfeer |
         D1. |   .0306869   .0821944     0.37   0.709    -.1304112     .191785
             |
  logreer_cs |
         D1. |  -.0263702   .1764678    -0.15   0.881    -.3722408    .3195004
             |
  logfeer_cs |
         D1. |  -.2274016   .1502858    -1.51   0.130    -.5219562    .0671531
             |
       _cons |  -.0498416   .1258971    -0.40   0.692    -.2965953     .196912
-------------+----------------------------------------------------------------
cn_9         |
          ec |  -.0935918   .0738823    -1.27   0.205    -.2383985    .0512149
             |
     logfeer |
         D1. |    .284042   .1155247     2.46   0.014     .0576177    .5104664
             |
  logreer_cs |
         D1. |  -.0860538   .1867565    -0.46   0.645    -.4520898    .2799822
             |
  logfeer_cs |
         D1. |  -.2565344   .1477378    -1.74   0.082    -.5460953    .0330264
             |
       _cons |   .2086883   .1716745     1.22   0.224    -.1277875    .5451641
-------------+----------------------------------------------------------------
cn_10        |
          ec |  -.0096089   .0340995    -0.28   0.778    -.0764428     .057225
             |
     logfeer |
         D1. |   .0666507   .0469363     1.42   0.156    -.0253427    .1586441
             |
  logreer_cs |
         D1. |   .6417235   .1873199     3.43   0.001     .2745831    1.008864
             |
  logfeer_cs |
         D1. |   .1000678   .1502861     0.67   0.506    -.1944875    .3946231
             |
       _cons |   .0121983   .0745043     0.16   0.870    -.1338275    .1582242
-------------+----------------------------------------------------------------
cn_11        |
          ec |  -.2328565   .0880231    -2.65   0.008    -.4053787   -.0603343
             |
     logfeer |
         D1. |   .0125142   .1103004     0.11   0.910    -.2036706     .228699
             |
  logreer_cs |
         D1. |  -.0652017   .4172119    -0.16   0.876     -.882922    .7525187
             |
  logfeer_cs |
         D1. |   .2873279   .3585786     0.80   0.423    -.4154733     .990129
             |
       _cons |   .5076221   .2392558     2.12   0.034     .0386892    .9765549
-------------+----------------------------------------------------------------
cn_12        |
          ec |  -.2663371   .0949326    -2.81   0.005    -.4524016   -.0802726
             |
     logfeer |
         D1. |   .5509438   .1684647     3.27   0.001     .2207591    .8811284
             |
  logreer_cs |
         D1. |    .283073   .8669797     0.33   0.744    -1.416176    1.982322
             |
  logfeer_cs |
         D1. |  -.3293627   .6499746    -0.51   0.612     -1.60329    .9445641
             |
       _cons |   .5752471   .2517697     2.28   0.022     .0817876    1.068707
-------------+----------------------------------------------------------------
cn_13        |
          ec |  -.2047448    .124372    -1.65   0.100    -.4485095    .0390199
             |
     logfeer |
         D1. |   .5393073   .1556957     3.46   0.001     .2341493    .8444654
             |
  logreer_cs |
         D1. |   .0370013   .2647792     0.14   0.889    -.4819565    .5559591
             |
  logfeer_cs |
         D1. |  -.2701562   .2116295    -1.28   0.202    -.6849425    .1446301
             |
       _cons |   .4454229   .2945768     1.51   0.131     -.131937    1.022783
-------------+----------------------------------------------------------------
cn_14        |
          ec |  -.2259926   .1314643    -1.72   0.086    -.4836579    .0316727
             |
     logfeer |
         D1. |    .350778   .1467226     2.39   0.017      .063207     .638349
             |
  logreer_cs |
         D1. |  -.2666466   .2826945    -0.94   0.346    -.8207177    .2874245
             |
  logfeer_cs |
         D1. |   .2041824   .2223811     0.92   0.359    -.2316765    .6400414
             |
       _cons |   .4913251   .3259825     1.51   0.132    -.1475889    1.130239
-------------+----------------------------------------------------------------
cn_15        |
          ec |  -.1634506   .1145453    -1.43   0.154    -.3879552     .061054
             |
     logfeer |
         D1. |   .8540041   .1569577     5.44   0.000     .5463726    1.161636
             |
  logreer_cs |
         D1. |   .0828206   .3131086     0.26   0.791     -.530861    .6965022
             |
  logfeer_cs |
         D1. |  -.0584674   .2496783    -0.23   0.815    -.5478279    .4308931
             |
       _cons |   .3712416   .2770208     1.34   0.180    -.1717092    .9141925
-------------+----------------------------------------------------------------
cn_16        |
          ec |  -.5878042   .1396079    -4.21   0.000    -.8614306   -.3141778
             |
     logfeer |
         D1. |   .2137055   .2410574     0.89   0.375    -.2587582    .6861693
             |
  logreer_cs |
         D1. |   1.354403   .3916642     3.46   0.001     .5867555    2.122051
             |
  logfeer_cs |
         D1. |   .1424235    .338513     0.42   0.674    -.5210498    .8058969
             |
       _cons |   1.283743   .4608549     2.79   0.005     .3804844    2.187002
-------------+----------------------------------------------------------------
cn_17        |
          ec |   -.304749   .1029519    -2.96   0.003    -.5065309   -.1029671
             |
     logfeer |
         D1. |   .4742518   .1636979     2.90   0.004     .1534099    .7950938
             |
  logreer_cs |
         D1. |   1.736799   .6707233     2.59   0.010     .4222055    3.051392
             |
  logfeer_cs |
         D1. |  -.6272488   .5134104    -1.22   0.222    -1.633515    .3790171
             |
       _cons |   .6763389   .3107149     2.18   0.030     .0673489    1.285329
-------------+----------------------------------------------------------------
cn_18        |
          ec |  -.1383537   .0634557    -2.18   0.029    -.2627245   -.0139828
             |
     logfeer |
         D1. |   .5976286   .0718281     8.32   0.000     .4568481    .7384091
             |
  logreer_cs |
         D1. |   .2866742   .2386323     1.20   0.230    -.1810365     .754385
             |
  logfeer_cs |
         D1. |   .0475582   .1657291     0.29   0.774     -.277265    .3723813
             |
       _cons |   .3067872   .1531547     2.00   0.045     .0066095     .606965
-------------+----------------------------------------------------------------
cn_19        |
          ec |  -.5305184    .138051    -3.84   0.000    -.8010933   -.2599435
             |
     logfeer |
         D1. |   .2773174   .1185788     2.34   0.019     .0449072    .5097275
             |
  logreer_cs |
         D1. |  -.6037296   .1609997    -3.75   0.000    -.9192833   -.2881759
             |
  logfeer_cs |
         D1. |  -.2083184   .1178045    -1.77   0.077     -.439211    .0225743
             |
       _cons |   1.158405   .4782353     2.42   0.015     .2210815    2.095729
-------------+----------------------------------------------------------------
cn_20        |
          ec |   -.277002   .0918866    -3.01   0.003    -.4570965   -.0969076
             |
     logfeer |
         D1. |   .2056183   .0953591     2.16   0.031      .018718    .3925186
             |
  logreer_cs |
         D1. |   1.648532    .361904     4.56   0.000     .9392127     2.35785
             |
  logfeer_cs |
         D1. |  -.2380128   .3368647    -0.71   0.480    -.8982556      .42223
             |
       _cons |   .6167369   .2614999     2.36   0.018     .1042067    1.129267
-------------+----------------------------------------------------------------
cn_21        |
          ec |  -.0283947   .0181555    -1.56   0.118    -.0639787    .0071893
             |
     logfeer |
         D1. |   .0981107   .0357821     2.74   0.006      .027979    .1682424
             |
  logreer_cs |
         D1. |   .3880169   .1768361     2.19   0.028     .0414246    .7346093
             |
  logfeer_cs |
         D1. |   .0309937   .1543988     0.20   0.841    -.2716225    .3336098
             |
       _cons |   .0515268   .0441967     1.17   0.244    -.0350971    .1381507
-------------+----------------------------------------------------------------
cn_22        |
          ec |   .0457469   .0404461     1.13   0.258     -.033526    .1250198
             |
     logfeer |
         D1. |  -.1907169   .0889872    -2.14   0.032    -.3651287   -.0163051
             |
  logreer_cs |
         D1. |  -.3739197   .3609043    -1.04   0.300    -1.081279    .3334398
             |
  logfeer_cs |
         D1. |   .4593453   .2559446     1.79   0.073    -.0422968    .9609875
             |
       _cons |  -.1003245   .0930305    -1.08   0.281    -.2826608    .0820119
-------------+----------------------------------------------------------------
cn_23        |
          ec |   -.209998   .0833106    -2.52   0.012    -.3732838   -.0467123
             |
     logfeer |
         D1. |  -.0296053   .0843604    -0.35   0.726    -.1949487     .135738
             |
  logreer_cs |
         D1. |   .5708699   .3944653     1.45   0.148    -.2022678    1.344008
             |
  logfeer_cs |
         D1. |   .3047113   .3136149     0.97   0.331    -.3099626    .9193852
             |
       _cons |   .4580418   .2142813     2.14   0.033     .0380581    .8780254
-------------+----------------------------------------------------------------
cn_24        |
          ec |  -.3195684   .1337716    -2.39   0.017    -.5817559    -.057381
             |
     logfeer |
         D1. |   .4147443   .1016119     4.08   0.000     .2155886       .6139
             |
  logreer_cs |
         D1. |  -.2494996   .1771301    -1.41   0.159    -.5966682     .097669
             |
  logfeer_cs |
         D1. |    .053888   .1298519     0.41   0.678    -.2006171     .308393
             |
       _cons |   .7077993   .3743648     1.89   0.059    -.0259423    1.441541
-------------+----------------------------------------------------------------
cn_25        |
          ec |  -.1851053   .1076925    -1.72   0.086    -.3961787    .0259681
             |
     logfeer |
         D1. |    .341881   .1076957     3.17   0.002     .1308014    .5529606
             |
  logreer_cs |
         D1. |   2.649429   .5734962     4.62   0.000     1.525397    3.773461
             |
  logfeer_cs |
         D1. |  -1.423355   .4222446    -3.37   0.001     -2.25094   -.5957711
             |
       _cons |   .4159815    .263809     1.58   0.115    -.1010746    .9330375
-------------+----------------------------------------------------------------
cn_26        |
          ec |  -.1097776   .0721536    -1.52   0.128    -.2511962    .0316409
             |
     logfeer |
         D1. |   .3408228   .1531686     2.23   0.026     .0406179    .6410276
             |
  logreer_cs |
         D1. |  -.0663719   .3112214    -0.21   0.831    -.6763546    .5436108
             |
  logfeer_cs |
         D1. |  -.1263817   .2910124    -0.43   0.664    -.6967556    .4439922
             |
       _cons |   .2409821   .1762345     1.37   0.172    -.1044313    .5863954
------------------------------------------------------------------------------

. 
. outreg2 using tables\results_cpmg_1_SR, ///
> excel pvalue replace ///
> cttop(D.logreer) addnote(Notes:)
tables\results_cpmg_1_SR.xml
dir : seeout

. 
. xtpmg d.logfeer d.logreer d.logfeer_cs d.logreer_cs, ///
> lr(l.logfeer logreer l.logfeer_cs logreer_cs) ///
> ec(ec) replace pmg full

Iteration 0:  Log likelihood =  949.22015  
Iteration 1:  Log likelihood =  956.46127  
Iteration 2:  Log likelihood =  957.00233  
Iteration 3:  Log likelihood =    958.829  
Iteration 4:  Log likelihood =  958.92104  
Iteration 5:  Log likelihood =  958.92111  

Pooled Mean Group Regression
(Estimate results saved as PMG)

Panel Variable (i): cn                          Number of obs      =       728
Time Variable (t): datayear                     Number of groups   =        26
                                                Obs per group: min =        28
                                                               avg =      28.0
                                                               max =        28

                                                Log Likelihood     =  958.9211
------------------------------------------------------------------------------
   D.logfeer | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
ec           |
     logreer |   .6975357   .0427604    16.31   0.000      .613727    .7813445
             |
  logfeer_cs |
         L1. |   .4264695   .1251492     3.41   0.001     .1811815    .6717575
             |
  logreer_cs |  -.6492628   .1631979    -3.98   0.000    -.9691248   -.3294009
-------------+----------------------------------------------------------------
cn_1         |
          ec |  -.5457362   .1365984    -4.00   0.000    -.8134642   -.2780083
             |
     logreer |
         D1. |   .1127127   .1838014     0.61   0.540    -.2475313    .4729568
             |
  logfeer_cs |
         D1. |   3.676329   .9987902     3.68   0.000     1.718736    5.633921
             |
  logreer_cs |
         D1. |   .5993356   1.492353     0.40   0.688    -2.325622    3.524293
             |
       _cons |   1.443717   .5252734     2.75   0.006     .4141998    2.473234
-------------+----------------------------------------------------------------
cn_2         |
          ec |  -.3520255    .112705    -3.12   0.002    -.5729233   -.1311277
             |
     logreer |
         D1. |   .1446539   .5305927     0.27   0.785    -.8952886    1.184596
             |
  logfeer_cs |
         D1. |   .4615207   .3123048     1.48   0.139    -.1505854    1.073627
             |
  logreer_cs |
         D1. |   .0526193    .391787     0.13   0.893    -.7152692    .8205078
             |
       _cons |   .8404555   .3393101     2.48   0.013       .17542    1.505491
-------------+----------------------------------------------------------------
cn_3         |
          ec |  -.0871102   .0971422    -0.90   0.370    -.2775053     .103285
             |
     logreer |
         D1. |   .4585196   .1777722     2.58   0.010     .1100925    .8069467
             |
  logfeer_cs |
         D1. |   1.220703   .7994234     1.53   0.127    -.3461381    2.787544
             |
  logreer_cs |
         D1. |  -2.832279   1.053422    -2.69   0.007    -4.896948   -.7676109
             |
       _cons |   .1983631   .2363941     0.84   0.401    -.2649608     .661687
-------------+----------------------------------------------------------------
cn_4         |
          ec |  -.5159447   .1366375    -3.78   0.000    -.7837492   -.2481402
             |
     logreer |
         D1. |    .702207   .2862866     2.45   0.014     .1410955    1.263318
             |
  logfeer_cs |
         D1. |   1.777505   .5004732     3.55   0.000     .7965958    2.758415
             |
  logreer_cs |
         D1. |  -.1583393   .8477324    -0.19   0.852    -1.819864    1.503186
             |
       _cons |   1.239667    .479033     2.59   0.010     .3007797    2.178555
-------------+----------------------------------------------------------------
cn_5         |
          ec |  -.6283017   .1571765    -4.00   0.000     -.936362   -.3202414
             |
     logreer |
         D1. |  -.0552285   .2295001    -0.24   0.810    -.5050404    .3945834
             |
  logfeer_cs |
         D1. |   1.133193   .9162767     1.24   0.216    -.6626763    2.929062
             |
  logreer_cs |
         D1. |   .0024275   1.059425     0.00   0.998    -2.074008    2.078863
             |
       _cons |   1.473639   .5173507     2.85   0.004     .4596499    2.487627
-------------+----------------------------------------------------------------
cn_6         |
          ec |  -.3941095   .1014695    -3.88   0.000    -.5929861   -.1952329
             |
     logreer |
         D1. |  -1.247477    .402549    -3.10   0.002    -2.036458   -.4584949
             |
  logfeer_cs |
         D1. |   1.784859   .8827802     2.02   0.043     .0546417    3.515077
             |
  logreer_cs |
         D1. |   2.147198   1.310268     1.64   0.101      -.42088    4.715276
             |
       _cons |    .966884   .3580294     2.70   0.007     .2651593    1.668609
-------------+----------------------------------------------------------------
cn_7         |
          ec |  -.0323768    .074155    -0.44   0.662     -.177718    .1129643
             |
     logreer |
         D1. |   .1596837   .2596493     0.61   0.539    -.3492196    .6685869
             |
  logfeer_cs |
         D1. |   .1766689   .4336587     0.41   0.684    -.6732867    1.026624
             |
  logreer_cs |
         D1. |    .196133   .5283775     0.37   0.710    -.8394679    1.231734
             |
       _cons |   .0726105   .1799521     0.40   0.687    -.2800892    .4253102
-------------+----------------------------------------------------------------
cn_8         |
          ec |  -.1480983   .0913503    -1.62   0.105    -.3271417     .030945
             |
     logreer |
         D1. |  -.1373772   .4498281    -0.31   0.760    -1.019024    .7442696
             |
  logfeer_cs |
         D1. |   .2928596   .3383341     0.87   0.387    -.3702629    .9559822
             |
  logreer_cs |
         D1. |  -.2709876   .3893719    -0.70   0.486    -1.034142    .4921673
             |
       _cons |   .3594379   .2410787     1.49   0.136    -.1130677    .8319435
-------------+----------------------------------------------------------------
cn_9         |
          ec |   -.072765   .0982084    -0.74   0.459      -.26525      .11972
             |
     logreer |
         D1. |    .901506   .2453396     3.67   0.000     .4206493    1.382363
             |
  logfeer_cs |
         D1. |   .2806637   .2531655     1.11   0.268    -.2155315     .776859
             |
  logreer_cs |
         D1. |  -.0904539   .3135979    -0.29   0.773    -.7050946    .5241867
             |
       _cons |   .1670282   .2374831     0.70   0.482    -.2984303    .6324866
-------------+----------------------------------------------------------------
cn_10        |
          ec |   -.233077   .1204674    -1.93   0.053    -.4691889    .0030348
             |
     logreer |
         D1. |   .8391126   .7183838     1.17   0.243    -.5688938    2.247119
             |
  logfeer_cs |
         D1. |   .0883276   .5787603     0.15   0.879    -1.046022    1.222677
             |
  logreer_cs |
         D1. |  -.6900748   .8730198    -0.79   0.429    -2.401162    1.021013
             |
       _cons |   .5832332   .3274365     1.78   0.075    -.0585306    1.224997
-------------+----------------------------------------------------------------
cn_11        |
          ec |  -.3725259   .1364857    -2.73   0.006     -.640033   -.1050189
             |
     logreer |
         D1. |   .4323787   .2846914     1.52   0.129    -.1256062    .9903636
             |
  logfeer_cs |
         D1. |   .8613498   .5883376     1.46   0.143    -.2917707     2.01447
             |
  logreer_cs |
         D1. |  -.9831193   .7883929    -1.25   0.212    -2.528341    .5621024
             |
       _cons |   .9157745   .3987945     2.30   0.022     .1341516    1.697397
-------------+----------------------------------------------------------------
cn_12        |
          ec |  -.5038304   .1859454    -2.71   0.007    -.8682767   -.1393842
             |
     logreer |
         D1. |   .2912442   .1591314     1.83   0.067    -.0206475     .603136
             |
  logfeer_cs |
         D1. |   .9817935   .5367641     1.83   0.067    -.0702447    2.033832
             |
  logreer_cs |
         D1. |   .7929317   .7408428     1.07   0.284    -.6590936    2.244957
             |
       _cons |   1.164842   .5352752     2.18   0.030     .1157222    2.213963
-------------+----------------------------------------------------------------
cn_13        |
          ec |  -.4356833   .1090276    -4.00   0.000    -.6493735   -.2219932
             |
     logreer |
         D1. |   .0073854   .1804721     0.04   0.967    -.3463335    .3611042
             |
  logfeer_cs |
         D1. |   .3156844   .1707548     1.85   0.064    -.0189889    .6503578
             |
  logreer_cs |
         D1. |   .1860594   .2667616     0.70   0.486    -.3367837    .7089025
             |
       _cons |   1.030702   .3848747     2.68   0.007     .2763617    1.785043
-------------+----------------------------------------------------------------
cn_14        |
          ec |  -.3213274   .1300152    -2.47   0.013    -.5761525   -.0665023
             |
     logreer |
         D1. |   .3016198   .2017295     1.50   0.135    -.0937628    .6970024
             |
  logfeer_cs |
         D1. |  -.1339804   .2423437    -0.55   0.580    -.6089653    .3410045
             |
  logreer_cs |
         D1. |  -.0110316   .3169663    -0.03   0.972    -.6322741    .6102109
             |
       _cons |    .767243   .3514035     2.18   0.029     .0785048    1.455981
-------------+----------------------------------------------------------------
cn_15        |
          ec |  -.5849718   .1480311    -3.95   0.000    -.8751073   -.2948363
             |
     logreer |
         D1. |   .3332356   .1223728     2.72   0.006     .0933893    .5730819
             |
  logfeer_cs |
         D1. |  -.0957305    .178922    -0.54   0.593    -.4464113    .2549503
             |
  logreer_cs |
         D1. |   .1477444   .2383474     0.62   0.535     -.319408    .6148968
             |
       _cons |   1.427114   .5493313     2.60   0.009     .3504448    2.503784
-------------+----------------------------------------------------------------
cn_16        |
          ec |  -.4489274   .1376778    -3.26   0.001     -.718771   -.1790838
             |
     logreer |
         D1. |   .2361294   .1019556     2.32   0.021     .0363002    .4359587
             |
  logfeer_cs |
         D1. |   .4850221   .2327401     2.08   0.037     .0288599    .9411843
             |
  logreer_cs |
         D1. |  -.8241984   .2957815    -2.79   0.005    -1.403919   -.2444774
             |
       _cons |   1.084184   .4120553     2.63   0.009     .2765706    1.891798
-------------+----------------------------------------------------------------
cn_17        |
          ec |  -.1804027   .0979829    -1.84   0.066    -.3724456    .0116403
             |
     logreer |
         D1. |   .4682175   .1318382     3.55   0.000     .2098195    .7266156
             |
  logfeer_cs |
         D1. |   .9475243   .4779835     1.98   0.047     .0106938    1.884355
             |
  logreer_cs |
         D1. |  -.3359392   .7236946    -0.46   0.643    -1.754355    1.082476
             |
       _cons |   .4506055   .2632534     1.71   0.087    -.0653617    .9665727
-------------+----------------------------------------------------------------
cn_18        |
          ec |  -.2361957   .1766124    -1.34   0.181    -.5823497    .1099583
             |
     logreer |
         D1. |   .8563716   .2443774     3.50   0.000     .3774006    1.335343
             |
  logfeer_cs |
         D1. |   .0905142    .235024     0.39   0.700    -.3701244    .5511528
             |
  logreer_cs |
         D1. |  -.2982798   .3258211    -0.92   0.360    -.9368775    .3403179
             |
       _cons |   .5541256   .4385186     1.26   0.206     -.305355    1.413606
-------------+----------------------------------------------------------------
cn_19        |
          ec |  -.3076518   .0798602    -3.85   0.000    -.4641749   -.1511288
             |
     logreer |
         D1. |   .4998223   .1728681     2.89   0.004     .1610069    .8386376
             |
  logfeer_cs |
         D1. |   .4932185   .1381751     3.57   0.000     .2224003    .7640366
             |
  logreer_cs |
         D1. |   .6761629   .1836997     3.68   0.000     .3161182    1.036208
             |
       _cons |   .7320994   .2438954     3.00   0.003     .2540731    1.210126
-------------+----------------------------------------------------------------
cn_20        |
          ec |  -.1759517   .1305292    -1.35   0.178    -.4317842    .0798809
             |
     logreer |
         D1. |   .7447509   .2608151     2.86   0.004     .2335627    1.255939
             |
  logfeer_cs |
         D1. |   1.535003   .5386115     2.85   0.004     .4793442    2.590663
             |
  logreer_cs |
         D1. |   -1.26157   .8452209    -1.49   0.136    -2.918172     .395033
             |
       _cons |   .4083923   .3277397     1.25   0.213    -.2339658     1.05075
-------------+----------------------------------------------------------------
cn_21        |
          ec |  -.0943164   .0768209    -1.23   0.220    -.2448826    .0562499
             |
     logreer |
         D1. |   2.488229   .7116129     3.50   0.000     1.093493    3.882964
             |
  logfeer_cs |
         D1. |   1.023429   .6898786     1.48   0.138    -.3287085    2.375566
             |
  logreer_cs |
         D1. |  -1.651165   .8180852    -2.02   0.044    -3.254583   -.0477475
             |
       _cons |   .2588683   .2001188     1.29   0.196    -.1333573     .651094
-------------+----------------------------------------------------------------
cn_22        |
          ec |  -.1593798   .0479731    -3.32   0.001    -.2534053   -.0653542
             |
     logreer |
         D1. |  -.8801959   .3142955    -2.80   0.005    -1.496204   -.2641881
             |
  logfeer_cs |
         D1. |   1.243647   .4183504     2.97   0.003     .4236953    2.063599
             |
  logreer_cs |
         D1. |  -1.617742   .5363271    -3.02   0.003    -2.668923   -.5665598
             |
       _cons |    .398306    .152441     2.61   0.009     .0995272    .6970849
-------------+----------------------------------------------------------------
cn_23        |
          ec |  -.7428762   .1482679    -5.01   0.000    -1.033476   -.4522765
             |
     logreer |
         D1. |   .1343204   .3109356     0.43   0.666    -.4751023     .743743
             |
  logfeer_cs |
         D1. |   -.112863   .5771398    -0.20   0.845    -1.244036     1.01831
             |
  logreer_cs |
         D1. |  -1.188337   .8128575    -1.46   0.144    -2.781508    .4048344
             |
       _cons |   1.791765   .5858796     3.06   0.002     .6434624    2.940068
-------------+----------------------------------------------------------------
cn_24        |
          ec |  -.1804575    .098194    -1.84   0.066    -.3729141    .0119991
             |
     logreer |
         D1. |   1.138504   .1468339     7.75   0.000     .8507153    1.426293
             |
  logfeer_cs |
         D1. |   .0984169   .1934369     0.51   0.611    -.2807123    .4775462
             |
  logreer_cs |
         D1. |   .2499603   .2358342     1.06   0.289    -.2122662    .7121868
             |
       _cons |   .4441031   .2604116     1.71   0.088    -.0662942    .9545004
-------------+----------------------------------------------------------------
cn_25        |
          ec |   -.432704   .1715635    -2.52   0.012    -.7689623   -.0964458
             |
     logreer |
         D1. |   .8119461   .2234686     3.63   0.000     .3739556    1.249937
             |
  logfeer_cs |
         D1. |    2.26555    .614003     3.69   0.000     1.062126    3.468974
             |
  logreer_cs |
         D1. |  -2.810606    .993033    -2.83   0.005    -4.756915   -.8642968
             |
       _cons |   1.087177   .5245348     2.07   0.038     .0591074    2.115246
-------------+----------------------------------------------------------------
cn_26        |
          ec |  -.0783802   .0675554    -1.16   0.246    -.2107863    .0540259
             |
     logreer |
         D1. |   .6224593   .1819991     3.42   0.001     .2657477    .9791709
             |
  logfeer_cs |
         D1. |   .8298745   .2951589     2.81   0.005     .2513737    1.408375
             |
  logreer_cs |
         D1. |  -.1056097   .3549765    -0.30   0.766    -.8013509    .5901315
             |
       _cons |   .2049362   .1735499     1.18   0.238    -.1352155    .5450878
------------------------------------------------------------------------------

. 
. outreg2 using tables\results_cpmg_2_SR, ///
> excel pvalue replace ///
> cttop(D.logfeer) addnote(Notes:)
tables\results_cpmg_2_SR.xml
dir : seeout

. 
. // PESARAN (2006) COMMON CORRELATED EFFECTS 
. // MEAN GROUP ESTIMATOR
. 
. xtmg logreer logfeer, cce robust


Pesaran (2006) Common Correlated Effects Mean Group estimator

All coefficients present represent averages across groups (cn)
Coefficient averages computed as outlier-robust means (using rreg)

Mean Group type estimation                              Number of obs =    754
CCEMG                                                   Wald chi2(1)  =  27.79
                                                        Prob > chi2   = 0.0000

----------------------------------------------------------------------------------
         logreer | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         logfeer |   .4251949   .0806502     5.27   0.000     .2671234    .5832663
__00000M_logreer |   .3095076   .2473784     1.25   0.211    -.1753451    .7943604
__00000L_logfeer |  -.2018718   .2891713    -0.70   0.485    -.7686371    .3648935
           _cons |    .033421   1.116478     0.03   0.976    -2.154835    2.221677
----------------------------------------------------------------------------------
Root Mean Squared Error (sigma): 0.0911
(RMSE uses residuals from group-specific regressions: unaffected by 'robust').
Cross-section averaged regressors are marked by the suffix: 
   _logreer, _logfeer respectively.

. 
. outreg2 using tables\results_ccemg_1, /// 
> excel pvalue replace ///
> cttop() addnote(Notes:)
tables\results_ccemg_1.xml
dir : seeout

. 
. xtmg logfeer logreer, ///
> cce robust


Pesaran (2006) Common Correlated Effects Mean Group estimator

All coefficients present represent averages across groups (cn)
Coefficient averages computed as outlier-robust means (using rreg)

Mean Group type estimation                              Number of obs =    754
CCEMG                                                   Wald chi2(1)  =  89.94
                                                        Prob > chi2   = 0.0000

----------------------------------------------------------------------------------
         logfeer | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         logreer |   .6643342   .0700511     9.48   0.000     .5270366    .8016318
__00000M_logfeer |   .3035869    .204218     1.49   0.137    -.0966731    .7038469
__00000L_logreer |  -.3513779   .3063127    -1.15   0.251    -.9517398     .248984
           _cons |   .8305246   .8182432     1.02   0.310    -.7732026    2.434252
----------------------------------------------------------------------------------
Root Mean Squared Error (sigma): 0.1106
(RMSE uses residuals from group-specific regressions: unaffected by 'robust').
Cross-section averaged regressors are marked by the suffix: 
   _logfeer, _logreer respectively.

. 
. outreg2 using tables\results_ccemg_2, ///
> excel pvalue replace ///
> cttop() addnote(Notes:)
tables\results_ccemg_2.xml
dir : seeout

. 
. // PESARAN & SMITH (1995) 
. // MEAN GROUP ESTIMATOR
. 
. // smg = static mg estimator
. 
. xtmg logreer logfeer, robust


Pesaran & Smith (1995) Mean Group estimator

All coefficients present represent averages across groups (cn)
Coefficient averages computed as outlier-robust means (using rreg)

Mean Group type estimation                              Number of obs =    754
MG                                                      Wald chi2(1)  =  23.43
                                                        Prob > chi2   = 0.0000

------------------------------------------------------------------------------
     logreer | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     logfeer |   .4692192   .0969432     4.84   0.000     .2792141    .6592244
       _cons |   2.426151   .4461212     5.44   0.000      1.55177    3.300533
------------------------------------------------------------------------------
Root Mean Squared Error (sigma): 0.1233
(RMSE uses residuals from group-specific regressions: unaffected by 'robust').

. 
. outreg2 using tables\results_smg_1, ///
> excel pvalue replace ///
> cttop() addnote(Notes:)
tables\results_smg_1.xml
dir : seeout

. 
. xtmg logfeer logreer, robust


Pesaran & Smith (1995) Mean Group estimator

All coefficients present represent averages across groups (cn)
Coefficient averages computed as outlier-robust means (using rreg)

Mean Group type estimation                              Number of obs =    754
MG                                                      Wald chi2(1)  =  53.83
                                                        Prob > chi2   = 0.0000

------------------------------------------------------------------------------
     logfeer | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     logreer |   .6436277    .087724     7.34   0.000     .4716918    .8155635
       _cons |   1.757804   .4234919     4.15   0.000     .9277747    2.587833
------------------------------------------------------------------------------
Root Mean Squared Error (sigma): 0.1452
(RMSE uses residuals from group-specific regressions: unaffected by 'robust').

. 
. outreg2 using tables\results_smg_2, ///
> excel pvalue replace ///
> cttop() addnote(Notes:)
tables\results_smg_2.xml
dir : seeout

. 
. // KAO & CHIANG (2000) DOLS ESTIMATOR
. 
. xtdolshm logreer logfeer, nla(2) nle(2)


DOLS Hom. Panel data Coint. Estimation results  Number of obs      =       624
Group variable: cn                              Number of groups   =        26
Wald chi2(1)  =    183.62                       Obs per group: min =        29
Prob > chi2   =     0.000                                      avg =        29
                                                               max =        29
                                                R-squared          =    0.4306
                                                Adj R-squared      =   0.0152
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     logfeer |   .6773011   .0499828    13.55   0.000     .5793365    .7752657
------------------------------------------------------------------------------

. outreg2 using tables\results_dols_1, ///
> excel pvalue replace ///
> cttop() addnote(Notes:)
tables\results_dols_1.xml
dir : seeout

. 
. xtdolshm logfeer logreer, nla(2) nle(2)


DOLS Hom. Panel data Coint. Estimation results  Number of obs      =       624
Group variable: cn                              Number of groups   =        26
Wald chi2(1)  =    211.22                       Obs per group: min =        29
Prob > chi2   =     0.000                                      avg =        29
                                                               max =        29
                                                R-squared          =    0.4356
                                                Adj R-squared      =   -0.0201
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     logreer |   .8200307   .0564238    14.53   0.000     .7094421    .9306192
------------------------------------------------------------------------------

. outreg2 using tables\results_dols_2, ///
> excel pvalue replace ///
> cttop() addnote(Notes:)
tables\results_dols_2.xml
dir : seeout

. 
. // JAN DITZEN (2021) DCCE PMG
. 
. xtcse2 logreer logfeer
Cross-Sectional Dependence Exponent Estimation and Test

Panel Variable (i): cn
Time Variable (t): datayear

Estimation of Cross-Sectional Exponent (alpha)
----------------------------------------------------------------
       variable|     alpha   Std. Err.    [95% Conf. Interval]
---------------+------------------------------------------------
        logreer|  .4638829   .0566748     .3528023    .5749635
        logfeer|  .6589229   .0404036     .5797333    .7381124
----------------------------------------------------------------
0.5 <= alpha < 1 implies strong cross-sectional dependence.

Testing for weak cross-sectional dependence (CSD)
   H0: weak cross-section dependence
   H1: strong cross-section dependence
------------------------------------------------------------------------
               |    CD            CDw           CDw+          CD*
---------------+--------------------------------------------------------
logreer        |     3.25        0.92        620.60         -1.09
               |  (0.001)     (0.356)       (0.000)       (0.275)
logfeer        |     5.94       -0.63        548.47          3.09
               |  (0.000)     (0.528)       (0.000)       (0.002)
------------------------------------------------------------------------
p-values in parenthesis.
References
  CD:        Pesaran (2015, 2021)
  CDw:       Juodis, Reese (2021)
  CDw+:      CDw with power enhancement from Fan et. al. (2015)
  CD*:       Pesaran, Xie (2021) with 4 PC(s)
Variables are centered around zero.

. 
. xtdcce2 d.logreer d.logfeer, lr(L.logreer logfeer) ///
> p(L.logreer logfeer) cross(_all) cr_lags(0)  exponent
(Dynamic) Common Correlated Effects Estimator - Pooled Mean Group (CS-ECM)

Panel Variable (i): cn                           Number of obs     =        728
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         28
 without cross-sectional averages   = 24
 with cross-sectional averages      = 22
Number of                                        F(106, 622)       =       4.72
 cross-sectional lags               0 to 0       Prob > F          =       0.00
 variables in mean group regression = 28         R-squared         =       0.55
 variables partialled out           = 78         Adj. R-squared    =       0.48
                                                 Root MSE          =       0.07
                                                 CD Statistic      =       0.31
                                                    p-value        =     0.7543
-------------------------------------------------------------------------------
      D.logreer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Short Run Est.|
---------------+---------------------------------------------------------------
   Mean Group: |
      D.logfeer|  .1980608   .0541099    3.66    0.000      .0920074   .3041142
---------------+---------------------------------------------------------------
 Adjust. Term  |
---------------+---------------------------------------------------------------
   Pooled:     |
      L.logreer|  -.318621   .0932028   -3.42    0.001     -.5012951  -.1359469
---------------+---------------------------------------------------------------
 Long Run Est. |
---------------+---------------------------------------------------------------
   Pooled:     |
        logfeer|   .579443   .2636656    2.20    0.028      .0626679   1.096218
-------------------------------------------------------------------------------
Pooled Variables: L.logreer logfeer
Mean Group Variables: D.logfeer
Cross Sectional Averaged Variables: logreer logfeer
Long Run Variables: logfeer 
Cointegration variable(s): L.logreer
Heterogenous constant partialled out. 

Estimation of Cross-Sectional Exponent (alpha)
--------------------------------------------------------------
       variable|     alpha   Std. Err.    [95% Conf. Interval]
---------------+----------------------------------------------
      residuals|  .5653449   .0228405     .5205782    .6101115
--------------------------------------------------------------
0.5 <= alpha < 1 implies strong cross sectional dependence.
SE and CI bootstrapped with 100 repetitions.


. 
. /*
> // variables partialled out = 78 (26 cons, (2*26) 
>    logreer_cs logfeer_cs in T)
> // variables in mean group regression = 28 
>  ((26) D.logfeer + (2) Cross Sectional Averaged Variables: 
>    logreer logfeer)
> */
. 
. xtdcce2 d.logreer d.logfeer, lr(L.logreer logfeer) ///
> p(L.logreer logfeer) cross(_all) cr_lags(2)  exponent
(Dynamic) Common Correlated Effects Estimator - Pooled Mean Group (CS-ECM)

Panel Variable (i): cn                           Number of obs     =        676
Time Variable (t): datayear                      Number of groups  =         26

Degrees of freedom per group:                    Obs per group (T) =         26
 without cross-sectional averages   = 22
 with cross-sectional averages      = 16
Number of                                        F(210, 466)       =       1.70
 cross-sectional lags               2 to 2       Prob > F          =       0.00
 variables in mean group regression = 28         R-squared         =       0.57
 variables partialled out           = 182        Adj. R-squared    =       0.37
                                                 Root MSE          =       0.07
                                                 CD Statistic      =      -0.70
                                                    p-value        =     0.4837
-------------------------------------------------------------------------------
      D.logreer|     Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+---------------------------------------------------------------
 Short Run Est.|
---------------+---------------------------------------------------------------
   Mean Group: |
      D.logfeer|  .2203299   .0586742    3.76    0.000      .1053305   .3353293
---------------+---------------------------------------------------------------
 Adjust. Term  |
---------------+---------------------------------------------------------------
   Pooled:     |
      L.logreer| -.2919711   .0964745   -3.03    0.002     -.4810577  -.1028846
---------------+---------------------------------------------------------------
 Long Run Est. |
---------------+---------------------------------------------------------------
   Pooled:     |
        logfeer|  .6604173   .2884739    2.29    0.022      .0950189   1.225816
-------------------------------------------------------------------------------
Pooled Variables: L.logreer logfeer
Mean Group Variables: D.logfeer
Cross Sectional Averaged Variables: logreer logfeer
Long Run Variables: logfeer 
Cointegration variable(s): L.logreer
Heterogenous constant partialled out. 

Estimation of Cross-Sectional Exponent (alpha)
--------------------------------------------------------------
       variable|     alpha   Std. Err.    [95% Conf. Interval]
---------------+----------------------------------------------
      residuals|  .5791701   .0216867      .536665    .6216753
--------------------------------------------------------------
0.5 <= alpha < 1 implies strong cross sectional dependence.
SE and CI bootstrapped with 100 repetitions.


. 
. /*
> // variables partialled out = 78 (26 cons, (6*26) 
>    logreer_cs logfeer_cs in T, T+1 and T+2)
> // variables in mean group regression = 28 
>  ((26) D.logfeer + (2) Cross Sectional Averaged Variables: 
>    logreer logfeer)
> */
.  
. xtcd2, pesaran cdw contour(abs) reps(50)
Residuals calculated using  predict, residuals from xtdcce2.


Testing for weak cross-sectional dependence (CSD)
   H0: weak cross-section dependence
   H1: strong cross-section dependence
--------------------------------------------
               |    CD            CDw
---------------+----------------------------
residuals      |    -0.70       -0.83
               |  (0.484)     (0.408)
--------------------------------------------
p-values in parenthesis.
References
  CD:        Pesaran (2015, 2021)
  CDw:       Juodis, Reese (2021)

.  
. // Save the data
. save data\xrdynamics.dta, replace
file data\xrdynamics.dta saved

. 
. *log close xrdynamics
. exit

end of do-file


. exit, clear
