---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  svarZn
       log:  C:\Users\jamel\Dropbox\Latex\PROJECTS\24-09-commo-geopolitical-risks\Data and command\GPR\Zn\svarZn.log
  log type:  text
 opened on:  23 Oct 2024, 09:23:48

. 
. **#  ***** Analysing geopolitical risks on commo price *********
. 
. set scheme Cleanplots

. graph set window fontface "Arial Narrow"

. 
. cls

. clear

. 
. version 18.5

. set more off

. 
. // Please change the path with your own folder
. 
. /*
> cd "C:\Users\jamel\Dropbox\latex\PROJECTS"
> cd "24-09-commo-geopolitical-risks"
> cd "Data and command"
> */
. 
. import excel data.xlsx,/*
> */ sheet("Feuil1") firstrow clear
(12 vars, 476 obs)

. 
. generate period = tm(1985m1) + _n-1

. format %tm period

. 
. tsset period

Time variable: period, 1985m1 to 2024m8
        Delta: 1 month

. 
. des

Contains data
 Observations:           476                  
    Variables:            13                  
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
GPR             double  %10.0g                GPR
GPRT            double  %10.0g                GPRT
GPRA            double  %10.0g                GPRA
GECON           double  %10.0g                GECON
GINF            double  %10.0g                GINF
GRATE           double  %10.0g                GRATE
Al              double  %10.0g                Al
Cu              double  %10.0g                Cu
Sn              double  %10.0g                Sn
Ni              double  %10.0g                Ni
Zn              double  %10.0g                Zn
Pt              double  %10.0g                Pt
period          float   %tm                   
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: period
     Note: Dataset has changed since last saved.

. 
. *ssc install labvars
. 
. labvars GPR GPRT GPRA GECON GINF GRATE Al Cu Sn Ni Zn Pt ///
>  "Geopolitical Risks" "Geopolitical Threats" ///
>  "Geopolitical Acts" "Global Economic Conditions" ///
>  "Global Inflation" "Global Interest Rates" ///
>  "Aluminium Price" "Copper Price" ///
>  "Tin Price" "Nickel Price" ///
>  "Zinc Price" "Platinium Price"

.  
. tsline GPR GPRA GPRT, name(GPR, replace) 

. tsline GECON d.GINF, name(ECO, replace) 

. tsline Al Cu Sn Ni Zn Pt, name(CMO, replace) 

. 
. foreach i in GPR ECO CMO {
  2.  gr dis `i' 
  3.  gr export `i'.png, as(png) width(4000) replace
  4.  }
file GPR.png saved as PNG format
file ECO.png saved as PNG format
file CMO.png saved as PNG format

. 
. /* Source: 
>  GECON: Review of Economics and Statistics,Â 104(4), July 2022, 828-844.
>  GPR: American Economic Review, 112(4), 1194-1225.
>  CMO: World Bank Commodity Price Data (The Pink Sheet)
>  */
. 
. gen LGPR = log(GPR)

. gen LGPRA = log(GPRA)

. gen LGPRT = log(GPRT) 

. gen LGINF = log(GINF) 
(1 missing value generated)

. gen LZn = log(Zn)

.  
. order period, first

. 
. save dataset.dta, replace
file dataset.dta saved

.            
. matrix A = (1,0,0,0\.,1,0,0\.,.,1,0\.,.,.,1)

. matlist A

             |        c1         c2         c3         c4 
-------------+-------------------------------------------
          r1 |         1          0          0          0 
          r2 |         .          1          0          0 
          r3 |         .          .          1          0 
          r4 |         .          .          .          1 

. 
. matrix B = (.,0,0,0\0,.,0,0\0,0,.,0\0,0,0,.) 

. matlist B

             |        c1         c2         c3         c4 
-------------+-------------------------------------------
          r1 |         .                                  
          r2 |         0          .                       
          r3 |         0          0          .            
          r4 |         0          0          0          . 

. 
. varsoc LGPR GECON LGINF LZn, maxlag(12)

Lag-order selection criteria

   Sample: 1986m1 thru 2024m7                              Number of obs = 463
  +---------------------------------------------------------------------------+
  | Lag |    LL      LR      df    p     FPE       AIC      HQIC      SBIC    |
  |-----+---------------------------------------------------------------------|
  |   0 | -884.884                     .000547   3.83967   3.85374   3.87542  |
  |   1 |  2753.82  7277.4   16  0.000 8.7e-11  -11.8092  -11.7388  -11.6304  |
  |   2 |  2895.58  283.53   16  0.000 5.1e-11  -12.3524  -12.2258* -12.0307* |
  |   3 |  2911.69  32.215   16  0.009 5.1e-11* -12.3529* -12.1699  -11.8882  |
  |   4 |   2922.7  22.009   16  0.143 5.2e-11  -12.3313  -12.0921  -11.7236  |
  |   5 |  2938.22  31.055   16  0.013 5.2e-11  -12.3293  -12.0337  -11.5786  |
  |   6 |  2949.16  21.876   16  0.147 5.3e-11  -12.3074  -11.9556  -11.4137  |
  |   7 |  2956.14   13.96   16  0.602 5.5e-11  -12.2684  -11.8603  -11.2318  |
  |   8 |  2968.57  24.863   16  0.072 5.6e-11   -12.253  -11.7886  -11.0734  |
  |   9 |   2974.6  12.046   16  0.741 5.9e-11  -12.2099  -11.6892  -10.8873  |
  |  10 |  2981.97  14.746   16  0.543 6.1e-11  -12.1726  -11.5957   -10.707  |
  |  11 |  2999.05  34.161*  16  0.005 6.1e-11  -12.1773   -11.544  -10.5687  |
  |  12 |  3011.62  25.136   16  0.067 6.2e-11  -12.1625  -11.4729  -10.4109  |
  +---------------------------------------------------------------------------+
   * optimal lag
   Endogenous: LGPR GECON LGINF LZn
    Exogenous: _cons

. 
. svar LGPR GECON LGINF LZn, aeq(A) beq(B) ///
> lags(1/12) 
Estimating short-run parameters

Iteration 0:  Log likelihood =  -2173.252  
Iteration 1:  Log likelihood = -625.54886  
Iteration 2:  Log likelihood =  115.47452  
Iteration 3:  Log likelihood =  758.48542  
Iteration 4:  Log likelihood =  2137.4202  
Iteration 5:  Log likelihood =  2611.5265  
Iteration 6:  Log likelihood =  2883.4753  
Iteration 7:  Log likelihood =    3001.69  
Iteration 8:  Log likelihood =   3011.425  
Iteration 9:  Log likelihood =  3011.6168  
Iteration 10: Log likelihood =  3011.6168  

Structural vector autoregression

 ( 1)  [/A]1_1 = 1
 ( 2)  [/A]1_2 = 0
 ( 3)  [/A]1_3 = 0
 ( 4)  [/A]1_4 = 0
 ( 5)  [/A]2_2 = 1
 ( 6)  [/A]2_3 = 0
 ( 7)  [/A]2_4 = 0
 ( 8)  [/A]3_3 = 1
 ( 9)  [/A]3_4 = 0
 (10)  [/A]4_4 = 1
 (11)  [/B]1_2 = 0
 (12)  [/B]1_3 = 0
 (13)  [/B]1_4 = 0
 (14)  [/B]2_1 = 0
 (15)  [/B]2_3 = 0
 (16)  [/B]2_4 = 0
 (17)  [/B]3_1 = 0
 (18)  [/B]3_2 = 0
 (19)  [/B]3_4 = 0
 (20)  [/B]4_1 = 0
 (21)  [/B]4_2 = 0
 (22)  [/B]4_3 = 0

Sample: 1986m1 thru 2024m7                      Number of obs     =        463
Exactly identified model                        Log likelihood    =   3011.617

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
/A           |
         1_1 |          1  (constrained)
         2_1 |   .1804652   .0702681     2.57   0.010     .0427422    .3181882
         3_1 |   -.000786   .0003231    -2.43   0.015    -.0014193   -.0001527
         4_1 |   .0155206   .0129998     1.19   0.233    -.0099584    .0409997
         1_2 |          0  (constrained)
         2_2 |          1  (constrained)
         3_2 |   -.000997   .0002122    -4.70   0.000    -.0014129   -.0005811
         4_2 |  -.0441123    .008683    -5.08   0.000    -.0611308   -.0270939
         1_3 |          0  (constrained)
         2_3 |          0  (constrained)
         3_3 |          1  (constrained)
         4_3 |  -1.743355   1.857894    -0.94   0.348     -5.38476    1.898051
         1_4 |          0  (constrained)
         2_4 |          0  (constrained)
         3_4 |          0  (constrained)
         4_4 |          1  (constrained)
-------------+----------------------------------------------------------------
/B           |
         1_1 |   .2054259   .0067507    30.43   0.000     .1921947     .218657
         2_1 |          0  (constrained)
         3_1 |          0  (constrained)
         4_1 |          0  (constrained)
         1_2 |          0  (constrained)
         2_2 |   .3106018    .010207    30.43   0.000     .2905964    .3306072
         3_2 |          0  (constrained)
         4_2 |          0  (constrained)
         1_3 |          0  (constrained)
         2_3 |          0  (constrained)
         3_3 |   .0014182   .0000466    30.43   0.000     .0013269    .0015096
         4_3 |          0  (constrained)
         1_4 |          0  (constrained)
         2_4 |          0  (constrained)
         3_4 |          0  (constrained)
         4_4 |   .0566959   .0018631    30.43   0.000     .0530442    .0603476
------------------------------------------------------------------------------

. 
. /* compute the inv(B)*A matrix */
. matrix A=e(A)

. matrix B=e(B)

. matrix BA = inv(B)*A

. /* compute reduced form epsilon_t residuals */
. var LGPR GECON LGINF LZn

Vector autoregression

Sample: 1985m3 thru 2024m7                      Number of obs     =        473
Log likelihood =   2962.748                     AIC               =  -12.37525
FPE            =   4.96e-11                     HQIC              =  -12.25075
Det(Sigma_ml)  =   4.26e-11                     SBIC              =  -12.05871

Equation           Parms      RMSE     R-sq      chi2     P>chi2
----------------------------------------------------------------
LGPR                  9     .218462   0.5926   687.9186   0.0000
GECON                 9     .336388   0.4810   438.3606   0.0000
LGINF                 9     .001609   1.0000   3.87e+07   0.0000
LZn                   9     .061367   0.9839   28948.09   0.0000
----------------------------------------------------------------

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
LGPR         |
        LGPR |
         L1. |   .7305456   .0464828    15.72   0.000     .6394409    .8216503
         L2. |   .0460035   .0462659     0.99   0.320     -.044676     .136683
             |
       GECON |
         L1. |   .0099543   .0308749     0.32   0.747    -.0505595     .070468
         L2. |  -.0199967   .0297464    -0.67   0.501    -.0782987    .0383052
             |
       LGINF |
         L1. |   1.558544   4.896805     0.32   0.750    -8.039018    11.15611
         L2. |  -1.543933   4.872066    -0.32   0.751    -11.09301    8.005141
             |
         LZn |
         L1. |   -.027321   .1647384    -0.17   0.868    -.3502023    .2955602
         L2. |   .0168666   .1648179     0.10   0.918    -.3061706    .3399037
             |
       _cons |   1.022606     .21988     4.65   0.000      .591649    1.453563
-------------+----------------------------------------------------------------
GECON        |
        LGPR |
         L1. |    .093957   .0715743     1.31   0.189    -.0463261      .23424
         L2. |  -.1005719   .0712402    -1.41   0.158    -.2402001    .0390564
             |
       GECON |
         L1. |   .6677477   .0475412    14.05   0.000     .5745685    .7609268
         L2. |  -.0282186   .0458036    -0.62   0.538     -.117992    .0615547
             |
       LGINF |
         L1. |  -16.22932   7.540101    -2.15   0.031    -31.00765   -1.450997
         L2. |   16.10201   7.502007     2.15   0.032     1.398349    30.80568
             |
         LZn |
         L1. |   .6378147   .2536641     2.51   0.012     .1406421    1.134987
         L2. |  -.6514035   .2537866    -2.57   0.010    -1.148816    -.153991
             |
       _cons |   .7641257   .3385712     2.26   0.024     .1005383    1.427713
-------------+----------------------------------------------------------------
LGINF        |
        LGPR |
         L1. |   .0000321   .0003424     0.09   0.925     -.000639    .0007032
         L2. |  -.0000932   .0003408    -0.27   0.785    -.0007612    .0005748
             |
       GECON |
         L1. |   .0006143   .0002274     2.70   0.007     .0001685    .0010601
         L2. |  -.0007426   .0002191    -3.39   0.001    -.0011721   -.0003131
             |
       LGINF |
         L1. |   1.623191    .036072    45.00   0.000     1.552491     1.69389
         L2. |  -.6251704   .0358897   -17.42   0.000     -.695513   -.5548278
             |
         LZn |
         L1. |    .001613   .0012135     1.33   0.184    -.0007655    .0039915
         L2. |  -.0007705   .0012141    -0.63   0.526    -.0031501    .0016092
             |
       _cons |   .0043361   .0016197     2.68   0.007     .0011614    .0075107
-------------+----------------------------------------------------------------
LZn          |
        LGPR |
         L1. |   .0002373   .0130572     0.02   0.986    -.0253544     .025829
         L2. |   .0031342   .0129963     0.24   0.809    -.0223381    .0286064
             |
       GECON |
         L1. |   .0102222   .0086729     1.18   0.239    -.0067763    .0272208
         L2. |   .0012729   .0083559     0.15   0.879    -.0151043    .0176502
             |
       LGINF |
         L1. |   -1.43514   1.375532    -1.04   0.297    -4.131133    1.260854
         L2. |   1.445203   1.368583     1.06   0.291     -1.23717    4.127576
             |
         LZn |
         L1. |   1.236214   .0462757    26.71   0.000     1.145516    1.326913
         L2. |  -.2544256    .046298    -5.50   0.000     -.345168   -.1636831
             |
       _cons |   .0800555   .0617652     1.30   0.195     -.041002     .201113
------------------------------------------------------------------------------

. capture drop epsilon*

. predict double epsilon1,residual eq(#1)
(2 missing values generated)

. predict double epsilon2,residual eq(#2)
(2 missing values generated)

. predict double epsilon3,residual eq(#3)
(3 missing values generated)

. predict double epsilon4,residual eq(#4)
(2 missing values generated)

. /* store the epsilon* variables in the epsilon matrix */
. mkmat epsilon*, matrix(epsilon) 

. /* compute e_t matrix of structural shocks */
. matrix e = (BA*epsilon')'

. /* store columns of e as variables e1, e2, and e3 */  
. svmat double e

. 
. label variable epsilon1 "Reduced-form shocks Zn - GPR"

. label variable e1 "Structural shocks Zn - GPR"

. 
. **# Plot the shocks
. twoway (tsline e1) ///
>  (tsline epsilon1, yaxis(1)), ///
>  name(G1Zn, replace) legend(position(6)) ///
>  graphregion(margin(r+5))

.  
. graph export "G1Zn.png", as(png) width(4000) replace
file G1Zn.png saved as PNG format

. 
. irf set comparemodels.irf, replace
(file comparemodels.irf created)
(file comparemodels.irf now active)

. quietly lpirf GECON LGINF LZn, step(50) lags(1/12) ///
>   exog(L(0/12).e1) vce(robust)

. irf create lpmodel 
(file comparemodels.irf updated)

. 
. /*
> quietly var GECON LGINF LZn, lags(1/12) ///
>   exog(L(0/12).e1)
> irf create varmodel, step(50)
> */
. 
. irf graph dm, impulse(e1) response(LZn) ///
>   irf(lpmodel) level(95) ///
>   xlabel(0(12)48,grid) name(G2Zn, replace) ///
>   xsize(4)

.         
. graph export "G2Zn.png", as(png) width(4000) replace
file G2Zn.png saved as PNG format

. 
. save datasetZn.dta, replace
file datasetZn.dta saved

. 
. ****************************************************************
. 
. log close _all
      name:  svarZn
       log:  C:\Users\jamel\Dropbox\Latex\PROJECTS\24-09-commo-geopolitical-risks\Data and command\GPR\Zn\svarZn.log
  log type:  text
 closed on:  23 Oct 2024, 09:24:07
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
