--------------------------------------------------------------------------------------------------------------------
      name:  tvpregZn
       log:  C:\Users\jamel\Dropbox\Latex\PROJECTS\24-09-commo-geopolitical-risks\Data and command\GPR\Zn\tvpregZn.l
> og
  log type:  text
 opened on:   4 Nov 2024, 19:05:15

. 
. ////////////// Execute the routine //////////////
> qui do "tvpreg.ado"

. /////////////////////////////////////////////////
> 
. *cd C:\Users\jamel\Dropbox\stata\tvpreg\tvpreg\code
. 
. set scheme sj

. 
. use datasetZn.dta, clear

. des

Contains data from datasetZn.dta
 Observations:           476                  
    Variables:            26                  23 Oct 2024 09:24
--------------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
--------------------------------------------------------------------------------------------------------------------
period          float   %tm                   
GPR             double  %10.0g                Geopolitical Risks
GPRT            double  %10.0g                Geopolitical Threats
GPRA            double  %10.0g                Geopolitical Acts
GECON           double  %10.0g                Global Economic Conditions
GINF            double  %10.0g                Global Inflation
GRATE           double  %10.0g                Global Interest Rates
Al              double  %10.0g                Aluminium Price
Cu              double  %10.0g                Copper Price
Sn              double  %10.0g                Tin Price
Ni              double  %10.0g                Nickel Price
Zn              double  %10.0g                Zinc Price
Pt              double  %10.0g                Platinium Price
LGPR            float   %9.0g                 
LGPRA           float   %9.0g                 
LGPRT           float   %9.0g                 
LGINF           float   %9.0g                 
LZn             float   %9.0g                 
epsilon1        double  %10.0g                Reduced-form shocks Zn - GPR
epsilon2        double  %10.0g                Residuals
epsilon3        double  %10.0g                Residuals
epsilon4        double  %10.0g                Residuals
e1              double  %10.0g                Structural shocks Zn - GPR
e2              double  %10.0g                
e3              double  %10.0g                
e4              double  %10.0g                
--------------------------------------------------------------------------------------------------------------------
Sorted by: period

. 
. tsset period

Time variable: period, 1985m1 to 2024m8
        Delta: 1 month

. 
. foreach v in LGPR GECON LGINF LZn e1 {
  2.     forvalues i = 1(1)12 {
  3.         gen `v'_l`i' = l`i'.`v'
  4. }
  5. }
(1 missing value generated)
(2 missing values generated)
(3 missing values generated)
(4 missing values generated)
(5 missing values generated)
(6 missing values generated)
(7 missing values generated)
(8 missing values generated)
(9 missing values generated)
(10 missing values generated)
(11 missing values generated)
(12 missing values generated)
(1 missing value generated)
(2 missing values generated)
(3 missing values generated)
(4 missing values generated)
(5 missing values generated)
(6 missing values generated)
(7 missing values generated)
(8 missing values generated)
(9 missing values generated)
(10 missing values generated)
(11 missing values generated)
(12 missing values generated)
(1 missing value generated)
(2 missing values generated)
(3 missing values generated)
(4 missing values generated)
(5 missing values generated)
(6 missing values generated)
(7 missing values generated)
(8 missing values generated)
(9 missing values generated)
(10 missing values generated)
(11 missing values generated)
(12 missing values generated)
(1 missing value generated)
(2 missing values generated)
(3 missing values generated)
(4 missing values generated)
(5 missing values generated)
(6 missing values generated)
(7 missing values generated)
(8 missing values generated)
(9 missing values generated)
(10 missing values generated)
(11 missing values generated)
(12 missing values generated)
(3 missing values generated)
(4 missing values generated)
(5 missing values generated)
(6 missing values generated)
(7 missing values generated)
(8 missing values generated)
(9 missing values generated)
(10 missing values generated)
(11 missing values generated)
(12 missing values generated)
(13 missing values generated)
(14 missing values generated)

. 
. gen dummyGFC = 0

. replace dummyGFC = 1 if period > tm(2009m6)
(182 real changes made)

. lab var dummyGFC "Post-GFC"

. 
. summ GPR, detail

                     Geopolitical Risks
-------------------------------------------------------------
      Percentiles      Smallest
 1%         45.4          39.05
 5%        55.59          42.69
10%        65.53             44       Obs                 476
25%        79.45          45.06       Sum of wgt.         476

50%        91.52                      Mean           101.5414
                        Largest       Std. dev.      47.53233
75%       110.39         358.71
90%       140.37         379.25       Variance       2259.322
95%       162.12         498.65       Skewness       4.298439
99%       339.36         512.53       Kurtosis       30.51011

. gen dummyGPR = 0

. replace dummyGPR = 1 if GPR > `r(p90)'
(47 real changes made)

. lab var dummyGPR "High-GFC"

. 
. summ GECON, detail

                 Global Economic Conditions
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.736247      -4.467697
 5%    -.6654296      -3.266629
10%    -.4326625      -2.394717       Obs                 476
25%    -.1195726      -2.153356       Sum of wgt.         476

50%     .0824639                      Mean           .0175379
                        Largest       Std. dev.         .4615
75%     .2504911       .9365798
90%     .4009748        .980115       Variance       .2129822
95%     .5553192       .9960127       Skewness      -3.481576
99%     .8742118       1.386385       Kurtosis       28.73608

. gen dummyGECON = 0

. replace dummyGECON = 1 if GECON < `r(p10)'
(47 real changes made)

. lab var dummyGECON "Low-GECON"

. 
. ///// Estimator II: TVP-LP /////
> // Commo price rates to a one-unit geopolitical risk shock (GPR)
. mat define cmat = (0,3,6,9,12,15)

. tvpreg LZn e1 LGPR_l* GECON_l* LGINF_l* LZn_l* e1_l*, ///
>  cmatrix(cmat) nhor(0/48) getband newey chol
Running the Time-Varying-Parameter Estimation...
The model is:

    y(t+h) = B(h,t+h) × x(t) + e(t+h)

 with horizon (h) includes 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 
> 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48,
      dependent variable   y(t) (1×1): LZn,
      independent variable x(t) (62×1): e1 LGPR_l1 LGPR_l2 LGPR_l3 LGPR_l4 LGPR_l5 LGPR_l6 LGPR_l7 LGPR_l8 LGPR_l9 L
> GPR_l10 LGPR_l11 LGPR_l12 GECON_l1 GECON_l2 GECON_l3 GECON_l4 GECON_l5 GECON_l6 GECON_l7 GECON_l8 GECON_l9 GECON_l
> 10 GECON_l11 GECON_l12 LGINF_l1 LGINF_l2 LGINF_l3 LGINF_l4 LGINF_l5 LGINF_l6 LGINF_l7 LGINF_l8 LGINF_l9 LGINF_l10 
> LGINF_l11 LGINF_l12 LZn_l1 LZn_l2 LZn_l3 LZn_l4 LZn_l5 LZn_l6 LZn_l7 LZn_l8 LZn_l9 LZn_l10 LZn_l11 LZn_l12 e1_l1 e
> 1_l2 e1_l3 e1_l4 e1_l5 e1_l6 e1_l7 e1_l8 e1_l9 e1_l10 e1_l11 e1_l12 _cons,
      e(t+h) ~ N(0,σ(e,t+h)^2).

The parameter is [vec(B(h,t+h)')',lnσ(e,t+h)]',

The constant parameter model is estimated by OLS.

. 
. tvpplot, plotcoef(LZn:e1) plotconst name(e1_Zn)
Plotting the parameter path over horizons...
slope para: effect of e1 on LZn

. graph export e1_Zn.png, as(png) width(4000) replace
file e1_Zn.png saved as PNG format

. 
. matrix tvlp_path=e(beta)

. putexcel set GPR_Zn, replace
note: file will be replaced when the first putexcel command is issued.

. putexcel A1=matrix(tvlp_path) 
file GPR_Zn.xlsx saved

. // Line 3025 (63*48, TV param*horizon) for horizon 48 in Excel
. 
. tvpplot, plotcoef(LZn:e1) plotconst period(dummyGFC) name(GFCTV)
Plotting the parameter path over horizons...
slope para: effect of e1 on LZn

. tvpplot, plotcoef(LZn:e1) plotconst period(dummyGPR) name(GPRTV)
Plotting the parameter path over horizons...
slope para: effect of e1 on LZn

. tvpplot, plotcoef(LZn:e1) plotconst period(dummyGECON) name(GECONTV)
Plotting the parameter path over horizons...
slope para: effect of e1 on LZn

. 
. foreach i in GFCTV GPRTV GECONTV {
  2.  gr dis `i' 
  3.  gr export `i'.png, as(png) width(4000) replace
  4.  }
file GFCTV.png saved as PNG format
file GPRTV.png saved as PNG format
file GECONTV.png saved as PNG format

. 
. 
. forvalues i = 1(1)48 {
  2. tvpplot, plotcoef(LZn:e1) plotnhor(`i') ///
>  plotconst name(figZn_`i') period(dummyGECON)
  3.  }
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn
Plotting the parameter path over time...
slope para: effect of e1 on LZn

.  
. foreach i in 1 6 12 24 36 48 {
  2.  gr dis figZn_`i'
  3.  gr export figZn_`i'.png, as(png) width(4000) replace
  4.  }
file figZn_1.png saved as PNG format
file figZn_6.png saved as PNG format
file figZn_12.png saved as PNG format
file figZn_24.png saved as PNG format
file figZn_36.png saved as PNG format
file figZn_48.png saved as PNG format

. 
. ****************************************************************
. 
. log close _all
      name:  tvpregZn
       log:  C:\Users\jamel\Dropbox\Latex\PROJECTS\24-09-commo-geopolitical-risks\Data and command\GPR\Zn\tvpregZn.l
> og
  log type:  text
 closed on:   4 Nov 2024, 19:09:01
--------------------------------------------------------------------------------------------------------------------
